{
    "textbook_id": "english9",
    "chunks": [
        {
            "page_number": 1,
            "text": "ENGLISH FOR\n\nETHIOPIA ENGLISH FOR\nETHIOPIA\nSTUDENT TEXTBOOK STUDENT TEXTBOOK\nGRADE 9 GRADE 9\n\n64dVaAD MOOPLXAL LNAGALS VIdOIHLaA XOH HSITONA\n\nFEDERAL DEMOCRATIC REPUBLIC OF ETHIOPIA\nMINISTRY OF EDUCATION"
        },
        {
            "page_number": 2,
            "text": "a le td\n\nThis textbook is the property of your school.\nTake good care not to damage or lose it.\n\nHere are 10 ideas to help take care of the book:\n\nCover the book with protective material, such as plastic,\nold newspapers or magazines.\n\nAlways keep the book in a clear dry place.\n\nBe sure your hands are clearn when you use the book.\nDo not write on the cover or inside pages.\n\nUse a piece of paper or cardboard as a bookmark.\nNever tear or cut out any picture or pages.\n\nRepair any torn pages with paste or tape.\n\nPack the book carefully when you pleace it in your\nschool bag.\n\nHandle the book with care when passing it to another\nperson.\n\nWhen using a new book for the first time, lay it on its\nback. Open only a few pages at a time. Press lightly along\nthe bound edge as you turn the pages. This will keep the\ncover in good condition."
        },
        {
            "page_number": 3,
            "text": ""
        },
        {
            "page_number": 4,
            "text": "ENGLISH FOR\nETHIOPIA\n\nSTUDENT TEXTBOOK\nGRADE 9\n\nWriters:\nAbty Yigzaw (Prof.)\nBirhanu Simegn (PhD)\nEditors:\nYinager Teklesellassie (PhD) (Content Editor)\nAkalewold Eshetie (PhD) (Curriculum Editor)\nEskinder Getachew (PhD) (Language Editor)\nDesigner\nZemenu Haile (MSc)\nIllustrator\nTewodros Altaye (MSc)\nReviewer & Validators:\nHaile Kassahun (PhD) (Reviewer) Solomon Worku (PhD Candi.)\nMeheretu Adnew (PhD) (Validator) Hamid Mustefa (MA)\nOchare Oraya (MA) (Validator) Badima Belay (PhD)\nMohammed Hassen (PhD Candi.)\n\nFEDERAL DEMOCRATIC REPUBLIC OF ETHIOPIA HAWASSA UNIVERSITY\nMINISTRY OF EDUCATION"
        },
        {
            "page_number": 5,
            "text": ""
        },
        {
            "page_number": 6,
            "text": "First Published August 2023 by the Federal Democratic Republic\nof Ethiopia, Ministry of Education, under the General Education\nQuality Improvement Program for Equity (GEQIP-E) supported by\nthe World Bank, UK’s Department for International Development/\n(DFID) -now merged with the Foreign, Commonwealth\nandDevelopment Office (FCDO), Finland Ministry for Foreign\nAffairs (FMFA), the Royal Norwegian Embassy, United Nations\nChildren’s Fund (UNICEF), the Global Partnership for Education\n(GPE), and Danish Ministry of Foreign Affairs (DMFA), through a\nMulti Donor Trust Fund.\n\n© 2023 by the Federal Democratic Republic of Ethiopia, Ministry\nof Education. All rights reserved. The moral rights of the author\nhave been asserted. No part of this book may be reproduced,\ncopied in a retrieval system or transmitted in any form or by any\nmeans including electronic, mechanical, magnetic, photocopying,\nrecording or otherwise, without the prior written permission of the\nMinistry of Education or licensing in accordance with the Federal\nDemocratic Republic of Ethiopia as expressed in the Federal Negarit\nGazeta, Proclamation No. 410/2004 - Copyright and Neighboring\nRights Protection.\n\nPrinted by:\n\nGRAVITY GROUP IND LLC\nP.O.Box 13TH Industrial Area, Sharjah\n\nUNITED ARAB EMIRATES\nUnder Ministry of Education\nContract no. MOE/GEQIP-E/LICB/G-01/23\n\nISBN: 978-99990-0-000-0\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 7,
            "text": "Foreword\nEducation and development are closely related endeavors. This is the main reason\nwhy it is said that education is the key instrument in Ethiopia’s development and\nsocial transformation. The fast and globalized world we now live in requires\nnew knowledge, skill and attitude on the part of each individual. It is with this\nobjective in view that the curriculum, which is not only the Blueprint but also\na reflection of a country’s education system, must be responsive to changing\n\nconditions.\n\nIt has been almost three decades since Ethiopia launched and implemented new\nEducation and Training Policy. Since the 1994 Education and Training Policy\nour country has recorded remarkable progress in terms of access, equity and\nrelevance. Vigorous efforts also have been made, and continue to be made, to\n\nimprove the quality of education.\n\nTo continue this progress, the Ministry of Education has developed a new\nGeneral Education Curriculum Framework in 2021. The Framework covers all\npre-primary, primary, middle level and secondary level grades and subjects. It\naims to reinforce the basic tenets and principles outlined in the Education and\nTraining Policy, and provides guidance on the preparation of all subsequent\ncurriculum materials — including this Teacher Guide and Student Textbook that\ncome with it — to be based on active-learning methods and a competency -\n\nbased approach.\n\nIn the development of this new curriculum, recommendations of the education\nRoad Map studies conducted in 2018 are used as milestones. The new curriculum\nmaterials attempt to balance the content with students’ age, incorporate\nindigenous knowledge where necessary, use technology for learning and teaching,\nintegrate vocational contents, incorporate moral education as well as career and\ntechnical education as subjects in order to accommodate the diverse needs of\n\nlearners.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 8,
            "text": "Publication of a new framework, textbooks and teacher guides are by no means the sole\nsolution to improving the quality of education in any country. Continued improvement\ncalls for the efforts of all stakeholders. The teacher’s role must become more flexible\nranging from lecturer to motivator, guider and facilitator. To assist this, teachers have\nbeen given, and will continue to receive training on the strategies suggested in the\nframework and in this teacher guide.\n\nTeachers are urged to read this Guide carefully and to support their students by putting\ninto action the strategies and activities suggested in it.\n\nFor systemic reform and continuous improvement in the quality of curriculum materials,\nthe Ministry of Education welcomes comments and suggestions which will enable us to\n\nundertake further review and refinement.\n\nADDIS ABABA, ETHIOPIA FEDERAL DEMOCRATIC REPUBLIC OF ETHIOPIA\nAugust, 2023 MINISTRY OF EDUCATION\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 9,
            "text": "Contents\n\n1. Living in Urban Areag.................... 1\n\n1.1 Listening SKUs .............. te eccscecctecsscecceessseeees 2\n1.2 Reading Skills ...................cccccessssccccessssccccessseeees 4\n1.3 Vocabulary Development....................cccccssssseeee 8\n1.4 Gram Mar ........ ce cccccceeescccssscceeeeecceeeeccsssscseeseesees 11\n1.5 Speaking SKills....................cccccsssssccccessssceeceeeeeee 26\n1.6 Writing SKills ................cccctcesssccccessseeeeeeeeeee 30\n2.1 Listening SKills ...................scscccsccceeeceessssssscscees 33\n2.2 Reading SkKiIIS .............eeeecscssccccceeeeeeeeescccsccoees 34\n2.3 Vocabulary Development................ccccsssceccceeees 39\n2.4 GLAMMAL ............ccccccccccscccccecsscccccecsseeceeecsseeeeees 41\n2.5 Speaking SKiIIs.................cccssscccsccsceceeesescscssssees 53\n2.6 Writing SKills 0.0.00... eeecssccsccccccecceeecsssssseee 57\n3. Traffic Accident ...............ccceceeee\n3.1 Listening Skills ...................ecctsessecccesceseeeeeees 61\n3.2 Reading SKills ....................ccscccsssssssecccescsseeeeeees 63\n3.3. Vocabulary Development.....................ccseeeeeees 66\n3.4 GraMmMa Tr ............ccccccccesecceessssscccccceseccesescccscsccees 67\n3.5 Speaking Skills ..................sssssccccssssseccccscsseeeeeees 80\n3.6 Writing Skills .................csssccectsssseecceeceseeeeeees 82\n4. National Parks ...............ccccecceeeee OO\n4.1 Listening Skills .....................ccecccsssscccceessseeeeeees 87\n4.2 Reading Skills....................:sssssccccssssscccccsssseeeeeees 88\n4.3 Vocabulary Development....................ssssseeeeeees 95\n4.4 Gramma: .............ccscccceccsssssscsssssceeeeecceeessssssseees 97\n4.5 Speaking Skills...................scsccccesssssceccesssseeees 102\n4.6 Writing Skills ...................escscecesssseeeceessseeeee 103\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 10,
            "text": "5. Horticulture .................ccccccccceeee\n\n5.1 Listemimg Skills ..................ccccccsssscccsssssseeeeeecesee 107\n5.2 Reading SKiIIS ................cccceccsssccctessscececessseeees 109\n5.3. Vocabulary Development...................ccccceeseee 112\n5.4 GLraMMAL .........ccecssscccccccceeccceessssccsccessseeeeeeeees 113\n5.5 Speaking SKills.................cccecscssscccessssseeeeeeesee 118\n5.6 Writing SKills...................ccccccssssscectsscssceeeeeeesee 121\nPoverty in Ethiopia... ...............\n6.1 Listeming Skills ...................:ccssssscccessssseeeeeeeseee 124\n6.2 Reading Skills ..................cccccssssseccessssseecceeeseee 126\n6.3 Vocabulary Development...................cccceessees 129\n6.4 GraMMaL .............scccccsscceecccceeescsssssceeseeeceeeeeees 132\n6.5 Speaking SKills................... ce cessssccceesssseeceeeeeee 137\n6.6 Writing SKills .................ccccccsssscectesssscecceeeeeee 139\n7.Communitity Services ..............\n7.1 Listening skills: Community Services ........ 142\n7.2 Reading SKills ................cccccsssccerscssscceeeessseeees 144\n7.3 Vocabulary Development................cccsssssseeees 146\nTA GLAMMIAL  .........cccccceccssscccccescscceccescsseeeeeessceees 148\n7.5 Speaking SKiIIs..............eeeeessesssscceeeeeeeeeeeeees 155\n7.6 Writing SKIS .............cteeccccscscceeceeeeeeeeeees 156\n8. Communicable Diseases ...........\n8.1 Listeming SKilIS ................ cccccsssseeeceeeeseeees 161\n8.2 Reading SKills ................ ce ccssscccctecsseeeeceeeseeees 162\n8.3. Vocabulary Development....................scseseeeee 166\n8.4 GramMmMar  ............ccccccccccccccceessssccccceeeeeeeeeeeeees 168\n8.5 Speaking SKills................ scsscecessssseeeeeeseseeees 176\n8.6 Writing SKINS 0... cttttttctttteeeeeeeseeees 179\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 11,
            "text": "9. Fairness and Equity ................. 180\n\n9.1 Listening Skills .................. ccscccetesesseceeeeesseees 181\n9.2 Reading Sills ................. cc eeesssscecceesssceeececesceees 183\n9.3 Vocabulary Development ...................:::ee 189\n9.4 GraMIMaL oo ececcsscsscssscseceessesssessesssesseseees 190\n9.5 Speaking SKilIs.............ccssssccsssecesssscessnseeesees 197\n9.6 Writing SKiIIS ................ cc cccssecteeesceeeeeesseeees 200\nThe Internet .. .................s00006. 203\n\n10.1 Listening Skills 204\n10.2 Reading Skills 205\n10.3 Vocabulary Development 210\n10.4 Grammar 212\n10.5 Speaking Activity 217\n10.6 Writing Activity 219\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 12,
            "text": "Introduction\n\nThe English language in Ethiopia serves more as the medium of\ninstruction in schools and universities. It plays a significant role in\nstudents’ academic life. The grade 9 English Textbook is developed\nto satisfy the students’ English language needs at the level and to\nserve them as a backdrop for their future academic career as they\nuse the language for academic purposes. The minimum learning\ncompetencies (MLCs) expected of students are indicated in the\nGrade 9 English language Syllabus, and therefore, the language\ninput as well as activities they perform are developed based on the\nMLC identified by the syllabus designers. The learning outcomes\nexpected of students are built upon the MLC and constitute\nlistening to a variety of texts at different levels (surface and\ndeeper levels), interacting in English, reading and comprehending,\nanalyzing, synthesizing, evaluating and interpreting ideas vis-\na-vis their environment, getting meanings of words through\ndifferent strategies, and mastery of selected grammatical elements\nappropriate to the level. The outcomes also embrace students’\ndevelopment of sentence, paragraph and essay levels writing. The\nstudents are expected to write accurate sentences, paragraphs, and\nessays with some level of fluency as they should balance accuracy\n\nand fluency in their use of the language.\n\nThe ten-unit English Language textbook for Grade 9 has specific\nunit objectives. Each of the units consists of six different parts:\nListening Skills, Reading Skills, Vocabulary, Grammar, Speaking\nSkills, and Writing Skills organized in that order. The textbook is\norganized by placing the receptive skills before the productive skills,\nbecause it is presumed that the receptive skills as pre-requisites\nprovide students with language inputs which are relevant to their\n\nlanguage production.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 13,
            "text": "The listening skills will be taught based on areas which are national\nand/ or international concerns, focusing more on national issues.\nThe listening texts include topics such as urban life versus rural life,\nstudy skills, road accidents, Gambella national park, diversifying\nexport earners through competition, poverty in Ethiopia, community\nservices, infectious diseases, cultural diversity, human rights and\ndemocratic governance, and the concept of the internet. In these\n\ndiversified areas students will listen to various\n\ntexts, and they will develop their listening ability, get ideas about\nthe issues they are introduced with, relate the ideas with their\nprevious knowledge,and analyze, synthesize, evaluate and\ninterpret the ideas with the environment they areliving in.\nStudents also learn vocabularies, and extend the ideas inthe\nlistening texts to their speaking and writing development.The\nmain purposes of the lessons students learn can generally be two-\nfold: students’ language skill development and their achievement\n\nof the expected competencies.\n\nThe reading passages are selected from different sources and they\nfocus on life in a big city, learning strategies, traffic accidents,\nnational park in Ethiopia, health benefits of gardening, the impact\nof poverty, HIV/ AIDS, equality, equity and justice, and role of\ncomputers and internet in our lives. Students are required to\nunderstand the meanings of the reading texts deeply making\ninteractions with the authors’ thoughts and their experiences.\nSimilar to the activities in the listening texts, vocabularies derived\nfrom the reading texts, extended speaking and writing activities are\n\nalso included in the reading parts.\n\nThe vocabulary lessons constitute vocabulary from the listening\nand reading texts, phrasal verbs and word formation using affixes\n\n(prefixes and suffixes). The vocabulary is taught through the\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 14,
            "text": "Unit\n\nI, Living in Urban Areas\n\n4 Learning Outcomes )\n\nAt the end of this unit, learners are expected to:\n\nlisten to a variety of texts with medium level understanding\n\nand transfer information,\n\ninteract in English medium in varied communication\n\nsituations with comprehensible grammar,\n\nread medium level reading resources and comprehend\ncontents,\n\nguess meanings of words using different clues,\n\npractice pronouncing intonations of auxiliary beginning\nand wh-questions accurately,\n\nselect appropriate study skills and apply in learning\nvocabulary and other language skills,\n\nuse grammar with reasonable accuracy in communication,\nand\n\nwrite accurate sentences and paragraphs.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 15,
            "text": "§Listening Skills\n\nBE ein Skills\n\nActivity I.1 Before you listen to the text,\n\nanswer the following questions\nbased on your experiences.\n\nLook at the pictures below and share with your partner what\nyou see from the pictures. You can follow the examples\ngiven.\n\nCity Village\n\nExamples\nIn the city, there are ....\n\nIn the village, there are ... .\nWhere do you like to live in? Why?\nExample\nI like to live in a city, because there are many attractive things\nfor a living.\nWhat do you expect the title of the listening text to be?\nTitle of the listening text\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 16,
            "text": "§Listening Skills\n\nActivity 1.2 Listen to the listening text ana\n\nanswer questions below.\n\nIn the villages, the people live in an\nThere is no in villages.\nThere are certain advantages which the urban people have\n\nover the villages. There are much better in towns.\nThe is also better in towns.\n\nIn towns we can have more variety of goods including\n\nand\n\nActivity 1.3 Afteryouhavelistenedtothetext,\nanswer the following questions\nbased on the information in th\npassage. The first one is done\nas an example to you.\n\nWhere do you like to live, in a village or in a town? Write a\nreason for your choice.\nI like to live in a town because I can get more goods to buy.\n\nI prefer to live in a village to town because...\n\nWhat do you find in villages and towns?\n\nWhat challenges does one get in villages and towns?\n\nWhat benefits does one get living in villages and towns?\n\nActivity 1.4 Answer the following questions.\n\nWhy do you think people usually migrate from rural to\nurban areas in Ethiopia?\n\nDiscuss the major problems people living in urban areas\n\nface.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 17,
            "text": "§Reading Skills\n\nWrite a short paragraph on the problems people face in\n\nurban(or rural) areas.\n\nPa Reading Skills\n\nActivity 1.5 Before you read the text entitlea\n‘Life in a Big City’, answer th\n\nfollowing questions and discuss\nour answers with your partner,\n\nAre you living in an urban or a rural area?\nWhat do you do in your living area?\nDiscuss with your partner about things you find in your\n\nsurroundings.\nStudy the meanings of the words given below.\ncompetition reside\npollution metropolitan\n\nActivity 1.6 Read the passage carefully ana\n\ndecide whether each statement\ngiven below ts ‘true’ or ‘false’.\n\nLife in a Big City\n\n1. A big city has a lot on offer for you to make your life a\npleasant experience. However, as you know, good things\nnever come easy to_reap the perks of city life; you have to\nmake sure to work hard at the same pace as it runs. Hence,\npeople work like a machine to fulfill their dreams and be\n\nsuccessful.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 18,
            "text": "§Reading Skills\n\n2. Moreover, people experience a lot of competition in big\ncities to achieve their life’s goal. Whether a business owner\n\nor an employee both struggle to be at par and earn more\n\nfame as well as money. They all have to match the pace of\nlife to make the ends meet. A good life in a big city is almost\nimpossible unless you are well settled. Also, you will hardly\nget any free and peaceful time in such cities as you have to\n\nhustle consistently.\n\n3. You will see there is a great rush of traffic at peak hours of\nthe morning as well as evening. It is not easy to shop around\nin the markets because they are bustling with the crowd\nalways. The parks are full, and the metro is congested. These\nthickly populated cities even go through housing problems,\nwhich is even increasing every passing day. All this seldom\ngives the residents of the big city any peaceful moment.\n\n4. Furthermore, essentials are so expensive that the middle-\nclass families also lead a miserable life. Due to a high rate\nof population, demand for resources arises. As a result, you\nwill find every product adulterated, ranging from milk,\nghee, and oil to pulses. Pollution is another harsh reality\nof metropolitan cities. Air and water both are impure that\n\ncreate an unhealthy living environment.\n\n5. On the contrary, life in a big city is a comfortable and\nconvenient choice too. It is a place for luxury abundant\nof technology, entertainment, job opportunities, advanced\neducation, and medical facilities. Undoubtedly, a big city\n\nis the best place to reside if your pockets are full of money.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 19,
            "text": "§Reading Skills\n\n. There are oodles of recreational activities available in metro\ncities like gardens, amusement parks, restaurants, or clubs.\nYou can hang out there with your family or friends. You\nwill celebrate festivals here with more pomp and show.\nAdditionally, there are fewer social issues when you live in\n\nbig cities than in villages or small towns.\n\n. You can have an enjoyable yet stressful life here. The metro\ncity will present you with many struggles, but you can’t\ngive up on them to live a happy and successful life. Thus,\nall you need is a thought and effort to live a balanced life for\n\ncreating a sustainable living space.\n\n. Make sure to never give up. Moreover, make the right\nchoices, have an organized life in which you don’t hurt\nnature. Also, take out some time for your loved ones to\nmaintain the relationship. After all, you are working hard\nto live a satisfying life with them not to get detached from\nthem. Indeed you have to work hard for better living in a big\n\ncity but without losing other precious things in life.\n\nNow, write ‘true’ or ‘false’ for each of the statements below.\n\nCity life gives opportunities for a better life.\nPeople must work hard to benefit in cities.\n\nCity life will be preferred if you have sufficient money to\nspend.\n\nThere are more social issues in cities than in villages.\n\nAccording to the passage, city life requires more hard\nwork.\n\n6. | Living in a city could not only be enjoyable but also\n\nstressful.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 20,
            "text": "§Reading Skills\n\nIn a city, there are more recreational areas such as gardens,\namusement parks and clubs.\n\n8. | Pollution is one of the problems facing a city life.\n\n9. | The housing problem and traffic congestions make a city\nlife difficult.\n\nIn a city, people need to cooperate for creating peaceful\n\nliving condition.\n\nActivity 1.7 Based on the information in the\n\nreading passage, complete the\nsentences given below.\n\nIt is not easy to shop around in markets because\nA good life in a big city is almost impossible unless you\n\nIn a big city, every product needs to be adulterated because\n\nThe recreational activities stated in the passage include\n\nThe main idea of paragraph 4 is\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 21,
            "text": "§Vocabulary Development\n\nActivity 1.8 Questions are given to you in\ncolumns A and B. Ask th\n\nquestions each other in turns fo\nconversation. The first question\nis done as an example.\n\nColumn A Column B\ne Were you born in a city? e Do you like to visit cities for\nholidays?\n\ne How long have you livedina |e What is the worst part of\ncity? living in a city?\n\ne Is it good or bad for children to |e What are the differences\ngrow up ina city? between big and small cities?\n\ne What is the best part of living |e Do you like living in a city?\nin a city?\n\ne What is the biggest city in our |e Should more or less people\ncountry? live in cities?\n\nExample\n\nStudent A: | Were you born in a city?\n\nStudent B: Yes, I was born in Hawassa.\n\nPER Vocabulary Development\n\n1.3.1 Vocabulary from the reading passage\n\nThe vocabulary activities are based on the vocabularies in the\nreading passage and others that are assumed important to you to\n\nstudy at this stage.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 22,
            "text": "§Vocabulary Development\n\nActivity 1.9 In pairs, match the words in\nColumn A with their meanings\nin Column B. The words are\ntaken from the reading passage,\nand the meaning you choose\n\nShould be contextual to thei\noccurrence in the reading\n\n1. pleasant a. plenty\n\n2. reap b. hurry up\n\n3. runs c. busy\n\n4. settled d. interesting\n\n5. hustle e. infected/adulterated\n6. bustling f. happens\n\n7. impure g. resolved\n\n8. oodles h. priceless/valuable\n9. precious i. secure/earn\n\n1.3.2 Phrasal verbs\n\nA phrasal verb is a phrase which is made up of a verb and usually\na preposition or an adverb. The meaning of the verb usually changes\nbecause of the included preposition or the adverb. For example, the\nverb ‘come’, means ‘to move forward’, but together with ‘on’,\n\nthat is, “come on’ is a phrase used for encouragement.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 23,
            "text": "§Vocabulary Development\n\nActivity 1.10 Study the meanings of th\nphrasal verbs in the Table ana\n\nwrite your own sentences fo\neach phrasal verb. Two of them\nare done for you as examples.\n\nPhrasal\nVerb Meaning Example\nThe students acted\nperform something with actions | out the story on\nact out and gestures stage.\nThe police were\nto take action because of acting on a tip from\nsomething like information an informer and\nact on received caught the thief.\nact up behave badly or strangely\nadd on include\nadd up to make a mathematical total\naim at to target\ninclude something in a plan or\nallow for | calculation\nallow of | make possible, permit\nback away | retreat or go backwards\nback retract or withdraw your position\ndown or proposal in an argument\nback up make a copy of computer data\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 24,
            "text": "§Grammar\n\nFRE crammar\n\nIn this Unit, you will learn about multiple grammar elements: tag\nquestions, simple present, present continuous tenses, wh-questions\nusing simple present and present continuous tenses, yes/no\nquestions, and questions with auxiliary verbs. You will learn each\n\nof them. Now let’s begin with tag questions.\n\n1.4.1 Tag questions\n\nDo you know what tag questions are? Look at the following\nsentences, and try to see how the questions are developed.\nExamples:\n\n1) We love our country, don’t we?\n\n@) Ethiopia is not in Asia, is it?\nWhat did you observe in these sentences? The parts of the sentences\n‘don’t we?’ and ‘is it? are tag questions. Guess how they are\nformed. As you see, for the positive statement, you have a negative\n\ntag question; and for the negative statement, the tag question is\n\npositive type.\n\nActivity I.11 Give tag questions for th\n\nollowing statements.\n\nYou are a student, ?\n\nShe doesn’t like chewing ‘chat’, ?\nIt isn’t raining, ?\n\nThey have done their homework, ?\nOur teacher is always punctual, ?\n6. | He lives in a big city, ?\n\nLiving in rural areas is interesting, ?\n8. | I am a student, ?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 25,
            "text": "§Grammar\n\nActivity 1.12 Now read the following\nparagraph and underline th\ntag questions. Check whethe\n\nor not you have underlined th\ncorrect tag questions with you\npartner.\n\nDaniel is sitting alone in the field. He looks around and speaks to\nhimself. “Birds are free, aren’t they? They can fly at large, can’t\nthey? They are not the best of creations like man, are they? Man\nis the best creation of God, isn’t he? He cannot fly in the sky, can\nhe? Birds are a part of our environment. But they do not pollute\nour environment, do they? It is man who pollutes his environment,\ndoesn’t he? We should not pollute our environment, should we?\nOur people are not educated. If they are educated they will become\nconscious, won’t they? Our people must be educated, mustn’t they?\nOh! The sun is already set. I am late for home, aren’t I? I have to\n\nreturn now, haven’t I?\nTake the following sentences and the tag questions as examples.\n1) Birds are free, aren t they?\n@ He cannot fly in the sky, can he?\n3 | They do not pollute our environment, do they?\nOo It is man who pollutes the environment, isn t he?\n5 Our people must be educated, mustn t they?\n6 I have to return now, haven t I?\nG) I am late for home, aren t I?\n\nThe italicized parts of the sentences are tag questions. They are\nformed by using the auxiliary verbs used in the first part of the\nsentence. The only exception is with sentence number 7. What is it?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 26,
            "text": "$§Grammar\n\nUnlike the other statements that repeat the verbs in tag questions,\n\nthe statement that has the verb ‘am’ will have the tag question as\n\n‘aren’t I’?\nI am late for home, aren’t I? but Iam not late, am I?\nu\nI am a student, aren’t I? Iam not a student, am I?\n\nAnother important point you have to note is the positive and negative\ntags. For positive statements, you will have negative tags. The sentences\n‘Birds are free, aren t they?’ and ‘Our people must be educated, mustn t\nthey?’ are good examples. When the sentences are negative, however, you\nwill have positive tags. The sentences ‘He cannot fly in the sky, can he?’\n\nand ‘They do not pollute our environment, do they?’ are good examples.\n\nActivity 1.13 Complete the missing parts of\n\nthe statements by adding tag\nquestions.\n\nYou would like to come with us, ?\n\nThe club members played well, ?\n\nOur father will not be with us next week, ?\nThey weren’t part of the regular team, ?\nThe weather is really good today, ?\n\n6. | I shouldn’t criticize my teacher, ?\n\nI have to behave good, ?\n\n1.4.2 Expressing habitual actions using the Simple\nPresent Tense\n\nActivity 1.14 Read the following paragraph\n\nand underline the _ simpl\npresent verbs.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 27,
            "text": "§Grammar\n\nParagraph\n\nMost people don’t like bugs, but Doctor Aster loves_them! In\nfact, her nickname is Doctor Bugs. She’s a photographer and\nan entomologist. An entomologist studies bugs. Doctor Aster’s\nfavorite bug is the ant. She goes all over the world to study ants.\nShe watches them as they eat, work, rest, sleep, and fight. She takes\nphotographs of the ants. She lies on the ground with her camera\nand waits for the right moment. The ants and other bugs often bite\nher, but that doesn’t stop Doctor Bugs. She has an interesting and\n\nunusual job, and she loves it!\n\nThe forms of the simple present tense\n\nSingular subjects like he, she, it, the student, Abebe, etc. will add\n‘_s’ or ‘—es’ to form the simple present tense, while plural subjects\nwill have the infinitive forms of the verbs. Look at the forms in\nthe Table below. The negative forms of the simple present tense\nare developed using the verbs ‘does+ not +the infinitive’ for the\nsingular subjects and ‘do+ not +the infinitive’ for plural subjects.\n‘T’ as a subject takes the same forms of verbs as plural subjects. In\nexamples given in the table, the negative marker ‘not’ is contracted\nas ‘n’t’ (e.g. do not = don’t; and does not = doesn’t). Look at\nthe examples given in the Table carefully, and discuss in groups\nhow the positive, negative and question forms of the simple present\n\ntense are formed.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 28,
            "text": "§Grammar\n\nSubjects | Positive forms | Negative forms | Question forms\n\nHe plays He does not Does (Doesn’t) he\n\nfootball. (doesn’t) play play football?\nSingular football.\n\nShe studies She doesn’t study | Does (Doesn’t) she\n\nevery night. every night. study every night?\n\nThe student She doesn’t go to | Does (Doesn’t) the\n\ngoes to school | school every day. | student go to school\n\nevery day. every day?\n1 I play football. |I do not (don’t) | Do (Don’t) I play\nplay football. football?\n\nYou study You don’t study | Do (Don’t) you study\nevery night. every night. every night?\nThey go to They don’t go to | Do (Don’t) they go to\n\nPlural school every | school every day. | school every day?\n\nday.\n\nWe play We don’t play Do (Don’t) we play\nfootball. football. football?\n\nThe students | The students Do (Don’t) the\nplay football. | don’t play students play\n\nfootball. football?\n\nNote\n\nThe simple present tense has different functions. It expresses, for\nexample, habitual actions, future actions and other functions. In\nthis Unit, you learn how it can be used to express habitual actions\nand future actions. When it expresses habitual actions, it is used\nwith words like everyday, always, sometimes, often, etc which are\ncalled ‘adverbs of frequency’. You will learn about the ‘adverbs of\n\nfrequency’ in units 2 and 3, and we advise you to refer back to this\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 29,
            "text": "§Grammar\n\nsection for more understanding of their application in the simple\npresent tense.\n\nActivity 1.15 Decide whether or not the verbs in\nbold are in their correct present\n\nforms, and supply the correct\n\nHagos is a mechanic. He know a lot about cars. He work at a\ngarage. He fix cars and talks to customers. They asks questions\n\nabout their cars. Hagos works from 8:00 a.m. to 10:00 a.m.\n\nActivity 1.16 Supply the correct simpl\n\npresent forms of the verbs in\nparentheses.\n\nWorku and Senait (1) (have) a busy life style. Worku is a\ndoctor at a hospital. He works at night, so he (2) (go) to\nwork at 7:00 p.m. and comes home at 7: a.m. His wife Senait works\nat a bank. She (3) (go) to work at 8:00 a.m. and comes\nhome at 6:00 p.m. They don’t see each other a lot during the week.\n\nWorku and Senait also (4) ___ (have) two children, Belay\nand Haregewoin. Every morning they all (5) _——s (have) breakfast\n\ntogether at 7:30. Then, Belay and Haregewoin (6) _ (go) to\nschool, and Senait (7) ___——s (go) to work. Worku (8) —__—s (do)\nthe dishes, andthen(9)_ __—_—s (go) to bed. Haregewoin usually (10)\n\n(do) her homework at a friend’s house in the afternoon, and\nBelay (11) (have) _—_ soccer practice. Worku gets up at 4:00 p.m.\nAt 6:00 p.m., he (12) (have) dinner with Senait, Belay, and\nHaregewoin. After dinner, he (13) ——_—sd (go) to work. Worku and\nSenait (14) _ (have) a busy schedule during the week, but on\nweekends they relax.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 30,
            "text": "§Grammar\n\n1.4.3 The Present Continuous Tense\n\nThe present continuous tense is formed by the use of ‘is’, ‘am’, and\n‘are’ as helping verbs and the —ing forms of the main verbs. How are\n\nCs? “6\n\nis’, ‘am’ and ‘are’ used? ‘Is’ is used with singular subjects, while\n\n‘are’ is used with plural subjects. ‘Am/’ is used with the subject ‘I’.\nLook at the examples given in the Table below very carefully, and\ndiscuss in groups how the positive, negative and question forms of\n\nthe present continuous tense are formed.\n\nSubjects | Positive forms | Negative forms Question forms\nHe is playing | He is not(isn’t) Is (Isn’t) he playing\nfootball. playing football. football?\n\nSingular | She is studying | She is not (isn’t) Is (isn’t) she\nevery night. studying every studying every\n\nnight. night?\n\nThe student is_ | She is not (isn’t) Is (Isn’t) the student\ngoing to school | going to school going to school\nevery day. every day. every day?\n\nI I am playing I am not (amn’t) Am (Amn’t) I\nfootball. playing football. playing football?\nYou are You are not (aren’t) | Are (Aren’t) you\nstudying every | studying every studying every\nnight. night. night?\n\nPlural | They are going | They are not Are (Aren’t) they\n\nto school every | (aren’t) going to going to school\nday. school every day. every day?\nWe are We are not (aren’t) | Are (Aren’t) we\nplaying playing football. playing football?\nfootball.\n\nThe students The students are Are (Aren’t) the\nare playing not (aren’t) playing | students playing\nfootball. football. football?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 31,
            "text": "§Grammar\n\nNote\n\nActivity 1.17 Read the following dialogue\nand underline the_ present\ncontinuous forms of the verbs.\n\nDialogue: On the Telephone\nMohammed: Hello, can I speak to Zeleke?\n\nZeleke: This is Zeleke, who is speaking?.\nMohammed: Hi, this is Mohammed.\nZeleke: Hi Mohammed. What are you doing?\n\nMohammed: Well, I’m cooking dinner.\n\nZeleke: What are you cooking?\n\nMohammed: I’m baking some potatoes, and boiling some carrots.\nZeleke: It sounds delicious.\n\nMohammed: What are you doing for dinner tonight?\n\nZeleke: Well, I dont have any plans.\n\nMohammed: Would you like to come over for dinner?\n\nZeleke: Oh, I'd love to. Thanks.\n\nMohammed: Great. Zeineba and Mulat are also coming. They are\n\narriving at seven.\n\nZeleke: Ok, I'll be there at seven, too.\nMohammed: Ok, see you then. Bye.\nZeleke: Bye.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 32,
            "text": "§Grammar\n\nActivity 1.18 Complete the dialogue using\n\nChaltu:\nZinash:\n\nChaltu:\n\nZinash:\n\nChaltu:\n\nZinash:\n\nChaltu:\nZinash:\n\nChaltu:\n\nZinash:\n\nChaltu:\n\nZinash:\n\nthe Present Simple or Present\n\nContinuous forms of the verbs\ngiven in parentheses.\n\n(1) (Do) you (travel) a lot to Hawassa?\nYes, but I (2) (not / go) away as often as my dad\ndoes.\n\n(3)(Do) ____ he often (fly)?\n\nYeah, he (4) (do).\n\n(5) (Do) _____: your mum usually (stay) at home\n\nwhen he’s away?\n\nYes, but my aunt Silenat and my cousin Alemu, (6)\n\n(come) to our house sometimes and (7) ___ (spend) time\nwith us but Kassahun (8) (not/come) very often.\nOh, why not?\nWell, from Monday to Friday he (9) _____ (study) hard.\nSometimes at weekends he (10) ____ (watch) TV late at\nnight, but my aunt (11) (not/ like) that.\n\nWhat do you think he (12) _— (do) now? It’s Sunday.\nMaybe he (13) (sit) in his room. He (14) ___\n(love) films, so perhaps he (15) (watch) one now.\n\nWhat about your aunt, Zinash? What (16) she\n(do) at the moment when his son is at home?\n\nI think she (17) (cook) because Alemu (8) _ (like)\n\neating so much.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 33,
            "text": "§Grammar\n\nActivity 1.19 Select the appropriate wora\nfrom the given list and complete\n\nthe sentences using present\ncontinuous tense used to express\nuture action.\n\ntake | start leave |go do depart | get come\n\nThe Big Day\n: Have you heard of Brad and Mimi?\n\nBrad and Mimi? What's happened?\n: They (1) married on Saturday.\n: You’re joking. I didn’t know that Mimi fancied Brad. When\n___ (2) the wedding (2) place?\n: It (3) place on Saturday. Didn’t you listen to me?\n- Of course I did. But what time (4) it .(4) ?\n: The wedding ceremony (5) at 11 o’clock in the All\n\nBp >\n\nwD\n\n>\n\nSaints church.\n(6) you (6)?\n: Yes, I’m. They’ve invited me.\n- Do you think I could join you?\nWhy not? I’m sure the church is going to be full. ButI_—__—(7)\nearly in the morning, because my dad (7) to work by\n\n>svope\n\ncar on Saturday and he can take me to the All Saints.\n- If your dad doesn t mind.\n\n&\n\nA: No problem. The more, the merrier, he always says. By the way,\n(8) you anything tomorrow morning? We could buy some\npresent for them.\nB: Good idea. We can get the bus to the Macy’s Shopping Gallery.\n\nIt (9) at 9.35.\nA: All right. See you at the bus stop. Bye.\nB: Bye-bye.\n\nTaken from https://www.e-grammar.org/present-tenses-for-future/\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 34,
            "text": "§Grammar\n\n1.4.4 Question types\n\nYou have learned about tag-questions above. The other types of\nquestions you learn in this unit are “wh’-questions and ‘yes/ no’\n\nquestions.\n\nA. Wh-questions\nThe wh-questions are formed by using who, what, where, why,\nwhen, which, and how. Learn how the questions are formed from\nthe following examples.\nExamples\n1) What is your favorite book?\nmu My favorite book is Fikir Eske Mekabir.\n@) Where do you live?\nm I live in Merawi.\n3 | Which one do you like more, living in urban areas or in rural areas?\n\nw | like to live in urban areas.\nw | like to live in rural areas.\n\n4 ) Why do you like to live in rural areas?\n\nw | like to live in rural areas because I help my parents in\nfarming in the winter.\n\n5 ) What advantages do you get living in urban areas?\n\nm In urban areas, I can get access to read books in libraries.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 35,
            "text": "§Grammar\n\nWhat does your mother do in the kitchen?\nWhat’s your favourite sport?\nHow many players are there in a football team?\n\nWho is the President of the Region you are living in? __..\nWhy do people like to live in urban areas?\n6. | Why do people like to live in rural areas?\nWhich subject do you like most?\n\nB. Yes/No questions\nThe ‘yes/no’ questions are formed by using the ‘do verbs’ (do, does,\ndid), ‘have verbs’ (has, have, had), and modal verbs (can, could,\nmay, might, must, ought to, etc.).\nExamples\n1) Do you like animals?\na) Yes, I do.\nb) No, I don’t\n@ Can you bring me your marker tomorrow?\na) Yes, I can.\nb) No, I cannot (can’t).\n3 | Is there a book on your table?\na) Yes, there is.\nb) No, there isn’t.\n4 ) Are there two pens on the table?\na) Yes, there are.\nb) No there aren’t.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 36,
            "text": "§Grammar\n\nowe f ctivity 1.21 Give answers to the following\nquestions.\nDo you like your English lessons?\na)\nb)\nDo you have a garden?\na) .\nb) .\nAre there big buildings in urban areas?\na)\nb)\n\nIs the number of schools in urban areas more than those in\nrural areas?\na)\nb)\nDoes a student in a rural area score equal to the one who is\n\nin urban area in school leaving examination?\na)\nb) .\n6. | Has the teacher given you a reading activity?\na)\nb)\nMust you call him again?\na)\nb)\nc)\nd)\ne)\nf)\n8)\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 37,
            "text": "§Grammar\n\nActivity 1.22 Develop questions using ‘wh’,\n‘auxiliary’ or ‘modal verb\n\nquestion beginners to th\nfollowing answers with you\npartner.\n\nI am learning in Hottie Primary School.\n\nYes, I like the English lessons very much.\n\nYes, I can swim very well.\n\nI like to live in rural areas.\n\nShe likes biscuits most.\n\n6. | He works in a hospital.\n\nThey must read books to understand the tenses more.\n8. | Yes, she is a student.\n\nActivity 1.23 Select the appropriate wh-words\nfrom the list and fill in th\n\nblanks in Column A and match\nthe questions formed with thei\nanswers in Column B.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 38,
            "text": "§Grammar\n\nColumn A Column B\nWhat/ where/ when/ why/ who/ how/ how many\nDancing.\n2. are Tesfu and Dilnesa? eee\n— c. Because it’s nice and\n\n3. do you have English peaceful.\n\nessons? d. That’s Feleke, my friend.\n4 “s your mother, Molla?\n\n. €- On Monday and Friday.\n\n5 rooms are there in your\n\nhouse? f. She is fine, thanks.\n6. s your favorite hobby? g. They are in Debre Tabor.\n7. your friends like Gaynt?\n8 s the matter Worku? h. They are six rooms\n\nNow give your answer to each question as in the example given\nbelow.\n\nExample\n\nA: Who is that boy?\nB: That's Feleke, my friend.\n\nActivity 1.24 Change the sentences into\n‘wh-questions’ and ‘yes/no\n\nquestions’ about the underlinea\nwords or phrases.\n\nLelisa and Tirhas have got two children.\n\nYes/no question:\n\nWh-question:\nMeseret is my favorite actress.\n\nYes/no question:\n\nWh-question:\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 39,
            "text": "§Speaking Skills\n\nDaniel is a shopkeeper.\nYes/no question:\n\nWh- question:\n\nPaspeaking Skills\n\n1.5.1 Speaking activity based on the reading passage\n\nActivity 1.25 Look at the pictures below ana\nin pairs, say about what each\nperson is doing.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 40,
            "text": "§ Speaking Skills\n\nRural\n\nDiscuss the information in the table.\n\nBefore using the information for your conversation, make\n\nsure you know the meanings of important words in bold.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 41,
            "text": "Speaking Skills\n\nAdvantages of rural life\n\nDisadvantages of rural life\n\nm There is a lot of free space\n\navailable in the rural area.\n\nm The rural area/countryside\noffers us a lot more land to\nlive on.\n\nm You can live in your own\nhouse with your own private\ngarden.\n\nm You can easily go for a walk\noutside your house.\n\nm You’re surrounded by\nbeautiful scenery and you\ncan walk in the countryside.\n\nm The pace of life is slower\nand more relaxed.\n\nm You get peace and quiet.\n\nm You get fresh air.\n\nm People live in close\ncommunities and they know\n\nRoad networks are usually in\npoor condition.\n\nm Public transport is hopeless.\nmw There aren’t shops. /You don’t get\n\nmany shops.\n\nThere isn’t much privacy because\neveryone knows what you are\ndoing.\n\nThere aren’t many educational\nfacilities.\n\nPeople in the\ncountryside lack access to\nmodern health care.\n\nPeople do not have more access\nto pure water, electricity,\ninternet, etc.\n\neach other.\nExample\nThis is how you present your ideas to your group:\nI like living in rural areas because there are.... First, ... Second, ...\nBesides, ... in rural areas, there is .... Generally, living in the rural\n\n1.5.2 Pronunciation: Rising and falling intonations\n\nA rising intonation (af ) pattern would be used mainly for yes/\n\nno questions and question tags showing uncertainty and requiring\n\nanswers. It invites the speaker to continue speaking.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 42,
            "text": "Speaking Skills\n\nActivity 1.27 In pairs, practice producing th\nfollowing examples given fo\n\neach discourse pattern. Then,\ngive other examples by yourself\nor each intonation pattern.\n\nYes/no Question (Questions that can be answered by ‘yes’\nor ‘no’.)\nmw Do you know your teacher’s I name?\nm Have you done the at assignment?\nm Do you have any al question?\nQuestion tags that show uncertainty and require an answer.\nmw We have agreed, ell haven't we?\nm You need bread, a don’t you?\nm You're a new student | aren’t you?\nFalling intonation 5) Wh-questions (information questions),\n\nconfirmatory question tags are commonly produced in falling\nintonation.\n\nActivity 1.28 Practice the following sentences\nwith accurate  intonations.\n\nThen, add examples of your\n\nown for more practice of the\nintonations.\n\n1. Wh -questions (requesting information.)\n(questions beginning with ‘who’, ‘what’, ‘why’, ‘where’, ‘when’,\n‘which’, and ‘how’)\n¢ What is your F name?\n¢ Who can answer this F question?\n« Whose pen is F It?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 43,
            "text": "§ Writing Skills\n\n2. Question Tags that are statements requesting confirmation rather than\nquestions.\n\n¢ He isso clever, doesn’t fF he?\n¢ We failed the test because we didn’t revise, did F we?\n\n¢ It doesn’t seem to bother him much, does F it?\n\nPRA writing Skills\n\n1.6.1 Constructing sentences\n\nActivity 1.29 Construct sentences based on\n\nthe example given(Discuss your\nsentences with your partner.)\n\nWrite two sentences that explain why you like to live in\na city.\nExample: I like to live in a city because there are good\ntransportations and health centers.\n\nWrite two sentences that explain why you do not choose to\nlive in a city.\n\nActivity 1.30 Write 3 to 5 sentences about\nyour village or town. Then, read\n\nthem to your group of three or\nour members.\n\nExamples\n@ I live in a small village.\n\n@ There are many cows and donkeys in my village.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 44,
            "text": "§ Writing Skills\n\n1.6.2 Developing a paragraph\n\nActivity 1.31 The sentences you wrote fo\nactivity 1.29 above must b\norganized into a paragraph\n\nusing appropriate cohesive\ndevices. Use the following\n\nLiving in a rural area gives me enormous satisfaction. There are\nmany cows and pets such as cats.... There is also.... Besides, in my\nvillage, ....Moreover, ....Generally, ....\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 45,
            "text": "Unit\n\n2, Study Skill\n\nLearning Outcomes\n\nAt the end of this unit, learners are expected to:\n\nlisten to a variety of texts with medium level understanding\n\nand transfer information,\n\ninteract in English medium in varied communication\n\nsituations with comprehensible grammar,\n\nread medium level reading resources and comprehend\n\ncontents,\nguess meanings of words using different clues,\nextend their vocabulary through collocations,\nuse vocabulary during interaction appropriately,\n\npractice pronouncing intonations of auxiliary beginning\nand wh-questions accurately,\n\nselect appropriate study skills and apply in learning\nvocabulary and other language skills,\n\nuse addition and sequence connectors with reasonable\n\naccuracy in communication,\n\ngenerate simple past and past continuous tenses\n\naccurately, and\n\nwrite grammatically correct sentences, paragraphs and\nessays\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 46,
            "text": "§ Listening Skills\n\n2.1\n\nstudents reading in a classroom\n\nActivity 2.1 Look at the picture above. What\ndoes a good language learne\ndo? In pairs, share your ideas\nabout some learning activities\nthat help you learn English\nbetter.\n\nActivity 2.2 Listen to the text carefully ana\nanswer the following questions.\n\nWhat do you think a good language learner shouldn’t do?\n\nWhat are the different activities a good language learner\n\ndoes?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 47,
            "text": "§ Reading Skills\n\na.\nb.\n\nc.\nYou should remember useful and\n\nwhile you are shopping or walking down the street.\n\nHow is a good language learner motivated?\n\nActivity 2.3 Answer the following questions.\n\nDiscuss with your partner about how you study your\n\nsubjects.\nWhat would you do when you find difficult words in your\nreadings?\n\nWrite a short paragraph about what you can do with your\n\npartner when you are given a task to do together?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 48,
            "text": "§ Reading Skills\n\nActivity 2.4 Answer the following questions\nbased on your persona\nexperience and the information\n\nyou get from the above picture.\nShare your answers with you\nmembers.\n\nIn pairs, discuss what clever students usually do for their\nlearning.\nBegin your discussion as: They plan their time and use it effectively...\nHow do you learn English?\nBegin your discussion as: Ilearn English by referring to dictionaries\nfor new words...\nDo you know the meanings of the words below?\n\n| strategy plan manage style goal\n\nLearning strategies\n\n1. Learning strategies or study skills determine your approach\nto achieve your learning objectives. They are plans that\nlearners consciously have recourse to in order to help them\nlearn more effectively. These strategies are usually linked\nto learners’ needs and interests to boost learning. They are\ngrounded on various types of learning styles. There are some\nstrategies that can help you be successful in your studies.\n\n2. First set small, achievable goals. Start with small steps to\nreach higher targets. For example, try to learn 5 new English\nvocabulary items every day, set a 30 minutes study session\nevery day, learn the lyrics of an English song every now\nand then, and read a short English text every day. Therefore,\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 49,
            "text": "§ Reading Skills\n\nsetting small targets is much better than setting huge goals\nthat you cannot achieve. Remember that “small drops of\nwater make the mighty ocean”.\n\n. Secondly, plan your studies. Planning your studies gives\nmeaning to your work. If you know all the steps necessary\nto achieve a goal and these steps are written down on a piece\n\nof paper, it will be easy for you to see the whole picture.\n\n. Thirdly, be motivated. The secret to success is that you\nshould be motivated to learn. Try to avoid boredom by\nhaving fun in what you do. Try to find a positive aspect to\nstudying English. That is, read about what you are interested\nin (hobbies, fields of interest...), watch your favourite films\nin English, listen to your favourite English songs and learn\nthe lyrics. Write your diary in English and read about your\nfavorite stars in magazines or online. Remember, we learn\n\nbetter and fast things we really want to learn.\n\n. Fourthly, manage your time. In order to manage your time\nsuccessfully, having an awareness of what your goals are will\nassist you in prioritizing your activities. Time management\nprovides you with the opportunity to create a schedule that\nworks for you, not for others. This personal touch gives you\nthe flexibility to include the things that are most important\nto you.\n\n. Finally, set a reward for yourself. Set a reward for yourself\nthat you can look forward to. For example, when you reach a\ngoal, give yourself a reward: watch a movie, have a delicious\n\nsnack, meet your friends, and go to the café.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 50,
            "text": "§ Reading Skills\n\n7. Generally, your learning achievement will definitely be\nmet given that you set your manageable goals, plan your\nstudies properly, arouse your interest of learning, manage\nyour time effectively and get a reward for yourself when\n\nyou accomplish the learning activities successfully.\n\n[Adapted from: Ekwensi, F, Moranski, J., & Townsend-Sweet, M., (2006).\nE-learning concepts and techniques; Retrieved from, http:/Ait.bloomu.edu/\n\nSpring2006_eBook_files/ebook_spring2006.pdf]\n\nActivity 2.5 Read the above passage carefull\nand decide whether’ each\n\nStatement below is ‘true’ o\n\n‘false’ based on the information\nin the passage. Provide evidence\nor your answers..\n\nSetting a plan for their studies alone could make students\n\nsucceed in their learning.\n\nManageable goal setting could be the first step in the\nlearning strategies that students need to know.\n\nGiving reward to oneself for doing good things is morally\nacceptable.\n\nDeveloping motivation for learning could only be expected\nfrom smart teachers.\n\nHaving a time schedule for studying indicates students’\n\nawareness about time management.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 51,
            "text": "§ Reading Skills\n\nAS\n\n«WH ctivity 2.6 Based on the reading passage,\n\nanswer the following questions.\n\nFill in the missing information.\n\nType of strategies\n\nExamples (functions)\n\nTo see the whole picture\n\nBe motivated\n\nm2. In paragraph 4, line 8, what does the writer want to say\n\nby stating “remember, we learn better and fast things we\n\nreally want to learn’?\n\nThe word this, in paragraph 5 line 5 refers to\n\nWhich of the following indicates the purpose of the writer?\n\nA. To describe the characteristics of a good student\n\nB. To explain why some students do not succeed\n\nin their study\n\nC. To give advice to students on how to be\n\nsuccessful in their studies\n\nD. All.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 52,
            "text": "§Vocabulary Development\n\nPRB Vocabulary Development\n\n2.3.1 Vocabulary from the reading passage\n\nActivity 2.7 The following words are taken\nfrom the reading passage. Fina\n\ntheir meanings based on th\ncontext they are used in th\n\nrecourse (paragraph 1) alternative/option (example)\nsession (Paragraph 1)\nboost (paragraph 1)\n\nachievable (paragraph 2)\nhuge (paragraph 2)\n6. | boredom (paragraph 4)\nfavourite (paragraph 5)\n8. flexibility (paragraph 5)\n9. | reward (paragraph 6)\n\n2.3.2 Collocations\n\nA collocation is a pair or group of words that always goes together.\n\nAlthough there are no specific rules for collocations, it is important\nto study the commonly observed collocations that appear in the\n\nforms of adjectives and nouns as well as verbs and prepositions.\n\nA. Some adjective and noun collocations\nw big disappointment, big failure, big mistake, big surprise, etc.\nm heavy bag, heavy box, heavy rain, heavy snow, heavy suitcase, heavy\ntraffic, etc.\nm rich culture, rich history, rich people, rich vocabulary, etc.\nm strong accent, strong drink, strong smell, strong taste, strong wind,\netc.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 53,
            "text": "§ Vocabulary Development\n\nActivity 2.8 Using the given words, complete\nthe following blank spaces\n\nwith correct adjective and noun\ncollocations. One _ alternative\nmay be used more than once.\n\nbig heavy rich strong\n\nIt will be a failure for you if you do not\naccept my advice.\n\nWe expect rain in the coming two months.\n\nSeveral people have been displaced because of\n\nwind destruction.\n\nEven though we have culture, we do not\nuse it for our socio-economic development.\n\nEvery student must avoid having drink while\ncoming to class.\n\n6. | Our history usually surprises people from abroad.\n\nWe need to have a stand for our country’s\nsovereignty.\n\n8. | An accident caused traffic in the highway.\n\n9. | You can see they’re very people by what they wear.\n\nB. Verb and preposition collocations\n\nSome verb and preposition collocations are given in the Box\nbelow, and these collocations could also be called phrasal verbs.\nStudy each phrasal verb and take notes on how to use it in your\n\ncommunication.\n\nblow away | blow off | blow out blow up boil down to\n\nbreak in break out | break through | break down | break off\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 54,
            "text": "$§Grammar\n\nActivity 2.9 Using the given collocations\nabove, complete the following\n\nblank spaces with correct verb\nand preposition collocations.\nThe first one is done for you.\n\nShe blew away the dust which was collected on the table.\n\nAlmaz seems to the afternoon meeting and leaves\nearly.\n\nThe army the bridge for preventing the entrance\nof their enemy.\n\nIt is time to the candles of the birthday celebration.\n\nAt the end of the day, the contesting issues will\nmoney.\n\n6. | Our car So we came by taxi.\n\nWe feel that the civil war will unless we come\ninto consensus.\n\n8. | Sorry to your conversation, could you bring me\nthat bag please?\n\n9. | She seems to their engagement as she thinks\nhe has not been faithful.\n\nThe prisoners try to the fence for escaping\n\nfrom the police station.\n\nPRA crammar\n\n2.4.1 Connectors: addition markers\n\nConnectors create coherence in a paragraph making words, phrases,\nand sentences logically interweave among each other. If sentences\nare unified, they will have a logical order and they will be easy for\n\nlisteners and readers to grasp meanings.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 55,
            "text": "§Grammar\n\nThere are different types of connectors. Some of them indicate\ncontrasts; others show cause and effect, and still others indicate\naddition. There are also connectors that show comparison, time\norder, examples, generalization, summary, etc. Connectors serve\nas transition words and connect ideas of a sentence to another and\neven paragraphs. In this Unit you will learn about addition and\ntime order connectors. The addition connectors (markers)\ninclude and, also, besides, further, furthermore, too, moreover,\nin addition, then, of equal importance, equally important, and\nanother; while the time order (sequence) connectors include\nwords like at first, eventually, finally, first, firstly, in the end,\nin the first place, in the second place, lastly, later, next, second,\nsecondly, to begin with. Which one (s) of these are you familiar\nwith?\nHow are and, also, besides, further, furthermore, too, moreover, etc.\nused in sentences?\nExamples\n@ Reading books helps to learn new information; furthermore, it\n\nhelps one to keep his or her brain fresh.\n\n@) A: We went a lot of sightseeing at Bahir Dar.\nB: We also went shopping.\n\nActivity 2.10 Select the most appropriate\nanswer from the choices given\n\nin parentheses in the following\nsentences.\n\nTheir team has got the best players. (Moreover /However),\n\ntheir coach is fantastic.\n\nAzeb actively participates in class. (Furthermore /But), she\n\noften gets good marks.\n\nThe service at this restaurant is excellent. (However/\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 56,
            "text": "§Grammar\n\nBesides), the food is delicious.\n\nEating well will help you live a healthier life. (Moreover/\nAs a result), exercising every day is also highly\nrecommended.\n\nMoving from one country to another can result in culture\nshock. (However/In addition), the language barrier that\nmany immigrants face can lead to a long life of hardship.\n\n6. | There are some slight variations in temperature.\n(Consequently/ Otherwise/ However), 26 to 27°C should\nbe expected.\n\n2.4.2 Words of sequence\n\nWe hope you have learned the different words of sequence. The\n\nfollowing exercise will help you learn more about them in contexts.\n\nActivity 2.11 Choose the correct word of\n\nsequence from the choices\ngiven in brackets.\n\nAn hour passed, but there was no sign of Helen. (1. Until/\nBefore/Finally), we decided to go home.\n\nWe bumped into Eba during our trip to Langano. A few\nweeks (2. later/ then/after), we met him again.\n\nThe football coach announced, ‘Today, we will begin\npracticing for the coming match. (3. Then/After/\nEventually) he added, ‘Let’s warm up first.’\n\n(4. First/Before/After), heat the oil in the frying pan. Then\nput in all the chicken pieces.\n\nMany people wanted to buy the tickets. (5. Before/After/\nFinally) a while, the queue was quite long.\n\n6. | Shashe will be back in fifteen minutes. (6. Later/\n\nSubsequently/ Meanwhile) make yourself at home.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 57,
            "text": "§Grammar\n\nI really had a busy morning (7. at first/next/ first), I made\nbreakfast for all my family, (8. finally/first/next) I took\nmy brother to school and (9. finally/first/later) I went\nshopping.\n\nActivity 2.12 Fill in the blank spaces in th\nfollowing paragraph with\n\nappropriate connectors of\nsequence.\n\nYesterday, it was my birthday and it didn’t start well. I went to the\npark to meet my friends, but they weren’t there. I decided to look\n\nfor them. 1. , | went to the shopping centre opposite the\npark, but they weren’t there. 2. , I looked for them at\nthe library, but they weren’t there. 3. , | tried the sports\n\ncentre and the restaurant near the park, but my friends weren’t there.\n4. , | went home, and my friends there enjoyed with\n\na birthday cake, ice cream, music and games. It was a surprise party\nfor me! 5. , | got a great birthday.\n\n2.4.3 Adverbs of frequency\n\nDo you know words like always, often, usually, sometimes, rarely,\netc.? People usually use them in their speaking and writing. You\nneed to lean them very well because you will use them when\nyou speak and write in English. We hope you remember that we\nmentioned the ‘adverbs of frequency’ that they will be used with\n\nsimple present tenses in indicating habitual actions.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 58,
            "text": "§Grammar\n\nActivity 2.13 Read the following two short\ndialogues and pay attention to\n\nthe words in bold. What do you\nthink they tell us?\n\nDialogue 1\n\nTesfaye: What kind of person are you?\n\nShemsu: Well, I’m friendly and outgoing, and I’m usually very\nhappy. I dont often complain, and I never shout or get\nreally angry. How about you?\n\nTesfaye: I’m friendly too, and I’m a little shy.\n\nShemsu: I’m always happy, but sometimes I’m very busy. I always\ntry to have a happy face.\n\nTesfaye: Me too!\n\nDialogue 2\n\nTinsae: What are some customs in your country, Ethiopia?\n\nKassahun: We always bow to people we meet, and we never joke\nabout peoples names.\n\nTinsae: That’s good. Here we never ask about people’s salary,\n\nit’s rude. Also we usually aren’t late for meetings.\n\nKassahun: That’s good too!\n\nNote\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 59,
            "text": "§Grammar\n\n3 Beyene and Dawit often go lunch together.\n4 ) In the winter, we sometimes have very heavy rains.\n\nC5 Few students rarely go to the cinema in the summer. because they\n\nprefer to stay outside.\n6 ) As students are so busy, they never go to bed before 10 o’clock.\n@) Sometimes she does her homework with friends.\n3 Usually they study on their own.\nC9 ) Students should usually try to get meanings of words from contexts\n\nthey are used.\n\nThe adverbs of frequency can also be used after the modal verbs as in the\nfollowing examples.\nExamples\n\n@ You must always try your best.\n@ We can usually find a seat on our train.\n3 We should not always depend on dictionaries to for meanings of\n\nwords.\nC4 ) They should never be rude to customers.\nTo make questions about frequency, we can use ‘how often...?’ and using\nthe ‘do verbs.\n\nExamples\n@ How often do you watch films?\n\n@) How often does he play tennis?\n\n(3 How often do the trains arrive late?\n4 ) Do you often come here?\n\nC5 Does she always work so hard?\n\n6 ) Do they ever pay on time? (‘ever’ instead of ‘never’ for questions)\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 60,
            "text": "$§Grammar\n\nActivity 2.14 Discuss the following questions\n\nwith your partner and give\nanswers.\n\nWhat do you usually do on Saturday nights?\n\nHow often do you visit new places?\n\nDo you ever go to the theatre?\n\nHow often do you play sports?\n\nDo you ever watch films or TV programmes in English?\n6. | What time do you usually go to bed?\n\nHow often do you drink tea at a cafe?\n\n8. | Are you sometimes late for school?\n\n2.4.4 Simple past and past continuous tenses\n\nActivity 2.15 Read the following paragraph\nabout ‘Spooky Story’ and see\n\nthe forms of the verbs written in\nbold.\n\nIt was just before midnight on October 31st last year. Susan Lee\n\nwas driving home after visiting her sister. The road was clear and\nshe was driving carefully. Suddenly, out of nowhere, a young\nman stepped out in front of her. He was wearing a dark coloured\nraincoat and carrying a backpack. Susan stepped hard on the brake\npedal but it was too late. She got out of the car but, to her surprise,\nthere was nobody there. While she was looking under the car, she\nfelt a cold wind on her face and a strange presence that sent shivers\ndown her spine. She was still looking under her car when a lorry\nbehind her. The lorry driver, a middle-aged man, walked up to her\nand asked her if she needed help to start her car so she told him\n\nwhat had happened. He seems surprised when Susan told him about\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 61,
            "text": "Grammar\n\nthe young man. ‘In October 1978, there was a car accident on this\nroad and a hitchhiker was fatally run over. You’re not the first to\n\nhave seen his ghost here, he said in a mysterious tone.\n\nThe verbs in bold are written either in simple past or past continuous\n\ntenses. The simple past verbs are:\n\nstepped step stopped stop\n\ngot get walked walk\n\nwas is said say\n\nsent send didn’t do/does (not)\n\nThe verbs written in past continuous tense are:\n\nwere driving drive\nwas looking look\nwas wearing wear\n\nA. The Simple Past Tense\n\nThe simple past tense shows an action which was completed in the\npast. Examples are given to you in the Box below which indicate\nthe positive, negative and question forms of the verbs in simple\n\npast tense.\nExamples\nPositive\n1) I woke up early in the morning.\n@) Silenat played volleyball when she was in a high school.\n3 | My sister invited me a cup of coffee yesterday\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 62,
            "text": "§Grammar\n\nNegative\n1) I did not (didn t) wake up early in the morning.\n@) Silenat did not (didn t) play volleyball when she was in a high school.\n3 | My sister did not (didn t) invite me.\n\nQuestions\n1) Did (Didnt) I wake up early in the morning?\n@) Did (Didn t) Silenat play volleyball when she was in a high school?\n3 | Did (Didnt) my sister invite me a cup of coffee yesterday?\n\nBelow, we have given you the simple past forms of few verbs. As\nyou see, some of them, add -d or —ed (travelled, turned), while\nothers have different forms (broke, knew). Those verbs that add\n-d or —ed are called regular verbs, while the others are called\nirregular verbs.\n\nActivity 2.16 Now classify the verbs below into\n\nregular and irregular verbs.\n\n1. cry cried 8. chat chatted\n2. travel travelled 9. turn turned\n3. send sent 10. cut cut\n\n4. enjoy enjoyed 11. try tried\n\n5. stop stopped 12. know knew\n\n6. break broke 13. say said\n\n7. fall fell 14. happen happened\nRegular verbs Irregular verbs\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 63,
            "text": "§Grammar\n\nActivity 2.17 Give the correct simple past\n\nforms of the verbs in brackets\nin the following sentences.\n\nWhat _—_—_s you (do) at home yesterday?\n\nWhy __ you (don't ) call me last night?\n\nMy friend (graduate) in Civil Engineering.\n\nOur teacher (appreciate) my classmates for they (do) the\nassignments correctly.\n\nHe (cut) his finger while he was helping his mother chop\nonions.\n\n2.4.5 Past continuous tense\n\nSimilar to the simple past tense, the past continuous tense also\nshows a past action, but which was in progress at a certain time in\nthe past.\nA: What were you doing at home last night?\nB: Iwas studying. [This shows the person began studying earlier\nand continued.]\nThe past continuous tense also shows that an activity was in progress\nfor some time, but it has stopped during the time of speaking.\nExamples\n\n1) We were cleaning the house all morning.\n@) I was reading a book when she came.\n\nThe positive, negative and question forms of the past continuous\ntense are presented in the Box below. Read them very carefully to\n\nunderstand how the tense is formed in different forms.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 64,
            "text": "§Grammar\n\nExamples\n\nPositive\n1) She was working in the garden.\n\n@) Silenat was playing volleyball with her friends.\n3 | My friends were reading in the library.\n\nNegative\n@ She was not (wasn t) working in the garden.\n@) Silenat was not (wasn t) playing volleyball with her friends.\n3 | My friends were not (weren t) reading in the library.\n\nQuestions\n1) Was (Wasn t) she working in the garden?\n@) Was (Wasn t) Silenat playing volleyball with her friends?\n3 | Were (Weren t) my friends reading in the library?\n\noe F ctivity 2.18 Write the correct past continuous\n\norms of the verbs in brackets.\n\nWhat you (do) in the field with Samuel yesterday?\nI (try) to get the meanings of the words in the\ndictionary.\nWhich book you__ (read) to learn more about ‘Study Skills’?\n\nMy friend (read) about ‘Learning Strategies’ in addition to\nthe lesson we studied.\n\nHe (not play) football because his leg was injured.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 65,
            "text": "§Grammar\n\nActivity 2.19 Complete the sentences with\nthe past simple or the past\n\ncontinuous form of the verbs in\nbrackets.\n\nI (switch off ) the computer because it (make) a strange\nnoise.\n\nMy father (listen) to classical music when I (arrive) home\nfrom school.\n\nWe (play) video games when my mother (say) ‘Turn the\nvolume down!’\n\nMy little sister (draw) a picture while I (study) for my\nFrench exam.\n\nWhen we (leave) school yesterday, it (pour) with rain.\n\n6. | When you (see) Tefera, he (wear) a black jacket?\n\nActivity 2.20 Write the correct simple past o\n\npast continuous tenses of verbs\nin brackets.\n\nSometimes I hate computers! Once, when I (1. try) to do\nmy English homework on my laptop, the battery (2. run\nout). I (3. lie) on my bed and I was listening to music. It\nhelps me to concentrate.I _ also (4. chat) to my friend Daniel\non Facebook. OK, soI___ (5. not concentrate) very hard on\nmy homework and I (6. forget) to plug in my laptop! I\ndidn’t notice that the battery was getting low. I was just finishing\nthe essay when the screen (7. go) black. I (8. lose)\neverything. I (9. scream) in frustration. My dad\n\n(10. come) running into my bedroom. I almost (11. cry) so\nhe (12. give) mehislaptop.I___—_—(13.. try) to remember\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 66,
            "text": "§ Speaking Skills\n\neverything in my essay. It (14. be) quite difficult especially\nbecause Daniel was sending me lots of funny videos. Anyway,\nwhile I was watching one, the Wi-Fi stopped working. In the end,\nit was probably better because I (15. manage) to finish the\n\nessay.\n\n(Adapted from ’Out and About’, Cambridge University Press, 2015)\n\nbs Speaking Skills\n\nActivity 2.21 Based on the information in\nthe listening text and your day\n\nto-day experience, discuss th\nollowing questions in\n\nAre you a good language learner?\n\nHow does a good language learner learn English?\n\n2.5.1 Pronunciation: Rising and falling intonations with\nquestions\n\nA. Intonation with wh-questions\n\nHow did you pronounce wh-questions? Did ever use intonation\nin your wh-questions knowingly? Take a look at the following\nquestions. How do you say them? Say the following questions to\nyour partner and notice how you produce them. Do you feel that\nyou produced them correctly?\n\nWhat are you doing?\n\nWhere are you going?\n\nHow much does the pair of shoes cost?\n\nWhy are they so late?\n\nWho was the girl you were talking to?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 67,
            "text": "§ Speaking Skills\n\nB. Intonation with yes/no questions\n\nTake a look at the following yes/no questions. How do you say\nthem? Say the following questions to your partner and notice how\n\nyou produce them.\nDid you finish your homework?\nDo you like birds?\nAre you coming to my birthday party?\nHas she called you back?\nShould he come to school next Saturday?\n\nDo you feel that you produced them correctly? Read the following\nshort note in the Box below about how you can produce wh-\n\nquestions and yes/no questions.\nLU] Note\n\nWh-questions are normally produced with falling intonation;\n\nwhereas, yes/no-questions are normally said with rising intonation.\n\nActivity 2.22 Pronounce the wh- and yes/no-\nquestions above in falling ana\nrising intonations, respectively.\n\nPractice them repeatedly unti\nyou feel you have masterea\nthem.\n\nNow look at the following sentences.\n\n1. And what do we have on Mondays?\n2. When is the next English class?\n\nWhat do you think is the situation these questions are asked? We\nthink the speaker and the listeners very well know about what\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 68,
            "text": "§ Speaking Skills\n\nthey have on Mondays and when the next English class is.So, the\nquestions are asked for the purpose of confirmation. In such kind\nof meanings the wh-questions will have rising intonation. Practise\n\nrepeating the above sentences with your partner until you use the\n\ncorrect rising intonation. Let your teacher listen to you to your\n\npronunciation of all the question forms you have practiced.\n\n2.5.2 Speaking activity on ‘Study Habits’\n\nWhat problems do you face when you study? Share\nyour ideasin pairs. But before that, look at the following\n\ndialogue and act it out with your partner.\n\nExample dialogue\n\nAmare: Hello Gemechu. How are you?\n\nGemechu: 1m fine and you?\n\nAmare: I have become serious about learning better English.\nFrom today, I will not speak Amharic with you.\n\nGemechu: Why?\n\nAmare: Because, I want to improve my English speaking skills.\n\nGemechu: Jt’ a good idea. I agree.\n\nAmare: Yes, if we want to develop our spoken English we must\npractice speak in English.\n\nGemechu: You are right. Moreover, we should not think of other's\ncriticism.\n\nAmare: We should also develop our reading and writing habits.\n\nGemechu: But how can we do that?\n\nAmare: We can develop reading skill through reading of fiction\nand newspapers. We can develop writing through free\nwriting on day to day experiences.\n\nGemechu: I have difficulty in understanding English spoken by\n\nnative speakers.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 69,
            "text": "§ Speaking Skills\n\nAmare: It’s a problem for me too. But I have improved a lot by\nlistening to BBC and internet video lectures on other\nsubject matters such as math.\n\nGemech: But for this we need to know grammar.\n\nAmare: Definitely, we cannot avoid it. Grammar is necessary\nfor making the language for better communication.\n\nGemechu: Yes, I agree. Now, let’ go to the class.\n\nAmare: Ok, let’s go.\n\nHow can you manage the challenges you face in studying?\nDiscuss in groups. You can discuss using the example\nphrases and organization of ideas.\n\nmw In my study, there are some problems I usually face...\nFirstly, .... Secondly, ---- Thirdly... Finally, ....\n\nm One of the solutions for this I think is....\n\nm [usually have difficulties when I study grammar/... First,\n... Second, ... Last but not least...\n\nm Probably, we can do ... as a solution for these problems.\n\nRead the following quotation carefully and discuss its\nmeaning with your partner. Then, share ideas about what to\ndo for successful learning.\n\n“The capacity to learn is a gift; the ability to learn is\na skill; the willingness to learn is a choice.” — Brian\nHerbert, author.\nYou can begin your discussion as follows.\nw | think what it meant to me is everyone can learn... the\nother is ... Besides, ...\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 70,
            "text": "§ Writing Skills\n\nWriting Skills\n\n2.6.1 Sentence level writing\n\nActivity 2.24 Based on the explanations ana\nexamples givenaboutcompouna\nand complex sentences in th\nBox below, give answers to th\n\nquestions using compound o\ncomplex sentences. The first\nquestion is done for you as an\nexample.\n\nNote:\n\nCompound and complex sentences\n\n1. Compound sentences are formed by combining two or more\nsentences which are all independent clauses. They are formed by the\n\ncoordinating conjunctions such as but, and, or, etc.\n\nFor example,\nShe worked hard and she scored good marks.\nAs you see in the example, both clauses that are combined by\n‘and’ are independent clauses; so such kind of sentences is called\ncompound sentences.\n2. Complex sentences are sentences that contain one\n\nindependent clause and one or more dependent clauses in a sentence.\n\nFor example,\n\nWhen she was in primary school, she used to study hard.\nIn the example above, the first part of the sentence is a subordinate\n(dependent) clause, while the second part of the sentence is a main\n(independent) clause. Such kind of sentences is called complex\n\nsentences.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 71,
            "text": "§ Writing Skills\n\nWhat made you be a successful student at your junior\nschool?\nmw In my junior school, I had a good study habits that made\nme a successful student. (Complex sentence)\n\nWhat made learning difficult for you at junior school?\nWhat did you get when you did your homework?\n\nWhat did you feel when you studied for a test?\n\nWhat skills did you have that made doing your homework\n\nor studying for tests easier?\n\n2.6.2 Paragraph writing\n\nActivity 2.25 Write individual sentences\nabout the study habits of a\nsuccessful student based on the\ninformation given in the Box;\nthen organize the sentences\n\ntogether in a paragraph to\ndevelop a story. Be sure that you\nuse correct punctuations and\ncohesive devices in combining\nthe sentences together. One is\ndone for you.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 72,
            "text": "§ Writing Skills\n\n(Study habits of a successful student WS\n\nHabit 1: Be Proactive: Take responsibility for your life.\n\nHabit 2: Begin with the End in Mind: Define your mission and\ngoals in life.\n\nHabit 3: Put First Things First: Prioritize and do the most\n\nimportant things first.\nHabit 4: Think Win-Win: Have an “everyone-can-win” attitude.\nHabit 5: Seek First to Understand, Then to Be Understood: Listen\nto people sincerely.\n\nHabit 6: Synergize: Work together to achieve more.\n\nHabit 7: Sharpen the Saw: Renew yourself regularly\n\ncm ra\nExample\nA successful student usually takes responsibility for his/her own\nlearning.\n: te\n\nPunctuation Tips\nPeriod (.): The ‘period’ is used at the end of a sentence.\nComma(,): There are different functions of the comma(,). Some of its\nuses include the following.\na) to separate words in a series.\nExample: The student is intelligent, hardworking and duty-minded.\nb) when the subordinate clause appears before the main clause in a\nsentence.\nExample: When I was a child, I used to play hide -and-seek.\nQuestion mark (?): We use question mark at the end of a direct question.\nExample: Do you like the English lesson?\nSemi-colon(;) We use semi-colon to join related independant clauses\n\nwith connecting words.\nExample: When I finish here, I will be glad to help you; and that is a\nzl promise I will keep. Adapted from: www.love.edu/tutor — &\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 73,
            "text": "3. Traffic Accident\n\nC Learning Outcomes )\n\nUnit\n\nAt the end of this unit, learners are expected to:\n\nlisten to a variety of texts with medium level understanding\n\nand transfer information,\n\ninteract in English medium in varied communication\nsituations with comprehensible grammar,\n\ncreate awareness to obey traffic rules for safety,\n\nread medium level reading resources and comprehend\ncontents,\n\nguess meanings of words using different clues,\n\nextend their vocabulary through antonyms and synonyms\nas strategies,\n\nuse frequency adverbs and obligation markers accurately\nin their communication,\n\nrealize the impacts of road accidents and promote safety\n\nmeasures,\n\nwrite grammatically correct sentences, paragraphs\nand essays.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 74,
            "text": "§ Listening Skills\n\n3.1\n\ntraffic accident\n\nActivity 3.1 Answer the following questions\nbased on the picture above ana\nShare your answers with you\npartner.\n\nHave you ever seen a car accident?\n\nHas it happened on you, your relative or a person whom\n\nyou know?\n\nActivity 3.2 Listen to the teacher’s reading o\nthe recorded audio and fillin th\n\nblank spaces in the following\n\nsentences.\nThe accident rate increases during when a crowd\nof people pack the roads in their to go home.\nGo to any housing estate and see children\n\nspeeding around on\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 75,
            "text": "§ Listening Skills\n\nMechanical problems and road conditions can also cause\naccidents. For example, ; ; ;\npotholes and traffic congestion.\n\nThe prevention of road accident depends largely on the\n\nof road users.\n\nIn short, a change of attitude for the better is required\nof\n\nActivity 3.3 Answer the following questions.\n\nWith your partner, discuss the damages a car accident\n\ncould cause to societies\nWhat do you think the following actors should do to reduce\ncar accidents?\nA. road crossers and pedestrians\nB. drivers\nC. traffic police\nD. driving license providers\nWrite a short paragraph about the damages a car accident\ncauses to societies.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 76,
            "text": "§ Reading Skills\n\n3.2\n\ncar crash\n\nActivity 3.4 Look at the above picture ana\nwrite down what comes to you\nmind, and discuss the following\nquestions with your partner.\n\nWhat kinds of damages does a car accident usually cause?\nWho should be blamed for the accident? Why?\n\nYou may begin your discussion with:\nm Acar accident could cause several damages such as ...\n= Who should be blamed? May be the...\n\nTraffic Accidents\n1. Every day in the newspaper, we read about road accidents\nwhere people get severely injured and even die. You may\nhave also been in an accident yourself or witnessed one\nhappening. Many of us may even have seen crowding on the\nstreet around two vehicles that look crushed. Road accidents\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 77,
            "text": "§ Reading Skills\n\nare not uncommon in big cities where there are thousands of\ncars, motorcycles, auto-rickshaws, trucks, buses, and other\nvehicles. Road accidents are most often the result of people\n\nbreaking traffic rules.\n\n. There is a reason that traffic rules are created in the first\nplace. However, people break them all the time, especially\nwhen they know that the police don’t always catch them for\ndoing it. While the people who break the rules and get away\nwith it are lucky not to get caught, they are endangering\ntheir lives whenever they indulge in such misbehavior.\nThe penalty for breaking traffic rules is generally fine,\nbut worse consequences of this are injuries like paralysis,\nbroken bones, concussions, etc. The worst possible outcome\nof breaking traffic rules and getting into a road accident is\ndeath.\n\n. The traffic rule that people break the most is jumping red\nlights, which means they keep driving even when the signal\nis red. Another bad habit that causes road accidents is drunk\ndriving. What they don’t realize is that when the light is\nred for them, it is green for someone else and that they are\nputting their lives in danger because of this. Most of the\ntime, people take turns on the road without putting on their\nindicator to do so, and this can lead to road accidents too.\nThus, breaking traffic rules is very harmful, and people\nshould refrain from doing so not only out of fear of the\n\npolice but also because it risks their lives.\n\n. Road accidents are very scary, so we must ensure the utmost\nsafety while driving. One must always wear their seat belt,\nonly drive when the signal is green, stick to the speed limit,\n\nstay in your own lane, wear helmets when riding bikes,\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 78,
            "text": "§ Reading Skills\n\netc. The best way to prevent getting in a road accident is to\nensure that you are following all the rules required to keep\nyou safe. After all, we only have one life, and it is important\nto take care of it so we can enjoy it to the fullest.\n\nActivity 3.5 Read the passage carefully ana\ndecide whether each of th\n\nstatements is ‘true’ or ‘false\nbased on the information in th\n\nA traffic accident is a matter of chance, one cannot escape\nout of it because of safety conditions.\n\nPeople break the traffic rules when they know that the\npolice are not around.\n\nRespecting traffic rules saves us not only from penalty of\nthe breach of traffic rules but also from car accidents.\n\nPeople take turns on the road without putting on their\nindicator to do so.\n\nMost car accidents occurred because of people’s breaking\nof the traffic rules.\n\n«HW ctivity 3.6 Fill in the missing information\n\nbased on the reading passa\n\nMost road accidents are the result of\n\nWorse consequences of breaking traffic rules are ,\n\n> etc.\nThe traffic rule people usually break while driving is\n\nThe word “they” in paragraph 3, line 4 refers to\nThe word “this” in paragraph 3, line 6 refers to\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 79,
            "text": "§ Vocabulary Development\n\n6. | The utmost safety traffic rules people need to respect are\n; , , and\n\nVocabulary Development\n\n3.3.1 Vocabulary from the reading passage\n\nActivity 3.7 The following words are taken\nfrom the _ reading passage.\n\nFind their meanings as per th\ncontexts used in the passage.\n\ncrowding (paragraph 1)\nindulge(paragraph 2)\nendangering(paragraph 2)\noutcome(paragraph 2)\nrefrain(paragraph 3)\n\n6. | scary(paragraph 4)\n3.3.2 Antonyms and Synonyms\n\nSynonyms are words having nearly the same meaning. Antonyms\nare words that have opposite meanings. Look at the following\nexamples for each. Refer to a dictionary if you do not know the\n\nmeanings of the words.\n\nExamples for synonyms, Examples for antonyms\nw ballot poll m adversity calamity\nm chorus refrain m bravery cowardice\nm™ enormous immense m crooked straight\nm adamant stubborn m dainty clumsy\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 80,
            "text": "$§Grammar\n\nre F ctivity 3.8 Referring to your dictionary,\nprovide the synonyms ana\n\nantonyms to the words given in\n\nthe first column. Provide also\nthe meanings of the words\n\naccident\n\ncrowd\n\nsecurity\n\ncaution\n\nrule\n\ncontrol\n\nconscious\n\nmovement\n\ncrush\n\nrush\n\nERE crammar\n\n3.4.1 Expressing Obligations (shall, should, must, will,\nhave to, etc.)\n\nActivity 3.9 Read the following Dialogues\nand pay attention to how th\nwords in bold are used in th\n\nsentences. The words in bola\ntype are modal verbs that can\nbe used to express different\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 81,
            "text": "§Grammar\n\nDialogue 1: Asking the Way\n\nChaltu: Excuse me. Can you tell me where Mercato is,\nplease?\n\nAster: Take the first turn on the left and then ask again.\nChaltu: Is it far?\nAster: No, you can walk it under ten minutes.\nChaltu: Thanks very much.\nAster: It’s a pleasure.\n\n(After she walked some distance, she got Hanna)\nChaltu: Excuse me. Could you tell me where Mercato is, please?\nHanna:\n\nFirst turn right, and then go to your left. You can’t miss it.\n\nChaltu: Thanks.\nHanna: That’s ok.\n\nDialogue 2: Shopping\nTekeste: Let’s go shopping. I have got quite a number of things\nto buy, and I believe I can get them all in the shop. You\nsee, I ought to buy a present for my sister. Today is her\nbirthday. What shall we look at first?\nAyalew: — T-shirt, I think. They must be on the ground floor. Yes, here\nwe are, and I can see just the kind I want.\nTekeste: Well, that didn’t take us long. Now let’s go up stairs to\nthe second floor.\nAyalew: We just take a quick look around to see if there is anything\nwe could take as presents to the family.\n\nTekeste: I like these books, and do you? Shall we ask how much\n\nthey are?\nAyalew: I want to get a comb and some hair clips. Where do you\nthink I can find them?\nTekeste: Oh, you must go to men’s clothing department. It is in\n\nthe lower floor. We’ll get them on our way out.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 82,
            "text": "§Grammar\n\nStudy the following words.\n\nI. can 3. can’t 5. shall\n2. could 4. must 6. will\n\nAdd also the following to the list:\n\n7. would 9. have to 11. don’t need to\n\n8. ought to 10. need 12. don’t have to\nThese verbs are called modal verbs that have different meanings\nin different contexts. For instance, the word shall can be used to\nexpress willingness, and suggestions in different contexts. Note the\nfollowing examples to learn about the meanings of the different\n\nmodal verbs.\nExamples\n1) Shall we go out tonight? (expresses suggestion)\n@) Shall J open the door for you? (expresses willingness)\n\nSimilarly, the other verbs have also different meanings in different\n\ncontexts.\nExamples\n\n1) You ought to apologize to her. Ought you apologize to her? (advice)\n\n@) You ought to go now before it rains. Ought you to go before it rains?\n(necessity)\n\n3 I should call a doctor; you dont look well. Should I call a doctor?\nyou dont look well (advice)\n\noO I need to use the restroom. (Necessity)\n\n5 You have to call them tomorrow. (Obligation)\n\n6) The dog must not (mustn t) jump on the white sofa. (Prohibition)\nG) You do not (don t) have to wash the dishes today. (Necessity)\n\n3 He doesn’t (does not) need to shower tonight because he did so this\nmorning. (Obligation)\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 83,
            "text": "§Grammar\n\n9 ) Will you empty\n\n(consequence).\n\nthe dishwasher later? I dont have time today\n\nThe following examples indicate how the verbs are used in\n\nstatements, negative\n\nsentences and questions. We have also tried\n\nto give you examples of the statements and the question forms for\n\nsome of them.\n\nStatements\n\nNegative sentences Questions\n\n1 | You can swim.\n\nYou cannot swim. Can you swim?\n\n2 |He must leave.\n\nHe must not (mustn’t) leave. | Must he leave?\n\n3 | You should go.\n\nYou should not (shouldn’t)\n\n9\n20. Should you go?\n\nSummary notes\n\nModal verbs express ideas such as future ideas, permission,\n\npossibility, prediction, speculation, deduction and necessity, etc.\n\nIn the following table\n\n, you will find the summary of the functions of\n\nsome of the modal verbs with examples. The summary was adapted\n\nfrom Learn English Today, English Grammar for ESL Learners.\n\nMODAL\nFunction Example\nVERBS\nAbility Almaz can swim.\nPermission May/Can I come with you?\nC\nan Offers Can I help you?\nPossibility That story could be true\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 84,
            "text": "§Grammar\n\nPast ability Zeberga could swim when he was\nfour years old.\nCould | Permission Could I use your phone please?\nRequests Could you tell me to the station,\nplease?\nPossibility May you tell me the way to the\nstation please?\nMay Permission May I borrow your dictionary?\nSlight possibility We might win a prize but I doubt it.\n; Past form of ‘may’ |The President said he might come.\nMight ;\nin reported speech\nMust Obligation Dogs must be kept on a lead.\nLogical deduction | You must be tired after your long\njourney.\nMustn’t | Prohibition You mustn’t tell Nisredin. It’s a\nsurprise!\nShould | Advice I’ve revised so I should be ready for\nthe test.\nLogical deduction | You ought to write to your\ngrandmother.\nAdvice You ought to do your homework\nevery day.\nOught to Logical deduction | 100 Birr ought to be enough for the\ntaxi.\nFuture tense I shall be in Nekemte on Monday.\nShall Offers/ suggestions | Shall we begin the meeting\ntomorrow?\nFuture tense The ticket will cost about 10 Birr.\n. Invitation/ offers Will you join us for coffee?\nWill\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 85,
            "text": "§Grammar\n\nDef ctivity 3.10 Select the correct verb ana\n\nunderline it.\n\nI (should/can/may/has to) leave now as it is very late.\n(Can/Would/Shall/May) you like a cup of tea, please?\n(Would/May/Can/Shall) we have lunch together?\n\nAll citizens (can/should/need/could) abide by the law.\n\nI (will/should/must/would) like to have one more pencil.\n\nActivity 3.11 Fill in the blanks in the dialogue\ngiven below with may, should,\n\nSenait was looking out of the window when she noticed the clouds in the\n\nsky. “Wow”, she called, “it seems like it (1) may rain”.\n\nSenait: Letemichael! | think you (2)should take the\numbrella with you.\n\nLetemichael: Ohno! The umbrella is too big! I (3) can not\ncarry it by myself. I (4) would rather\nleave it at home.\n\nSenait: What are you talking about? You (5) will\nget wet for sure!\n\nLetemichael: You know, Senait, people (6) can get wet.\nIt’s not the end of the world. (7) can I just\ngo without it?\n\nSenait: No, you (8) can not. Fikrte told her\nhusband Tolosa that he (9) could leave\n\nwithout his umbrella and look what happened to him.\n\nLetemichael: What happened to him?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 86,
            "text": "$§Grammar\n\nSenait: (10) would you please stop talking and take\nyour umbrella with you?\nLetemichael: There arent that many clouds in the sky. It (11)\n\nmight____ not rain after alll.\nSenait: You (12) must be joking.\nLetemichael: Well, aman (13) must do what a man\n(14) must do. I (15) will take the\numbrella. (16)Should I take anything else?\nSenait: If I were you I (17) would be happy to\ntake an umbrella.\nLetemichael: I (18) would like to be happy, but its\ntoo heavy!\n\nActivity 3.12 Fill in the blanks in the passag\n\ngiven below with can, could,\ncouldn't, must or might.\n\nBefore this year, I (a) move out of my parents’ house\nbecause I did not have a job. But now that I have finished college\nand have a job, I realise that living at home (b) drive\n\nmy parents and me crazy.\n\nUnfortunately, it’s not so easy to find a flat on rent in the city.\nWithout an agent, you (c) not be able to find all the\navailable listings. Because of my agent’s help, I found a wonderful\nflat this morning and signed the lease. Before now, I couldn’t sign\n\na lease, but now I (d) because I am twenty-one.\n\nI asked my friends to help me move because I knew that I (e)\n\nfit all my possessions into my little car. My best friend\n\nsaid, “T (f) help you move next Sunday.” He added, “‘T\n(g) help in the morning as I am free.” My father also\noffered to help me move. He (h) be really eager to have\n\nme move out!\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 87,
            "text": "§Grammar\n\n3.4.2 Do/do not (don’t)/does/does not (doesn’t)\n\nThe words do, does, don’t and doesn’t almost always appear in\npeople’s English speaking and writing. They are used in affirmative\nand negative sentences and questions.\n\nExamples\n\n1) Many students do their chores when they return home. Affirmative\n\nsentences\n@) Almaz does charity work when she has time.\n3 | She does not (doesn’t) speak French well. Negative\nsentences\n\noO They do not (don’t) write Spanish.\n5 | Does the teacher drive to school? Questions\n6 Do the students do their chores when they return home from school?\n\n@ Don’t you listen to the teacher when explains? — Questions using\ndon’t and doesnt\n\n3 Doesn’t she go to church every Sunday?\n\nActivity 3.13 Change the following statements\ninto negative and question\n\nforms following the examples\ngiven to you.\n\nExamples\n1) Zelalem likes to play football after school.\nNegative: Zelalem doesn t like to play football after school.\nQuestion: Does Zelalem like to play football after school?\n@) The teachers drive to work every day.\nNegative: The teachers dont drive to work every day.\n\nQuestion: Do the teachers drive to work every day?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 88,
            "text": "§Grammar\n\nNow do the same for the following statements.\n\nDoes your teacher give feedback everyday?:\nNegative:\n\nQuestion:\nDo you swim well?.\nNegative:\n\nQuestion:\nDoes she speak English?.\nNegative:\n\nQuestion:\nDo they read books?\nNegative:\n\nQuestion:\nDoes he trallel by bus?.\nNegative:\n\nQuestion:\n\nHave you noticed how do and does are used? ‘Do’ is used with\nplural subjects, while does is used with singular subjects. Read the\nfollowing brief note in the Box below as a summary for how the\n\nverbs are used.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 89,
            "text": "§Grammar\n\nThey He\nWe do She does\na (don’t) It (doesn’t)\nAbebe and The student\nBekele Examples.\n\nExamples 1. He works very hard.\n\n1. We want to learn French. = He doesn’t work very hard.\nm We don’t want to learn French. m Does he work very hard?\n= Do we want to learn French? 2. She loves doing exercises.\n\n2. They like going to the gym. m She doesn’t love doing\nm They don’t like going to the exercises.\n\ngym. m Does she like doing\nm Do they like going to the gym? exercises?\n\nActivity 3.14 Choose and underline the correct\nword from the given words in\n\nbrackets. The first one is done\n\nPlease (don’t/does/do/doesn’t) play with your food.\nThis cafe (do/does/doesn’t/don’t) serve alcohol.\n(Do/Doesn’t/Does/Don’t) they listen to pop music?\nWhat (does/don’t/doesn’t/do) that mean?\n\nShe (does/do/don’t/doesn’t) like animals so she won’t go to\nthe zoo.\n\n6. | I (don’t/doesn’t/do/does) want to talk about it anymore.\nI (Do/Does/Don’t/Doesn’t) do much more work in the\n\nevenings.\n8. | (Don’t/Do/Does/Doesn’t) you like coffee?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 90,
            "text": "§Grammar\n\nActivity 3.15 Answer the questions below as\n\ngiven in the examples.\n\nExamples\n1) Does Ali go to school?\na) Yes, he does.\nb) No, he doesn’t.\n@) Do you play volleyball?\n\na) Yes, I do.\nb) No, I don’t.\n\n3 | Does your teacher give feedback ever day?\n\na) .\nb) >\n\n4 | Do you swim well?\n\na) .\nb) ,\n5 | Does she speak English?\n\na) .\nb) ,\n6 Do they read books?\n\na) .\nb) ;\nG) Does he travel by bus?\n\na) .\nb) ,\n3.4.3 Adverbs of frequency\n\nIn Unit 2, you have learned about the adverbs of frequency. Do you\nremember the words? What are they? Yes, they are always, usually,\noften, occasionally, seldom, sometimes, rarely, and never. You have\nstudied how the adverbs of frequency are used in sentences both in\n\nstatements and questions.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 91,
            "text": "§Grammar\n\nExamples\n\n1) Helen always goes out on Sundays..\n@) You must always try your best.\n3 | How often do you watch films?\n\nActivity 3.16 Construct your own sentences\nusing each of the adverbs of\nfrequency, and show your\nsentences to your partner.\n\nActivity 3.17 Read the following dialogue\nand underline the adverbs of\n\nReporter: So, Tadesse, you’re majoring in Journalism, right?\n\nStudent: Yes, that’s correct. I’m graduating next June, and I’m\n\nlooking for jobs now.\n\nReporter: It’s never too early to do that!\n\nStudent: I know! So I'd like to ask you a few questions about what\n\nit’s like to work for a newspaper.\n\nReporter: Sure, go ahead.\n\nStudent: Well, my first question is a basic one. Do you pretty much\n\ndo the same thing every day?\n\nReporter: No, not really. I rarely do the same thing from one day to\nthe next.\n\nStudent: Could you explain that a little bit more?\n\nReporter: | Well, I mean that I always have a story that I’m working\non, but the stories are always different, so I never see\nthe same people. I visit different people, go to different\nplaces, and do many different things. My job has a lot of\n\nvariety.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 92,
            "text": "§Grammar\n\nStudent: How often are you in your office?\n\nReporter: Well...some of the time... I mean, my computer is there,\nand that’s where I write my stories I go to interview people\nin their homes and offices. Actually I spend a lot of time\n\nin my car going to and from interviews.\n\nStudent: How do you stay in touch with the newspaper then?\n\nReporter: Oh, I always take my cell phone with me.\n\nStudent: Do you usually have a laptop with you, too?\n\nReporter: No. I don’t like to use laptop when I am interviewing’. I\nsometimes take notes on paper, but I usually use a little\nvoice recorder. Then I type my stories as soon as I get\nback to the office.\n\nStudent: So you dont use email much.\n\nReporter: Oh, yes, I do. I always check my email before and after\n\nlunch, and morning, again when I get to the office,\n\nbefore and after lunch, and again before I go home in\nthe evening.\n\nStudent: Wow, that’s a lot! Do you check your email on weekends,\ntoo?\n\nReporter: Yes, I usually check my email on weekends. I will\nanswer personal emails, but I have a rule that I never\n\nanswer business emails on the weekend or a holiday.\n\nActivity 3.18 Select the correct use of th\nadverbs of frequency in\n\nbrackets in the story below, ana\nunderline the correct answers.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 93,
            "text": "Speaking skills\n\nOur Garden\n\nAt our house, we have a great urban garden. My husband (1. Wakes\nusually up/ usually wakes up/wakes up usually) at 7a.m every day.\n(2. Sometimes he/He sometimes) goes for a run, but (3. usually\nhe/he usually) waters the garden. He (4. never asks/asks never)\nus to help him that early because we (5. Usually are/are usually)\ngetting ready for school. Our kids (6. seldom are/ are seldom) late\n\nfor school and (7. often are/are often) there pretty early.\n\n(8. Sometimes it/It sometimes) rains in the afternoon. In the summer,\nit (9. usually storms/storms usually) between 2 PM and 4 PM in the\nafternoon. It (10.rains rarely/rarely rains) in the wintertime, so my\nhusband or our children will have to water the garden then. In the\nfall, we (11. have usually/usually have) lots of pumpkins that we\n(12.always carve/carve always) to get the seeds for roasting. In the\nspring, we (13. sometimes have/have sometimes) cucumbers that\nwe pickle in jars. In early summer, we (14. have often/often have)\nbeautiful red strawberries that we pick and turn into jam. It (15.\nsometimes is/is sometimes) a lot of hard work, but we don’t have\n\nto make as many trips to the grocery store.\n\nBal speaking skills\n\nSpeaking activity based on the\nlistening passage\n\nActivity 3.19 In the listening activity, you\nhave listened to the causes of\ntraffic accidents like excessive\n\nGet into groups of 3 or 4 members, and discuss the major\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 94,
            "text": "gSpeaking skills\n\ncauses and solutions of traffic accidents. Some are stated in\nthe table below;\n\nDiscuss what people must do to minimize traffic accidents.\n\nCauses solutions\nbreaking traffic rules respecting traffic rules\noverloading awareness creation\npoor quality of roads road maintenance\n\nActivity 3.20 Using the above phrases, act\n\nout the following dialogue by\n\nDialogue\n\nTewabe:\n\nRegassa:\nTewabe:\nRegassa:\nTewabe:\n\nRegassa:\n\ncompleting the missing clauses.\n\nThese days, traffic accidents have become a serious\nproblem in our country, isn’t it?\n\nYes, it is. Several people\n\nWhat do you think is the reason for that?\n\nBecause\n\nWhat must the government do to solve this problem?\n\nTewabe:\nRegassa:\n\nTewabe:\n\nRegassa: Yes, they do.\n\nWhat about the road users?\n\nThe roads themselves also cause traffic accidents, don’t\nthey ?\n\nExtend the dialogue adding more causes and solutions for traffic\n\naccidents.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 95,
            "text": "§ Writing Skills\n\nWriting Skills\n\nWriting informal letters\n\nLetter writing is an important skill you should develop. Written\ncommunication in both formal and personal matters is crucial and\nso it is necessary to develop a skill for letter writing. Here, we will\nfocus on how to write informal letters.\n\nInformal letters are written to close acquaintances of the writer such\nas friends, family and relatives. They are also written in informal\nand person tone with no set format. However, there is a general\n\npattern (format) given below.\n\nFormat of Informal Letter\n\n1. Sender’s Address\n2. Date (e.g. 25 April 2020)\n\n3. Salutation (e.g. Dear Mom)\n4. Body of the letter:\n\nA. Introduction\nB. Main content (Description)\n\nC. Conclusion\n\n5, Subscription\n\n6. Writer’s Name\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 96,
            "text": "§ Writing Skills\n\nLetter 1\nNefas Silk, 203\n\nAddis Ababa\n\nAugust 12, 2021\n\nDear Marta,\n\nI hope this letter finds you well and holds up over your mother’s death of a\n\ntraffic accident. I know what a difficult time it is for you.\n\nI think that when God created mothers as the very special people that they\nare. He had your mom in mind already. She was truly one of those blessed\nand good people who are full of so much grace and dignity.\n\nI know your faith will comfort you. My prayers will be for you and your\nfamily to find the peace and strength that comes in knowing that a loved\none has gone to their eternal rest.\n\nGod Bless You.\n\nWith love and affection,\n\nHanna Eyasu\n\nGrade 9 English Textbook\n\n83"
        },
        {
            "page_number": 97,
            "text": "§ Writing Skills\n\nLetter 2\nHawassa, 453\n\nJuly 21, 2021\nDear Feysa\n\nI am so sorry to read your devastating news. I never met your Dad, but\nknow how wonderful and supportive he was to you over the years and can\n\nonly start to imagine what you are feeling now.\n\nYou will gradually find comfort in all the happy memories. Your parents\nfound their new life in Australia and lived the last years of their life in\n\ncontentment there, surrounded by family.\n\nYour dad lived to see you find happiness and security and love. He will\nhave died content for knowing that. And best of all he did not suffer a\n\nlong illness.\n\nMake sure you find time to grieve and allow yourself to do so — and don’t\nexpect it to pass quickly. Losing a parent takes time to process for us\nmortals. Do you remember I was in the aftermath of losing my dad when\nwe first became close? I didn’t fully recover from that for at least two\nyears — and made some very strange decisions and acted out of character\n\nfor much of that time.\n\nI wish I could be with you to try to help somehow. I’m giving you a big hug\n\nnow from halfway across the globe.\nSending love to you and all your family.\n\nTake care and hang on in there.\n\nDaniel Teshome\nAddis Ababa Municipality\n\nAddis Ababa\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 98,
            "text": "§ Writing Skills\n\nActivity 3.21 Look at the following lette\nwritten to a friend who had a\ncar accident informing him\nabout his speedy recovery in\n\na consoling tone. Identify th\ndifferent parts of the letter.\nThen, write your letter to you\nfriend who lost his father two\nweeks ago.\n\nDire dawa, 241\n\nJune 21, 2021\n\nDear Assefa\n\nI hope this letter finds you in the best of spirits. When I visited last week,\n\nyou seemed a little bit depressed.\n\nCome on boy, you should thank God for giving you a fresh lease of life.\nEverything is going to be fine very soon. I even talked to your doctor this\n\nmorning and he told me that you are out of danger now.\n\nYou will have to remain in the hospital for a few more days but that is not\nsomething you should be concerned about. Your family and friends are\n\nthere for you.\n\nDon’t forget that life is a mixture of joys and sorrows. By the way, all of\nus have decided to celebrate your recovery as soon as you come home.\nYou will be throwing a party the day you come back home from the\nhospital. Hope to see you soon. My parents and younger sister have sent\n\nyou lots of love and wishes.\n\nWish you a speedy recovery!\nYours truly,\nDaniel\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 99,
            "text": "Unit\n\n4 National Parks\n\n4 Learning Outcomes )\n\nAt the end of this unit, learners are expected to:\nlisten to a variety of texts with medium level understanding\n\nand transfer information,\n\ninteract in English in varied communication situations\n\nwith comprehensible grammar,\n\ncreate awareness about participating in preserving\n\nnational heritages,\n\nread medium level reading resources and comprehend\ncontents,\n\nguess meanings of words using context clues,\n\nconstruct zero conditional and conditional type 1\n\nsentences,\nextend information from listening texts to writing, and\n\npractice report writing.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 100,
            "text": "§ Listening Skills\n\n4.1\n\nGambella National Park\n\nActivity 4.1 Before you listen to the listening\ntext, look at the picture above\nand discuss the following\nquestions in\n\nHave you visited a national park in Ethiopia?\n\nWhat have you seen?\nWhat do you think national parks are important for?\n\nActivity 4.2 Listen to the teacher’s reading o\nthe recorded audio and fill in\nthe blanks given below.\n\nGambella National Park is one of parks and has\n\nno\n\nOriginally the park was created for protection of extensive\n__ and its\n\nTo the south of the park is that flows from Gog\nto Tor in a northwesterly direction.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 101,
            "text": "Reading skills\n\nThe landscape of Gambella is low and flat with altitude\n\nranging from to masl (meter above sea level.).\nThe people of this area are and\n6. | The two people lived in the national park are and\n\nActivity 4.3 Answer the following questions.\n\nDiscuss with your partner about major characteristics of\n\nthe Gambella National park.\n\nWrite a paragraph about economic and social values of the\nGambella National Park.\n\n+2 skills\n\nActivity 4.4 Answer the following questions\nbefore you read the passage,\n\nand discuss your answer with\nour partner..\n\nWhat do you know about national parks?\nStudy the following words that could help you understand\nthe reading passage.\n\nreserve endemic wildlife species\nNational Parks in Ethiopia\n\n1. The natural beauty of Ethiopia amazes the first-time\nvisitors, Ethiopia is a land of rugged mountains, some 25\nare over 4000-meter-high, broad savannah, lakes and rivers.\nThe Great Rift Valley is a remarkable region of volcanic\nlakes, with their famous collections of birdlife, great\nescarpments and stunning vistas. With nine major wildlife\n\nnational reserves, Ethiopia provides a microcosm of the sub\n\nRR Grade 9 English Textbook"
        },
        {
            "page_number": 102,
            "text": "Reading skills\n\nSaharan ecosystem, birdlife abounds about 860 species,\nand indigenous animals from the rare Walia Ibex to the shy\nWild Ass, room free as nature indeed. Here, some of the\n\nmost interesting Ethiopia’s national parks that enable the\nvisitors to enjoy the country’s scenery and wildlife, birds\n\nand mammals are presented.\n\nAwash National Park\n\n2. It is the oldest and most developed wildlife reserve in\nEthiopia, featuring the 2,007 meters Fantalle Volcano Crater\nwith stunning views, extensive mineral hot spring and\nextraordinary volcanic formation, and this natural treasure\nis bordered to the south by the Awash River and 225 km east\nof the capital, Addis Ababa.\n\n3. The wildlife consists mainly of East African plain animals\nincluding Beisa Oryx, Defassa Waterbuck, Soemmerring’s\nGazelle, Salt’s Dik — Dik, Greater and lesser Kudu, Warthog,\nAnubis and Hamadrayas Baboon, Colobus and Varvet\nmonkey, Crocodile, Hippopotamus, the endemic Hartebeest,\n\nLion, Leopard, Cheetah and 450 species of birds all living\nwithin the park’s 720 sq. km.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 103,
            "text": "Reading skills\n\nBale Mountains National Park\n\n4. The Bale Mountains, with their vast moorlands and extensive\nheath land, virgin woodlands, pristine mountain streams and\nalpine climate remain untouched and beautiful world. Rising\nto a height of more than 4,000 meter, the range borders\nEthiopia’s southern highlands, whose highest peak, Mount\nTullu Dimtu the second highest peak in Ethiopia stands at\n4,377 meters.\n\n5. The establishment of the 2,470 sq km, Bale Mountains\nNational Park was crucial to the survival of the four endemic\nmammals, Mountain Nyala, Menelik’s Bushbuck, Ethiopian\nWolf and Giant Mole Rat and different endemic species\nof birds including Rouget’s Rail, Abyssinian Woodpecker,\nAbyssinian Cat Bird, White Backed Black Tit, Olive Trash,\nWattle Ibis and Crane are some of the species inhabiting the\npark. Besides Bale Mountains offer some fine high-altitude\nhorse and foot trekking, and the streams of the park, which\nbecome important as they well stocked with rainbow and\n\nbrown trout fishes.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 104,
            "text": "Reading skills\n\nOmo National Park\n\n6. The most wilderness Ethiopia’s National Park, with an\narea of 4,068 sq km, it is a vast expanse of the wilderness,\nadjacent to the Omo River, is home to a remarkable range\nof wildlife. 306 species of birds have been identified here,\nwhile large herds of eland, some buffalo, elephants, giraffe,\n\ncheetah, lion, leopard, and Burchell’s zebra are common.\n\n7. The park is not easily accessible, as the current means\nof access is via Omorate and the ferry to the north bank\n\nof the river. The park headquarter is 75 km from Kibish\n\nGrade 9 English Textbook 0]"
        },
        {
            "page_number": 105,
            "text": "Reading skills\n\nsettlement. However, a new airstrip is also available close to\nthe headquarters and a pleasant campsite on the Mui River\n\nplans are in hand for further major improvements.\n\nSimien Mountains National Park\n\n8. The Simien Mountains National Park covers 400 square\nkilo meters of highland area at an average elevation of\n3,300 meters. Ras Dejen at 4,620 meters the highest peak in\nEthiopia, stands adjacent to the park. Within this spectacular\nsplendor, three endemic mammals can be visited here,\nWalia Ibex, Ethiopian wolf and Gelada Baboon as well as\nklipspringer and Bushbuck. Birds such as Lammergeyer,\nAugur Buzzard, Verreaux’s Eagle, Kestrel and Falcon also\nsoar above this mountain retreat. UNESCO as a world\nheritage site has recorded the Simien escarpments, which\nare often compared with a Grand Canyon in the USA.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 106,
            "text": "§Reading skills\n\nAdapted from OVERLAND ETHIOPIA TOUR. ‘JOURNEY\nTHROUGH ANCIENT LAND’\n\nThe natural beauty of Ethiopia amazes visitors for its\nmountains, savannah lands, lakes and rivers.\n\nMount Tullu Dimtu is the highest peak in Ethiopia which\nstands at 4,377 meters.\n\nThree endemic mammals are found in the Semien National\nPark.\n\nThe Omo National Park can be easily accessible using\nwater transport.\n\nThe Awash National Park is the oldest and most developed\n\nwildlife reserve in Ethiopia, with 3007 meters.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 107,
            "text": "Reading skills\n\nM75\n\n«WH ctivity 4.6 Read the passage carefully and\n\nanswer the following questions.\n\nBased on information in the reading passage, match the\n\ninformation listed under “‘ A’ with ‘B’\n\nNational Park\n\nColumn A Column B\n1. Awash National Park A. Walia Ibex, Ethiopian wolf and\nGelada Baboon\n2. Bale Mountains B. 306 species of birds eland, buffalo,\nNational Park elephant\n3. Omo National Park C. Crocodile, the endemic Hartebeest,\nLion, Leopard, Cheetah\n4. Simien Mountains D. Mountain Nyala, Menelik’s Bushbuck,\n\nEthiopian Wolf and Giant Mole Rat\n\nBased on the passage, how many National Parks are\nrecorded in the UNESCO’s world heritage site? State the\n\nname/s.\n\nWhy do you think only a few of the national parks are\nrecorded in the UNESCO heritage preservation program?\n\nWhat kinds of benefits do you think the national parks\ncould get from UNESCO?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 108,
            "text": "§Vocabulary Development\n\nFEB Vocabulary Development\n\n4.3.1 Vocabulary from the reading passage\n\nActivity 4.7 The following words are taken\nfrom the reading passage. Find\n\ntheir meanings based on the\ncontexts they are used in the\n\namazes (paragraph 1, line 1)\nstunning (paragraph 1, line 6)\nscenery (paragraph 1, line 12)\nextraordinary (paragraph 2, line 4)\nheath (paragraph 4, line 2)\n\n6. | inhabiting (paragraph 5, line 7)\nexpanse (paragraph 6, line 2)\n8. | ferry (paragraph 7, line 2)\n\n9. | peak (paragraph 8, line 3)\nsoar (paragraph 8, line 9)\n4.3.2 Phrasal verbs\n\nActivity 4.8 Match the phrasal verbs\nunderlined in Column A with\n\ntheir meanings in Column B.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 109,
            "text": "§Vocabulary Development\n\nColumn A Column B\n. The fire burn up the forest. a. require\n. We hope, he will call back soon. b. telephone\n. The politicians call for discussion with the c. cancel\nd.  returna\ngovernment.\n; ; phone call\n. Meeting her again called up all those old ;\ne. relax\nmemories.\nf. remember\n. The manager will call off tomorrow’s meeting\n— g. stop\nas his wife needs a special care. h. like\n. They really care for her. j. perform\n. The students agreed to carry out their k. remove by\nhomework together. burning\n\n4.3.3 Prefixes\n\nexamples below.\n\nPrefixes are sets of letters that are added to the beginning of words.\nThey are not words in their own and cannot stand on their own in\n\na sentence. But, they change the meanings of words. Look at the\n\nPrefixes meaning examples\nante before, preceding ante-room, precedent,\nanti opposing, against | anti-aircraft, antibiotic\nen put into, on enlighten, engulf\ndis negation, removal\n\ndisagree, disadvantage\n\nun not\n\nunacceptable, unreal\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 110,
            "text": "§Grammar:\n\nActivity 4.9 Look the following words. They\n\nhave_pre-fixes. Underline thé\n\npre-fix and its meaning foreach\nword given. One is done for you.\n\n1. uniform = same\n\n2. undeserved 4 enable 6. anterior 7. disjunction\n\ndisqualify 5. antioxidant\n\nae\n\nZero Conditional and First\nConditional Sentences\n\nDid you learn about the conditional sentences before? It does\nnot matter if you haven’t been introduced with them. You know,\nconditional sentences show possible outcomes in certain conditions.\nConditional sentences are also usually called ‘if-clauses’. The\nclause that begins with ‘if’ introduces a condition that may or may\nnot happen depending on circumstances. In other words, the event\ndescribed in the main clause depends on the condition described in\n\nthe conditional clause.\n\nExamples\n1) If it is cold, I put on a coat.\n\n@) We will stay at home if it snows.\n\n3 | We would stay at home if it snowed.\n\noO If I were you J would accept the offer.\n\n5 If you hadn’t been late for work, the boss wouldn’t have gotten\n\nfurious.\nIn all the examples above, ‘I put on a coat, we will stay home,\nwe would stay at home’, and ‘the boss wouldn’t stay at home’ can\n\nhappen based on the condition in the ‘if clauses’ ‘if it is cold’, ‘if it\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 111,
            "text": "§Grammar:\n\nsnows’, ‘if it snowed’, ‘if I were you’, and ‘if you hadn’t been late\n\nfor work’.\n\nEach of the above conditional sentences represents different\nconditional types, the first one being the zero conditional. The\nconditional sentences vary from probable to impossible meanings.\nSentences 3-5 are classified under conditionals type 2 and 3; and\nyou will study them in Unit 5. In this Unit, however, you will\nlearn about the zero conditionals and conditional type 1 which\nare similar to examples | and 2 above. The zero conditionals are\nalso called facts, while conditional type 1 is probable. Read the\nfollowing additional examples and see how the verb tenses in the\ntwo parts of the sentence (main clause and if-clause) in the zero\n\nconditional are used.\n4.4.1 The zero conditional\n\nExamples\n1) If I drink coffee, I get a headache. OR I get a headache, if I drink\n\ncoffee.\n@) The door opens if you press this button. OR If you press this button,\n\nthe door opens.\n\n3 | [If it doesn’t rain, the flowers die. OR The flowers die if it doesn’t\n\nrain.\n\n4 ) If you boil water to 100 °c at sea level, it changes to steam. OR\n\nWater changes to steam if you boil it to 100 °c at sea level.\n\nHave you noticed the verb tenses used in the main and subordinate\nclauses, and how the sentence parts are placed in the sentences?\nThe verb tense used in both parts of the sentence (drink and get;\nopens and press; doesnt rain and die; and boil and changes) is\nsimple present tense. As you see from the examples, each of the\nsentences can be spoken or written by using the subordinate or\n\nthe main clause at the beginning of the sentence. What about the\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 112,
            "text": "§Grammar:\n\nmeaning? In all the sentences, the meanings indicate a fact that the\nfulfillment of the actions in the subordinate clauses (if-clauses) is\na condition for the fulfillment of the actions in the main clauses. If\n\nyou take the final statement as an example, ‘/f/you boil water to 100\n\n°c at sea level, it changes to steam’, it is true to anyone anywhere\nthat if one boils water to 100 °c at sea level, it changes to another\nstate; that is steam. Discuss with your partner about the meanings\nof the other sentences in the examples. Discuss also about how you\n\ncan use the comma in the sentences.\n\n4ctivity 4.10 Develop zero conditional\nsentences based on the given\n\nincomplete sentence parts in\nbrackets. The first two are done\nor you as an examples.\n\n(I /wake up late / I /be late for work)\n\nIf I wake up /ate, J am late for work?\n(my husband /cook/ he /burn the food)\n\nIf my husband cooks, he burns the food.\n(Aster / not wear a hat / she / get sunstroke)\n\n(children / not eat well / they / not be healthy).\n(you / mix water and electricity / you / get a shock)\n6. | (people / eat / too many sweets / they / get fat)\n(children / play outside / they / not get overweight)\n8. | (you / heat ice / it / melt)\n\n9. | (I / feel good the next day /I/ go to bed early)\n\nThe weather / be fine) (I / cycle to work /\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 113,
            "text": "§Grammar:\n\nActivity 4.11 Write the correct forms of verbs\n\nin brackets. The first one is done\nor you as an example.\n\nTinsae, what do you do if your parents are at home?\n\nIf my parents stay at home in weekends, I\n\nhave to help with housework.\n\nIf my mother (be) at home, I do the washing\nup.\n\nIf she (not be) at home, I wash the car or\nwork in the garden with my dad.\n\nIf they (be) at home on weekdays, I do my\nhomework first and then go out.\n\nIf my father (not work) in the evening, we\n\nplay games on his computer.\n\nActivity 4.12 Match the clauses in Column A\nwith those that correspond in\n\nColum B.\n\nAue Ye N\n\nIf a lion joins a group of other | a .it can be heard over five miles\nlions away.\n\nIf lions go hunting b. it usually stays with them for\nthree years.\n\nIf a lion roars\n\n. ; c. they work in teams.\nIf lions are active ; ; ;\nd. they establish their territory.\n\nIf male lions use cent marking\n\ne. it is usually at night.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 114,
            "text": "§Grammar:\n\nActivity 4.13 Choose from the list of clauses\n\ngiven and _ complete _ th\nsentences below.\n\nList of clauses\n\na they are blind for six days a they have to leave their\na they show their affection mothers\na the loser often dies a lions fight them off\n\nIf lions rub each other’s heads,\nIf any strange males try to enter their territory,\nIf lions start fighting,\nIf cubs are born,\nIf male cubs are two years old,\nAdapted from, https://www.e-grammar.org/conditional-0-exercises-pdf/\n\n4.4.2 Conditional type 1 sentences\n\nRead the examples below and tell the difference between the verb\nforms of the zero conditional and conditional type I sentences.\n\nExamples\n1) [fit rains, you will get wet. OR You will get wet if it rains.\n\n@) If you don’t hurry, you will miss the bus. OR ou will miss the bus\nif you don’t hurry.\n\nNote\n\nm Conditional sentence type 1 differs from the zero conditional in\nthat the verb tenses are simple present and simple future in the\nsubordinate and main clauses; and\n\nm The meanings of the sentences refer to possible conditions and\nprobable results.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 115,
            "text": "§ Speaking Skills\n\nActivity 4.14 Complete the Conditional\nSentences (Type I) by putting\n\nthe verbs in parentheses into\nthe correct form following the\nexamples above.\n\nIf you (send) this letter now, she (receive) it tomorrow.\n\nIf I (do) this test, I ((mprove) my English.\n\nSenait (go)shopping if she (have) time in the afternoon.\n\nSolomon (go)to Bahir Dar next week if he (get) a cheap\nflight.\n\nIf they (not study)harder, they (not pass)the exam.\n\n6. | If it (rain) tomorrow, I (not have) to water the plants.\n\nSpeaking Skills\n\nThe speaking activity in this Unit is related to the contents you have\nhad in the reading passage in the Unit. Look at the pictures below\n\nand discuss in groups about their names, where they are found and\n\nimportance, etc\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 116,
            "text": "§ Writing Skills\n\nActivity 4.15 Take the set of questions in Colum\nAor Bandask questions inturns.\nYou can extend the questions\n\nfor more conversation. The first\nquestion is done as an example.\n\n= How important is tourism to mw What is tourism?\nour country? m Do you think tourism helps\nmg What are the good and bad people in the world?\nthings about tourism? w Are tourists in our country\nmw What are the major tourist or your community funny?\nattractions inour country? mg What changes do you\n= How does tourism change observe in tourist sites?\npeople’s life? a What factors affect tourism?\nmw What does the government\nmust do to develop the tourism\nindustry?\nExample\n\nStudent A: How important is tourism to our country?\nStudent B: IJ think tourism is important for generating income ....\n\n4.6 | Writing Skills\n\n4.6.1 Writing activity related to the listening passage\n\nActivity 4.16 Do you know a national park in\nyour surrounding? Write 3 to\nsentences about what kinds of\n\nanimals are found in the park.\nUse the information given in th\ntable for writing the sentences.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 117,
            "text": "§ Writing Skills\n\nmammal species Hippo, Zebra,\nNech Sar National Park Buffalo\n\nAbiyata-Shala lakes National\nPark\n\nMango National Park\n\nothers\n\nExample\n\nNech Sar National Park is located around my village and it is known\n\nfor wild animals such as Hippo, Zebra and Buffalo.\n\n4.6.2 Writing a short report\n\nActivity 4.17 Write a short report about\nthe place you have visited.\nYour report must answer th\n\nfollowing questions. A sampl\nreport paragraph is given to\nou in the Box.\n\nHave you visited any historical place recently?\nWhere did you go?\n\nWhen did you go?\n\nWho went with you?\n\nWhat important things did you see there?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 118,
            "text": "§ Writing Skills\n\nSample paragraph\n\nYou can begin your paragraph as follows.\n\nLast year, I visited Lake Hawassa\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 119,
            "text": "Unit\n\n), Horticulture\n\n4 Learning Outcomes )\n\nAt the end of this unit, learners are expected to:\nlisten to a variety of texts with medium level understanding\n\nand transfer information,\n\ninteract in English in varied communication situations\nwith comprehensible grammar,\n\nrealize the importance of horticulture for balanced diet,\n\nrecommend the use of horticulture in their surroundings,\n\nread medium level reading resources and comprehend\n\ncontents,\nguess meanings of words using context clues,\nform words using suffixes,\nextend their vocabulary using phrasal verbs,\nuse conditional sentences types 2 and 3,\nconstruct conditional types 2 and 3 sentences,\nparticipate in conversational practices, and\n\npractice report writing.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 120,
            "text": "§Listening skills\n\nERE Listening skills\nEthiopia: Diversifying Export\nEarners via Horticulture Sector\nCompetitiveness\n\nEthiopia rose urban agriculture in Addis Ababa\n\nActivity 5.1 Before you listen to the listening\ntext, look at the pictures above\nand answer\n\nthe following\n\nquestions in\n\nWhat do you know about agriculture?\n\nDo you know the names of vegetables shown above?\n\nDiscuss with your partner.\n\nDo you have experience in agriculture? Share your\n\nexperience with your partner, if you have, about the\n\nagricultural sectors stated below you or your parents\n\ninvolved..\n\ngardening/horticulture\n\nanimal farming\n\nbeekeeping,\n\ncrop farming\n\ncash crop farming\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 121,
            "text": "eo B\n\nNn\n\n§Listening skills\n\nActivity 5.2 Listen to the teacher’s reading o\nthe recorded audio and fillin th\n\nblank spaces in the sentences\nbelow.\n\nThe higher management of the Ministry of Agriculture\nand other stakeholders recently held discussion on\nthe horticulture investment.\nEthiopia has a great opportunity for horticulture\n\ndevelopment due to the favorable ;\n\n, and\n\nOne of the major focus areas of the recent discussion was\nthe huge potential in the sector and\n\nthe performance so far.\n\nFloriculture and the expanding vegetable, and\nsubsectors contributed 79 and 21 percent\n\nof the export revenue respectively.\n\nThe government has also facilitated from\nthe Development Bank of Ethiopia.\n\nActivity 5.3 Answer the following questions.\n\nDiscuss with your partner why Ethiopia becomes one of\n\nthe investors’ destinations for horticulture.\n\nWhat advantages and disadvantages do think horticulture\ndoes have in Ethiopia? write 2 to 3 sentences for each. 3.\n\nShare your sentences with your partner and organise them\ninto a paragraph.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 122,
            "text": "§ Reading Skills\n\nActivity 5.4 Before you read the passage,\nanswer the following questions.\nDiscuss your answers with you\npartner.\n\nWhat do feel about the gardens shown in the unity\npark above? What advantages you get from gardening\n\nexperience? Discuss with your partner.\n\nDo you have vegetable gardens in your or friend’s home?\n\nHow do you take care of them? Discuss with your partner\n\nHealth Benefits of Gardening\n\n1. The act of gardening goes back to thousands of years. If\ngardens are beautiful to look at, imagine the pride and sense\n\nof accomplishment that the creator of such beauty can feel.\n\n2. Numerous studies have been undertaken which show that\ngardening offers many health related benefits. The most\nobvious benefit of gardening is that it can be a great way\nto relieve stress. Work, family commitments, and social\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 123,
            "text": "§ Reading Skills\n\nengagements are just some of the things that take up chunks\nof peoples’ lives. Planting the garden and then caring for the\ngarden offers the gardener a simple and inexpensive way\nto unwind and relax. Gardening can help a person clear the\n\nmind.\n\n. Another health related benefit of gardening is that when\npeople do their gardens, they are getting exercise. Even\nan activity as simple as gardening can contribute towards\nweight loss. Gardening gets a person outdoors, exposed to\n\nnatural air, and refocused on a pleasant activity.\n\n. Gardening also offers nutritional benefits to those who\nchoose to plant a vegetable garden. Creating a vegetable\ngarden is a way of ensuring that there is a continuous\nsupply of fresh vegetables to consume. Vegetable gardeners\nknow exactly where their produce is coming from and they\nalso know exactly what chemicals were used to grow the\nproduce. Eating more vegetables, and especially home-\ngrown vegetables, is a simple way to ensure that a body is\n\ngetting a proper balance of vitamins and nutrients.\n\n. And finally, some studies even report that people who are\nexposed to gardens and gardening recover more quickly\nfrom illnesses. It seems that for many people, gardening is\n\njust what the doctor ordered.\n\n. Gardening can be a creative experience as well. It’s one\nthing to throw some seeds down and then wait to see what\ngrows. While gardening does not require that the participant\nhave a degree in landscape architecture, a bit of planning\nwill go a long way towards enhancing the beauty and the\n\ngardening experience overall.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 124,
            "text": "§ Reading Skills\n\n7. And finally, the act of gardening teaches people the art of\nbeing patient. Unlike other activities, gardening does not\nproduce instantaneous results. As such, a person who takes\n\nup gardening must wait for their rewards. Cut the flowers\nand vegetables, bring them inside and enjoy the sense of\naccomplishment that is gained from the benefit-rich activity\n\ncalled gardening!\n\nAdapted from The Fresh Reads: https://www.thefreshreads.com\n\noe f ctivity 5.5 Read the passage carefully ana\nanswer the following questions\n\nWhat is the most obvious benefit of gardening?\nAccording to the passage, what does a gardener do?\nWhat do vegetable gardeners know?\nThere are four benefits of gardening stated in the reading\npassage. Mention at least three.\nA.\nB.\nC.\nD.\nHow does a bit of planning skill help the gardening\nactivity?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 125,
            "text": "§ Vocabulary Development\n\nVocabulary Development\n\n5.3.1 Vocabulary taken from the reading passage\n\nActivity 5.6 Based on their contexts used in\nthe reading passage, find th\n\nmeanings of the following\nwords.\n\nrelieve (paragraph 2, line 4)\n\nunwind (paragraph 2, line 8)\n\ncontribute (paragraph 3, line 3)\n\nconsume(paragraph 4, line 4)\n\nenhancing (paragraph 6, line 5)\n\n6. | instantaneous (paragraph 7, line 3)\n\n5.3.2. Pre-fixes\n\nActivity 5.7 Find the meanings of the following\nprefixes and give three examples\n\nfor each using a dictionary or\nthe internet. One is done as\nan example.\n\nExamples\n\n1] ex-means out. E. g., extra, ex-ray, extension,\n@ mis\n3 pre\n4 ) re\n(5 sub\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 126,
            "text": "§Grammar\n\nEPA crammar\n\nSecond Conditional & Third\nConditional Sentences\n\nIn Unit 4, you were introduced with the zero conditional and\nconditional sentences type I. Do you remember these examples?\nExamples\n\n1) [fit is cold, I put on a coat.\n\n@ We will stay at home if it snows.\nWhat do you call the conditional type in example 1? Yes, we call\nthat type the zero conditional that is used to express facts. The\nsecond sentence shows a probable condition. In this Unit, you will\nlearn the different conditional sentences called second conditional\n\nand third conditional sentences.\nExamples\n\n1) We would stay at home if it snowed.\n\n@ If I were you / would accept the offer.\n\n3 | If Ihadn’t arrived in time, I wouldn’t have gotten the bus.\nCompare the tense forms and the meanings of these sentences\n\nwith those you studied in Unit 4. A summary note is given to you\nin the Table below.\n\nmain clause If-clause meaning\nput on Is The actions are facts/general truths\nProbable conditions/ likely conditions to\nwill stay SNOWS\nhappen\nwould stay snowed Improbable conditions\nwould accept | were Impossible conditions\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 127,
            "text": "eB e\n\nnn\n\n§Grammar\n\nhadn’t wouldn’t ;\nActions that were not done\n\nbeen have gotten\n\n5.4.1 Second Conditional Sentences\n\nSecond conditional sentences have the verb forms simple past in the\nif-clause and conditional (would/ should/ could/ might + infinitive)\nin the main clause. Such sentences show possible but very unlikely\nactions to be fulfilled.\nExamples\n@ If 7 found her address, I would send her an invitation.\n\n@) You would pass the examination if you studied hard.\n\nActivity 5.8 Complete the Conditiona\n\nSentences (Type ID) by putting\nthe verbs into the correct form.\n\nIf I (be) rich, my life (change) completely.\n\nI (invite) all my friends if (have) a\nhouse by the beach.\n\nIf we (have) a boat, we (sail) Lake\nHawassa.\n\nIf they (tell) their father, he (be) _—_—_—srveery angry.\n\nWe (help) you if we (know) how.\nMy brother (buy) a sports shoes if he\n(have) the money.\n\n5.4.2 Third Conditional Sentences\n\nA third conditional sentence has past perfect verb form in the if-\nclause and would/ could/ should/ might +have+ past participle\n(modal perfect tense) in the main clause. Such conditional sentences\nindicate that the actions have impossible conditions to be fulfilled.\n\nThey refer to actions that were not completed in the past.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 128,
            "text": "$§Grammar\n\nExamples\n@ If Thad found her address, I would have sent her an invitation.\n\n@) You would have passed the examination if you had studied.\n\nActivity 5.9 Complete _ the\n\nSentences (Type IID) by putting\nthe verbs into the correct form.\n\nIf you (study) for the test, you (pass) it.\n\nIf you (ask) me, I (help) you.\nIf you (speak) English, she (understand)\nI (write) you a postcard if I (have)\nyour address.\nIf it (not/ start) to rain, we (walk)\nto the museum.\n6. | If she (take) the bus, she (not/arrive) __ on time.\n\nAdapted from https://brainly.in/question\n\nActivity 5.10C omplete the following sentences\n\nIf you choose the wrong plants for your garden,\nIf I had money,\nIf you decided to stay here in Harar,\nIf she had bought the ticket,\n\nIf , the plants may not need fertilizer.\n6. | If , you would be good at English.\nIf , he might have won the tournament.\n8. | If , Show would have bought a car\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 129,
            "text": "§Grammar\n\nActivity 5.11 Complete the sentences using\n\nthe suitable form of the verbs\ngiven in brackets.\n\nIf I (have) wings, I (have to, not)\ntake an airplane to fly home.\nThis letter has got to be in Arba Minch in two days. I’m\n\nsure if I (send) it today, it will arrive in time.\n\nHundreds of people became ill from eating contaminated\nmeat during the last two weeks. If the kebele had\nresponded more quickly to the crisis, fewer people (suffer)\n\nfrom food poisoning.\n\n(People, be) able to fly if they (have)\nfeathers instead of hair?\nWhat (we, use) to look at ourselves when we\n\ncomb our hair in the morning if we (have, not)\nmirrors?\n6. | A: I don’t understand anything in this class. It’s boring.\nAnd I’m getting a failing grade.\nB: If I (feel) the way you did, I (drop)\nthe class as soon as possible.\nIt’s been a long drought. It hasn’t rained for over a month.\n\nIf it (rain, not) soon, a lot of crops (die)\n. If the crops (die) , many\npeople (starve) this coming winter.\nIf anyone else (bring) extra guests to dinner,\nwe (have, not) enough seats at the table.\n9. | If television (introduce) to Ethiopia\n\nin the eighteenth century, King Theodros (interview)\n\nregularly on the evening news.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 130,
            "text": "§Grammar\n\nA: I’m exhausted, and we’re no closer to a solution to\nthis problem after nine hours of work.\nB: Go home and get some sleep, and I’ll keep working. If I\n\n(discover) a solution before morning, I (call)\n\nyou immediately.\nA: I can’t believe that you haven’t finished that report.\n\nWhat will I use in the committee meeting at noon\n\ntoday?\nB: I’m really sorry. If I (know) you would need it today,\nI (stay up) all night last night and (finish) it.\n\nAdapted from GrammarBank.com, 2013\n\nActivity 5.12 Match the clauses in Column A\n\nwith Column B.\n\nColumn A Column B\n\n1. Ifshe were not always so late, | A. you will be very healthy.\n2. If I had enough money, B. she would have passed the\n3. Ifyou send this letter now, exam.\n4. Ifyou eat an apple every day, | ©. we would travel the world.\n5. Ifshe had studied, D. I would buy a big house.\n6. If we won the lottery, E. we wouldn’t have missed the\n7. IfI miss the bus, bus.\n8. If you hadn’t been late, F. I take a taxi.\n9. IfI am late for class, G. my teacher gets angry.\n\nH. she would be promoted.\n\nI. she will receive it\n\ntomorrow.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 131,
            "text": "eo B\n\nnn\n\n§ Speaking Skills\n\nSpeaking Skills\n\n5.5.1 Speaking activity based on the reading passage in\nthe Unit\n\nDo you have a gardening experience or have you heard about\ngardening?\n\nActivity 5.13 Look at the following dialogue\nand play the roles of Mamo\n\nand Deressa in turns. Then,\nprepare your own dialogue on\ngardening with partner.\n\nDialogue on gardening experience\n\nMamo: Is there any garden that you like?\n\nDeressa: Yes, I love ‘Gesho’ garden in my neighborhood.\nMamo: Where is it?\n\nDeressa: Its in my grandmother 8 village.\n\nMamo: When did you first see it?\n\nDeressa: I accidentally saw it when I visited my grandmother.\n\nMamo: Why do you like the garden?\n\nDeressa: I love cutting ‘Gesho’. The garden brings me closer to\nnature as well.\n\nMamo: What is special about the garden?\n\nDeressa: Gesho is important for preparing home made a drink\ncalled ‘Tella’ which is fresh and organic.\n\nMamo: Do you want to be a gardener?\n\nDeressa: Honestly, I cant be such a person.\n\nStudent A:\n\nStudent B:\n\nStudent A:\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 132,
            "text": "§ Speaking Skills\n\nStudent B:\nStudent A:\nStudent B:\nStudent A:\nStudent B:\nStudent A:\nStudent B:\nStudent A:\nStudent B:\n\n5.5.2 Conversation on food items\n\nActivity 5.14 Based on the picture above ana\nthe questions in column ‘A’ ana\n‘B’ below, make a conversation\nwith your partner. The first\nquestion is done for you.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 133,
            "text": "§ Speaking Skills\n\nStudent ‘A’\n\nStudent ‘B’\n\n. What do you usually eat for\nbreakfast?\n\n. What’s your favorite food?\n\nHow often do you eat it?\n\n. What kinds of food do you\nknow how to cook? Are you a\ngood cook?\n\n. Give some examples of\n“healthy food”. Do you think\nyou eat enough healthy food?\n. What do you want to eat after\nclass?\n\n. What is the strangest food you\nhave ever eaten?\n\n. Would you like to be a farmer\nand grow food? Why?/Why\nnot?\n\n. Do you think tea and coffee\nare good for you? Why? / Why\nnot?\n\n. What do you usually eat for\n\nlunch?\n\n. What’s your favorite drink?\n\nHow often do you drink it?\n\n- Do you like shopping? Why?/\n\nWhy not?\n\n. What do you want to drink\n\nafter class? 6. Are you hungry\nnow? Why?/Why not?\n\n. What are some famous foods in\n\nyour community? Do you like\n\nthem? Describe them.\n\n. Would you like to work in a\n\nrestaurant? Why? Why not?\n\n. Do you like spicy food? Why?/\n\nWhy not?\n\n. What kind of food you do you\n\nhave for holidays like a New\nYear?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 134,
            "text": "§ Writing Skills\n\nExample\nStudent A: What do you usually eat for breakfast?\nStudent B: I usually eat bread with tea. But, I like to have eggs\nsometimes.\nStudent A:\nStudent B:\nStudent A:\nStudent B:\nStudent A:\nStudent B:\nStudent A:\nStudent B:\n\nRA Writing Skills\nx\n\nActivity 5.15 Write a paragraph that discusses\nthe importance of horticulture\ndevelopment in Ethiopia. You\nparagraph must answer th\n\nWhat kind of horticulture products are produced mostly in\nyour community?\n\nFor what purposes are the products of horticulture used by\nthe community?\n\nWhat problems does the horticulture production face?\n\nWhat does the government need to do for solving these\nproblems?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 135,
            "text": "§ Writing Skills\n\nSample paragraph\n\nIn my village, different kinds of gardening can be done such as flower\ngarden, vegetable garden and fruit garden. My favorite hobby is\ngardening. There is a small piece of land by the side of my reading room.\nI have made a flower garden in that land. There are different kinds of\nplants in my garden. These are rose, sunflower, cabbage etc. The flowers\nof the garden are of different sizes, colors and smells. Different kinds\n\nof flowers are bloomed in different seasons. There are many advantages\nof gardening. When a man sees different flowers, vegetables and fruits\nin his garden, his heart leaps up with joy. It helps him to forget sorrows\nand sufferings. It keeps our body and mind relaxes. It also relieves our\nmonotony. Therefore, I spend my leisure time in my garden. I feel much\npleasure working in the garden. My joys know no bound when my\nfriends and neighbors come to visit my garden. I think, gardening is a\n\nsource of health, wealth and pleasure.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 136,
            "text": "Unit\n\n6, Poverty in Ethiopia\n\nC Learning Outcomes )\n\nAt the end of this unit, learners are expected to:\n\nlisten to a variety of texts with medium level understanding\n\nand transfer information,\n\ninteract in English in varied communication situations\n\nwith comprehensible grammar,\n\nrealize the impact of poverty in Ethiopia,\n\nrecommend ways to alleviate the impacts of poverty in\nEthiopia,\n\nread medium level reading resources and comprehend\n\ncontents,\nguess meanings of words using context clues,\nform words using suffixes,\nextend their vocabulary using phrasal verbs,\nconstruct sentences using modal verbs,\nparticipate in conversational practices, and\n\nwrite descriptive paragraphs and essays about causes of\n\npoverty and solutions.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 137,
            "text": "§ Listening skills\n\n6.1\n\nActivity 6.1 Before you listen to the listening\ntext, look at the above picture\nand answer the _ following\nleading questions. Share you\nanswers to your partner.\n\nLook at the above picture and share your feeling with your\npartner?\n\nHow does poverty affect your life and the life of your\n\nWhat should be done to reduce poverty in Ethiopia?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 138,
            "text": "§ Listening skills\n\nActivity 6.2 Listen to the teacher’s reading o\n\nthe recorded audio and fill in\nthe blank spaces given below.\n\nPoverty has been a since times\nimmemorial.\nOn rainy days, they may bridges or any\n\nother indoor shelters.\n\nThis is compounded by and\npopulation of the country.\n\nSometimes, these individuals also resort to unfair means\nto obtain money such as ;\n\n>\n\n, and\n\nThis issue can be tackled with one stone — i.e, to provide\nand\n\n6. | How does poverty be eradicated, if not, minimized?\n\nActivity 6.3 Listen to the teacher’s reading or\n\nthe recorded audio and fill in\nthe blank spaces given below.\n\nWith your partner, discuss the impact of poverty in\nEthiopia.\n\nWrite four to five sentences about the causes and effects of\npoverty in Ethiopia.\n\nShare your sentences with your partner and write a\n\nparagraph that discusses the causes and effects poverty in\n\nEthiopia.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 139,
            "text": "§ Reading Skills\n\nReading Skills\n\nNy ABR 4 a \\\naul, ~ . 4 Dany }\n\ng reo j ™ | ne\n\n~\n\nMigrating people\n\nActivity 6.4 Before you read the passage, loo\nat the above picture and answe\nthe following questions. Discuss\n\nour answers with your partner,\n\nDo you know people living abroad?\nWhy do you think some people like to go to America,\nEurope or the Arab World?\n\nStudy the meanings of the following words. They are\nimportant for you to understand the reading passage.\n\npoverty consequence slavery\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 140,
            "text": "§ Reading Skills\n\nActivity 6.5 Now, read the following passag\n\nand answer the questions that\n\nThe Impact of Poverty\n\n1. Not surprisingly, the consequences of poverty are often also\ncauses. The poor often experience inadequate healthcare,\nlimited education, and the inaccessibility of birth control. But\nthose born into these conditions are incredibly challenged\nin their efforts to break out since these consequences of\npoverty are also causes of poverty, perpetuating a cycle of\n\ndisadvantage.\n\n2. According to sociologists’ analysis of global inequality\nstudies, the consequences of poverty are many. They have\ndivided them into three areas. The first, termed “these\ndimension of global inequality,” relates to the fact that\nonce poverty becomes entrenched in an area, it is typically\nvery difficult to reverse. As mentioned above, poverty\nexists in a cycle where the consequences and causes are\nintertwined. The second consequence of poverty is its\neffect on physical and mental health. Poor people face\nphysical health challenges, including malnutrition and high\ninfant mortality rates. Mental health is also detrimentally\naffected by the emotional stresses of poverty, with relative\ndeprivation carrying the most robust effect. Again, as with\nthe ongoing inequality, the effects of poverty on mental\nand physical health become more entrenched as time goes\non. The third consequence of poverty is the prevalence of\ncrime. Cross-nationally, crime rates are higher, particularly\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 141,
            "text": "§ Reading Skills\n\nfor violent crime, in countries with higher levels of income\n\ninequality.\n\n3. While most of us are accustomed to thinking of slavery in\nterms of the antebellum South, modern day slavery goes\nhand-in-hand with global inequality. In short, slavery\nrefers to any situation in which people are sold, treated as\nproperty, or forced to work for little or no pay. Just as in the\npre-Civil War United States, these humans are at the mercy\nof their employers. Chattel slavery, the form of slavery once\npracticed in the American South, occurs when one person\nowns another as property. Child slavery, which may include\nchild prostitution, is a form of chattel slavery. In debt\nbondage, or bonded labor, the poor pledge themselves as\nservants in exchange for the cost of basic necessities like\ntransportation, room, and board. In this scenario, people are\npaid less than they are charged for room and board. When\ntravel is required, they can arrive in debt for their travel\nexpenses and be unable to work their way free, since their\nwages do not allow them to ever get ahead.\n\n4. The global watchdog group Anti-Slavery International\nrecognizes other forms of slavery: human trafficking (in\nwhich people are moved away from their communities and\nforced to work against their will), child domestic work and\nchild labor, and certain forms of servile marriage, in which\n\nwomen are little more than chattel slaves.\n\nNow answer the following questions.\n\nHow many poverty consequences are discussed in the\n\npassage? Mention them.\nWhat does ‘slavery’ refer to?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 142,
            "text": "§ Vocabulary Development\n\nHow many forms of slavery are discussed in the passage?\nDescribe each.\n\nAccording to the passage, differentiate the modern form of\nslavery with the historical one, before the American civil\nwat.\n\nAfter reading the passage, what do you feel about poverty?\nDo you think the writer exaggerate or lessen the impact\nof poverty? Discuss with partner and write two or more\nsentences about what the government of Ethiopia and the\npeople need to do for alleviating poverty.\n\nVocabulary Development\n\n6.3.1 Vocabulary from the reading passage\n\nActivity 6.6 Based on the contexts they are\nused in the reading passage, fina\n\nthe meanings of the following\n\nperpetuating (paragraph 1, line 6)\nentrenched (paragraph 2, line 5)\nreverse (paragraph 2, line 6)\nrobust(paragraph 2, line 13)\nprevalence (paragraph 2, line 16)\n6. | accustomed (paragraph 3, line 1)\n\nmercy(paragraph 3, line 6)\n\n8. | pledge (paragraph 3, line 11)\nwages (paragraph 3, line 17)\n\nrecognize (paragraph 4, line 2)\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 143,
            "text": "§ Vocabulary Development\n\n6.3.2 Suffixes —ate, -ise/ize, -ment, and —-tion\n\nAffixes which include prefixes and suffixes help develop words. As\nyou studied in the previous units, prefixes are word parts that are\nadded at the beginnings of the root words to form new words. They\nmodify the meanings of the words. Prefixes make words negative,\n\nindicate opinion or show repetition.\n\nExamples\nUnhappy The word is formed from the root word ‘happy’ and\nthe prefix ‘un’; and the meaning of the root word has\nchanged from positive to negative because of the prefix.\nDisorganized The word is formed from the root word ‘organize’,\nthe prefix ‘dis-’ and the suffix ‘-ed’. Similar\nto the above example, the prefix has\nformed a negative meaning to the word.\nSuffixes are word parts that are added at the ends of root words,\nand form new words which can be nouns, verb forms, adjectives\n\nand adverbs.\n\nExamples\nforgetful © The word is formed by adding the suffix ‘ful’ to the root\nword ‘forget’. In this example, we see how the verb\n‘forget’ is changed to an adjective, ‘forgetful’.\nhappiness The word is formed by adding the suffix ‘ness’ to the\nroot word ‘happy’. In this example, we see how the\nadjective ‘happy’ is changed to a noun, ‘happiness’.\nIn this Unit, you will be introduced with word formation using\nsuffixes. You will also be introduced with few phrasal verbs. The\n\nsuffixes you will study are —ate, -ise/ ize, -ment, and —tion.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 144,
            "text": "§ Vocabulary Development\n\nActivity 6.7 Read the following words and\nidentify the root words and\n\nthe suffixes in groups, and add\nwords of similar\n\naction affection capacitate memorize\n\ndifferentiate | capitalize measurement | punishment\n\nexcitement |amazement | dissatisfaction\n\ngeneralize prioritize\n\nHow did such a complicated situation ?\na) come across c) come apart\nb) come about d) come back\nWhile I was coming to school, I my old friend.\na) came down c) came apart\nb) came back d) came across\nThe police the road after the accident.\na) closed --- down c) closed --- off\nb) closed ---- up d) closed --- out\nMy mother the dishes and the plates after we\nhave dinned.\na) cleared up c) cleared away\nb) cleared off d) cleared on\nI need to get my glasses repaired. They _———s when they\nfell off the table.\na) came apart c) came down with\nb) came back d) clogged up\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 145,
            "text": "§ Grammar\n\nActivity 6.9 Match the phrasal verbs in th\nBox with the meanings given\n\nbelow. Consult your dictiona\nor their meanings.\n\nPhrasal verbs\n\nclear up come down come about\nclog up come across come apart\nclose down come back come down\nclose off\nMeanings\nfind by chance ___——_—5. separate into pieces\nsettle 6. return\nblock 7. stop\nhappen/ occur. __—s« 8. Sow Movement\n\n6.4, Grammar\n\nModals: Obligation, Prohibition and\nAbsence of Obligation (have to/ must/\ndon’t have to/ mustn’t)\n\nDo you remember the obligation markers you were introduced with\nin Unit 3? Do you remember the modal verbs such as can, could,\nmay, might, must, shall, should, ought to, will, and would, etc.?\n\nWe hope you remember the example sentences such as:\n\nStatements Negative sentences Questions\n\nYou can swim. I cannot swim. Can you swim?\n\nYou must leave. |He must not (mustn’t) leave. | Must he leave?\n\nYou should go. You should not (shouldn’t) Should he go?\ngo.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 146,
            "text": "§ Grammar\n\nNow you will learn few modal verbs that help you express\nobligations, prohibitions and absence of obligations. Let’s start\n\ndoing the activity that is based on the dialogue below.\n\nActivity 6.10 Read the following dialogue ana\nin your group underline verbs\n\nthat indicate prohibition o\nobligation\n\nProhibition and obligation\n\nAbebe: Shall we drive to the restaurant?\n\nHusien: We mustn t drive in this country unless we are over eighteen.\nSo, we cannot drive to the restaurant since both of us are\nonly sixteen.\n\nAbebe: Shall we walk then?\n\nHusien: No. We mustnt do that; our class time is approaching. We\nmustn t miss classes\n\nAbebe: Shall we go after class?\n\nHusien: Yes, if we get enough time, we can go. But, we have to give\npriority to our lessons.\n\nAbebe: I don’t agree more; we must learn first.\n\nHusien: Thank you. Abebe, we dont have to worry about getting\nleisure time; we have to give time to our homework and\nother activities the teacher gives us. Ok?\n\nAbebe: Ok. It’s a good idea.\n\nHow many of the verbs did you underline correctly? The modal\nverbs used in the dialogue are must, mustn’t, have to, and don’t\nhave to. The modal verbs have to, must, dont have to, and mustn t\nare common verbs you use to express obligation or prohibition and\nabsence of obligation. Have you ever used them while you speak\nand write in English? To learn about the differences among the\nmodal verbs, study the short notes given about each of them in the\n\nbox below.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 147,
            "text": "§ Grammar\n\nProhibiti Absence of\n- og, rohibition\nObligation indicators obligation\nindicators -\nindicators\nMust Mustn’t don’t/doesn’t\nMust is used when the obligation Mustn’t have to\ncomes from the person who is is used to or\nspeaking. show an don’t/doesn’t\nExamples obligation | need to\nYou must do your homework every not to do These verbs\nnight. (Because I say you must!) something. are used when\nI must participate in community Examples _| there is no\nservices; that is to help the poor. You mustn’t | Obligation.\n(Because I think it’s a good idea) play Examples\nHave to/has to here; it’s You don’t\n! .\nDifferent from the use of must, have to/ dangerous! have to bring\nhas to is used when the obligation roots food on the\nfrom general law, but not from the Mitslal is | trip.\nspeaker’s view. allergic to | oho goesn’t\nExamples nuts; so she have to\n; mustn’t eat kin th\nEveryone has to pay tax to his/her work in the\npeanuts. .\nWe have to respect the elders. You don’t\nWe have to vote in an election. need to pay\nNeed to now; you can\n. . ay later.\nNeed to is used to talk about what is pay\nnecessary. They don’t\nneed to speak\nExamples . P\n. French in\nYou need to have your hair cut. _\ntheir job.\n\nWe need to respect the traffic rules.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 148,
            "text": "§ Grammar\n\nDf ctivity 6.11 Choose and underline the correct\nverb for the following sentences\n\nYou (don’t have to/ mustn’t) come to the meeting but it\nwould help us all if you’re there.\n\nI can’t get a connection on my phone. (Have to/ Can) I\nborrow yours?\n\nThe rules say that you (have to/ can) only invite one guest\nto the club.\n\nI (must/ have to) stay on for a few hours because I’d rather\nwork late today than over the weekend.\n\nThere’s a lot of noise coming from outside. (Could/ Must)\nI close the window?\n\n6. You (have to/ can) start saving money if you want to retire\nearly.\n\nDid they tell you that you (can’t/ don’t have to) come into\nthis area. It’s restricted to staff only.\n\n8. We (have to/ can) be there fifteen minutes before the\nconcert starts.\n\n19. People (mustn’t/ don’t have to) drink and drive cars. It is\nprohibited.\n\nI (must/ have to) study tonight; my exam is tomorrow.\n\nActivity 6.12 Based on the following examples\nand the examples in the Table,\ncomplete the missing parts with\n‘have to’, ‘must’ and ‘mustn't\nand the subjects of the sentences\n\nou develop.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 149,
            "text": "§ Grammar\n\nExamples\n1) Teachers have to give feedback to students’ work.\n\n@) Farmers must use selected seeds for more productivity.\n\n3 | Students must do their homework every day.\n\n4 | Students have to walk carefully when they cross roads.\n\n5 | Every student must take his/her left side of the road when he/ she\n\nwalks along the road.\n\n6) You mustn’t use your phone in class.\n\nA teacher A farmer A student\n1. He/She has tobe | 1. He has to wake up | 1. He/She has to work\nsupportive. very early. in a team.\n2. __ (not be late 2. (work hard 2. (wear\nfor work) every day) uniform)\n3. (well prepared) |3.___ (fit) 3. (behave)\n4. 4._____— (work inthe|4.__ (help his/her\n(knowledgeable) countryside) parents at home)\n5.__(inaclassroom) |5.__ (work with 5. (read books)\nplants &animals)\n\nActivity 6.13 Fill in the blank spaces in th\npassage about football given\n\nbelow with either ‘must not’ o\n\n‘need not’.\nThe teams (1) have more than 11 players on the\nfield during a match. But there (2) even be 11\nplayers playing for each team. Players (3) wear anything\n\nwhich might injure another player. Players (4)\n\nplay the ball with their feet only; they can use their head and body,\nbut not their hands. Substituted players (5) return\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 150,
            "text": "§ Speaking Skills\n\nto the game. Players (6) leave the game without the\nreferee’s permission. Players (7) hold or catch\nan opponent. The referee (8) send a player off if\n\nhe has committed a foul for the first time in the game.\n\nNote: If you want to say something is unnecessary, use need not,\n\nnot must not. (The negation of must means not allowed to.)\n\nExample:\nI need not play football = I do not have to play football\n\nI must not play football = I am not allowed to play football.\n\nSpeaking Skills\n\nAster Manaye (2021) has reported the extreme poverty rate in East African\ncountries in 2020 and 2021. The summary of her report is presented in the\nTable below.\n\nExtreme poverty rate in East African countries 2020-2021\n\nCountry 2020 2021\nBurundi 72.2% 72.9%\nSomalia 63% 62.9%\nEritrea 44.1% 43.4%\nRwanda 42.3% 40.5%\nUganda 35.4% 34.5%\nTanzania 35.1% 33.9%\nKenya 27.3% 26.3%\nEthiopia 17.3% 15.9%\nComoros 12.8% 12.4%\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 151,
            "text": "§ Speaking Skills\n\nActivity 6.14 Based on the information in the\ntable above, explain the extreme\n\npoverty rate in East African\ncountries in groups and suggest\nsolution to the problems.\n\nBegin your discussion as:\n\nAs the Table shows nearly 73 percent of people in Burundi ....It was\n\n-+ On the other hand, Comoros and Ethiopia ....\n\nrespectively.\n\nActivity 6.15 In your groups, discuss and\ncomplete the missing parts in\nthe following short story by\nusing the words ‘have to’ and\n‘must’. Use the correct forms of\nthe words in brackets.\n\nTwo businessmen, Hagos and Debella, are at a lunch meeting. They\n\nare waiting for their co-worker, Zeleke, who is late.\n\n“We must wait for Zeleke before we start,” says Hagos. “Is\nhe here yet?”\n\n“No, he (be) on his way,” replies Debella.\n\n“Yes, he said he left the office 30 minutes ago,” says\nZeleke. “He (be) “about to arrive.”\n\n“Traffic (be) bad, because it usually doesn t take\nthis long,’”’ Debella says.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 152,
            "text": "§ Writing Skills\n\nZeleke looks at his watch. “He (feel) late,”\nbadly about being late,” he says. “I know he hates to be\nkept waiting, so he doesn’t like to do it to other people.”\n\n“Oh, that’s all right! We (get) impatient, dont you\nthink?” Debella smiles. “Remember his rule: the one who\nis late (buy) lunch!”\n\na Writing Skills\n\nActivity 6.16 Write three sentences discussing\nsome mechanisms of alleviating\npovertyintheworld. Thesentence\nparts are given below. Complete\n\neach sentence and organize the\ncompleted sentences into a short\nparagraph that deals with some\nways of alleviating poverty in\nthe world.\nPeople could tackle poverty through\nWe can reduce poverty by\nOne of the poverty reduction mechanisms is\n\nThe paragraph\n\nThere are three ways of reducing poverty in the world.\n\nTherefore, people should\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 153,
            "text": "§ Writing Skills\n\n6.6.1 Paragraph writing\n\nActivity 6.17 Write a short paragraph about\nhow hard work and other factors\n\ncan help get rid of poverty in\nEthiopia.\n\nWays that help Ethiopia get rid of its poverty\n\n- hard work\n\nincreasing access to education\n- increased agricultural activities\n\nimproving food security\n- cooperative work\n\nensuring access to clean water\n\n- taking care of the environment - end war and conflict\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 154,
            "text": "Unit\n\n/, Communitity Services\n\nC Learning Outcomes )\n\nAt the end of this unit, learners are expected to:\n\nlisten to a variety of texts with medium level understanding\n\nand transfer information,\n\ninteract in English in varied communication situations\nwith comprehensible grammar,\n\nrealize the importance of community services,\n\nread medium level reading resources and comprehend\ncontents,\n\nguess meanings of words using context clues,\nextend their vocabulary using phrasal verbs,\nunderstand how relative clauses are formed,\n\nconstruct sentences using relative clauses,\n\nparticipate in conversational practices on social problems\nof Ethiopia, and\n\nwrite desriptive or expository essays.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 155,
            "text": "§Listening skills: Community Services\n\nPBU Listening skills: Community Services\n\nCommunity engagement activities\n\nWhat do people do in the pictures above? Share your ideas\nwith your partner?\n\nWhat do you know about community services?\nHave you participated in free service activities?\n\nWhat skills do you think a voluntary worker should have?\n\nWhat kind of benefits do you expect from such free\n\nservices?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 156,
            "text": "§Listening skills: Community Services\n\nActivity 7.2 Listen to your teacher’s reading\n\nor a recorded audio and fill in\nthe blank spaces below.\n\nThere was a section on the community which contained a\nlist of\n\nI called a number and decided to spend my time taking\n\ncare of shopping for an elderly\n\nhandicapped woman.\n\nThe and\n\nI gained was more valuable to me than any amount of\n\nmoney I could have earned.\n\nEven more significant is and\n\nof community service in our society.\n\nIn conclusion, I believe that choosing to help your\ncommunity through should be very\n\nimportant to you.\n\n6. | What kind of values does community service provide us\nwith?\n\nActivity 7.3 Answer the following questions.\n\nDiscuss with your partner about the important and\n\nchallernges of community services.\n\nWrite a paragraph on the challenges and opportunities of\ndelivering a community service.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 157,
            "text": "eo B\n\n“\n\n§ Reading Skills\n\nReading Skills\n\nCommunity service\n\nActivity 7.4 Before you read the passage, loo\nat the above picture and answe\n\nthe following questions. Discuss\nour answers in\n\nHave you ever been engaged in community service\n\nactivities so far?\nWhat have you done as a community service provider?\n\nWhat do you expect from the passage entitled ‘Community\n\nService Experience’?\n\nCommunity Service Experience\n\n1. My community service experience was a very interesting\nexperience because I had to work with elderly people at\nFelege Gion Hospital. The Hospital is located at the city of\nBahir Dar and is dedicated to providing the highest quality\nof medical care in a homelike environment. This supportive\natmosphere is created by the hospital’s dedicated team of\nhealthcare professionals, who are devoted to helping each\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 158,
            "text": "§ Reading Skills\n\nindividual regain health and strength while respecting\n\nindividuality, dignity and autonomy.\n\n2. My duties were taking care of the elderly, answering phones\nwith proper greeting, and filing reports and certain patient\n\ninformation. From often time to time, they moved me from\nfloor to floor where as I dealt with different people every\nday. Every day I came in with a good positive attitude. I\nprepared their meals and gave them their daily supplies.\n\n3. They also showed me the parts to the hospital, they taught\nme the little things that I can learn how to do now such as,\nWheel and Lock a Wheelchair, Take Patients in and out of\nthere wheelchair, etc. Every day I spent in the hospital I\nlearned something new I learned what community service\nreally is. I have learned responsibilities that it is not easy to\ndo as to what the nurses do on the regular, and trust me their\njob is not easy. I truly now know the value of community\n\nservice, which is providing a service to the community.\n\n4. This type of service gives me a chance to gain working\nexperience, so that I can develop and improve on my\nworking skills, something I lack. I am also able to build\non my self-confidence. Community service gives me the\nopportunity to learn more about myself and my abilities.\nDoing community service makes me feel complete because\nI’m doing something that is meaningful to my community\nwhere I live. In conclusion, I truly believe that doing\ncommunity service, is not only doing God’s work, but given\nback to the community and helping someone less fortunate\nthan me. Working with the elderly, is not easy at all it took\ntime and patience. You have to be patient and encourage\n\nthem that there is a way and God can make it happen. I love\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 159,
            "text": "Ce — Oe — |\n\n“\n\n§ Vocabulary Development\n\nto see the smiles on their little faces every day because this\ngave me a feeling that I was doing something right not just\nfor my community but for myself. Doing this community\n\nservice, I felt like I bettered myself in so many ways.\n\nAdapted from gudwriter.com\n\nActivity 7.5 Read the passage carefully ana\n\nWho created a supportive atmosphere in the hospital?\n\nWrite the activities in which the community worker is\ninvolved in the hospital.\n\nState at least three benefits the community worker got\nbecause of involving in the community service activities.\n\n‘They’ in paragraph 3, line 1 refers to\n\nWhat advice did the community worker give us for\n\nparticipating in the community service?\n\nVocabulary Development\n\nActivity 7.6 Based on their contexts used in\nthe reading passage, find th\n\nmeanings of the following\nwords given below.\n\ndedicated (paragraph 1, line 4)\n\ndevoted (paragraph 1, line 7)\n\ncomplete (paragraph 4, line 6)\n\nfortunate (paragraph 4, line 10)\n\nbettered (paragraph 4, line 17)\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 160,
            "text": "§ Vocabulary Development\n\nActivity 7.7 Complete the missing parts in th\nfollowing dialogues selecting\nfrom the given phrasal verbs.\nTry to get the meanings of th\nphrasal verbs with your partner.\n\nIf you feel that you haven’\ngotten the meanings of th\nphrasal verbs from the contexts\nthey are used in, you need to\nconsult your dictionary.\n\ndrop in drop off drop out\nHanna: I for a few minutes during the final act. How\ndid the music end up?\nDanayit: I can’t believe you could during such\nspectacular music!\nHanna: I was drowsy. I’ve been working long hours lately.\nFikirte: It’s so hard to work and go to school at the same time.\n\nMy parents never finished school, and they’ve become\npretty successful with their business.\n\nZelekash: You’re a year away from graduating. Don’t\n\nnow.\n\nAli: You’re from Bishoftu? That’s great!\n\nMohammed: No kidding! Feel free to next time you’re in\ntown.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 161,
            "text": ": § Grammar\n\ni\n\nt\n\n7 Activity 7.8 Match the phrasal verbs in bold in\n\ncolumn A with their meanings\nin Colum B.\n\nColumn A Column B\n. dry something\n1 | I had a shower and dried myself off. A full\ny\n\nI think we are close to where Aster lives,\n2 | do you think we should drop in and see B_ | finish eating\n\nhow she is going?\n\n. ; ; dry something\n3 | They dried the fruit out in the sun. C ;\nquickly\n\nI can assure you that if you drop out of\n4 / ; D | leave\nschool now, you will regret it later.\n\nEat up your dinner, and we’ll go for a .\n5 Ik E | stop and visit\nwalk.\n\nGrammar\n\nGiving additional information about\nthings or people using relative\nclauses (adjectival Clauses)\n\nDo you know what relative clauses are? Can you combine the\nfollowing sentences using which, that, whom, or who?\n\na) The girl is my classmate.\n\nb) You were talking to the girl.\n\na The girl whom you were talking to is my classmate.\n\na) The horse is expensive.\n\nb) Iam pointing at the horse.\n\nm The horse which/ that I am pointing at is expensive.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 162,
            "text": "§ Grammar\n\nThe italicized parts of the combined sentences are called relative\n\n(adjectival) clauses the nouns ‘the girls’ and ‘the horse’.\nNote\n\nRelative clauses are formed with the relative pronouns who, that,\n\nwhich, whose, where, when, and are most often used to define or\n\nidentify the noun that precedes them.\n\nIn the following dialogue, which is about different inventors, there\n\nare relative clauses. Single out the relative clauses in the dialogue\n\nwith your partner and write your answers. The first one is done for\n\nyou.\n\nEyosias:\n\nNataniym:\n\nEyosias:\n\nNataniym:\n\nEyosias:\n\nYonas:\"\n\nEyosias:\n\nYonas:\n\nWhat are you reading, Nataniym?\n\nI am reading a book about Thomas Edison who I admire.\n\nHe invented the light bulb which greatly influenced the\n\nworld. This can be our group report about the people who\n\nwe admire.\n\nToo bad! He’s not the singer that I admire.\n\nThomas Edison is the greatest and first person that I\nadmire. How about you, Rahel?\n\nI admire Thomas Edison, too. He never gave up or stopped\n\nhis tests. After his team failed about 10,000 times, he\n\ncheered up the team. What’s your idea about Thomas\n\nEdison, Yonas?\n\nIn fact, I admire Steve Jobs who made iPhone and iPad\n\nso popular. I like to do the report about him. Who do you\n\nadmire, Eyosias?\n\nI admire Edwin Howard Armstrong whose radios helped\n\nthe world a lot.\n\nRadios are not popular anymore, but iPhone and iPad are!\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 163,
            "text": "Ce — Oe — |\n\n“\n\n§ Grammar\n\nRahel: Hey, guys! Before we go on talking about these important\ninventors, let’s face our problems, or we can never finish\nour report. Eyosias, what’s your idea?\n\nEyosias: How about Alfred Nobel? He made the dynamite and\nestablished Nobel Prize. We can talk a lot of different\nscientists or people who won Nobel Prize in one report.\n\nNataniym: I give up! We can never finish our report this way.\n\nActivity 7.9 Select the appropriate relative\npronoun and fill in the blank\n\nspaces in the _ following\nsentences.\n\nwho whom | that which where when whose\n\nI live in Ethiopia, is a relatively densely\npopulated country.\n\nYesterday, I ran into an old friend I hadn’t seen\nfor years.\n\nThat’s the man house was destroyed by a tornado.\n\nThat’s the drawer I keep my jewelry.\n\nThe people _ house I am staying at are very kind to me.\n\n6. | Here is the place my grandfather always used to\ntalk about.\n\nThe car he bought last Thursday was very cheap.\n\n8. | We don’t have a big enough room in we can\napply sample tests.\n\n9. | The woman husband is a football player always\ncomplains about the stains never come off easily.\n\nThe severe drought occurred last summer ruined\nthe crop.\n\n(Adapted from GrammarBank.com, 2013)\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 164,
            "text": "§ Grammar\n\nActivity 7.10 Match the sentence parts in\n\nColumn A with the relative\nclauses in Column B.\n\nColumn A\n\nColumn B\n\nZelalem lives in a\n\n1 | house which serves fresh food\n2  |Awatch is a machine who landed on the moon.\nwhich is about the earth\n3 This is the book pollution.\nThere are a few which is used for sewing\n4 _| restaurants here clothes.\nSheep are the\n5 animals which give us milk and wool.\n6 |A fridge is a machine which is famous for its Castles.\nAn airplane is a\n7 | vehicle which tells the time.\nA dolphin is an which is used for opening tins\n8 animal and cans.\nMrs. Senait is a that is over hundreds of years\n9 | teacher old.\n10 | Gondar is the city who loves her students so much.\n11 | A tin-opener is a tool which helps people into the sea.\nA sewing machine is\n12 |amachine which flies in the air.\nNeil Armstrong is the\n13 | first man which keeps food fresh.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 165,
            "text": "eo B\n\n“\n\n§ Grammar\n\nHave you noticed the linking words of the two clauses in the above\nactivities? The linking words include who, whom, whose, that,\nwhich, what, when, where, and why. These linking words that form\n\nthe relative clauses are called relative pronouns.\n\nRelative clauses are classified into defining and non-defining relative\nclauses. The defining relative clauses are clauses that provide\nessential information about the thing or the person that it describes.\nFor instance, you may have many sisters and if you produce the\nstatement My sister who works in Hawassa University was awarded\na prize, your listeners may not understand you which of your sisters\nyou are referring to. The relative clause which you have added as\nwho works in Hawassa University clearly distinguishes which of\nyour sisters you have referred to. This kind of relative clause that\ndetermines the noun is called defining relative clause. You should\nnot use commas with defining relative clauses. Please read example\nsentences 1-5 below. The non-defining relative clauses, on the\nother hand, are clauses that provide information about the things or\nthe persons described in the sentence, but the information does not\ndetermine the things or the persons they describe. For example, in\nsentences like My father, who is over 60, still works on the farm, it\nis clear that you have only one father; therefore, the relative clause\nwho is over 60 is not essential to tell us about your father although\nit adds some information about your father’s age. Non-defining\nclauses are set-off by commas to indicate that the clause is not\ndeterminant of the noun used. Read the examples 6-10 below for\n\nmore understanding.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 166,
            "text": "§ Grammar\n\n7.4.1 Relative pronouns used in defining relative clauses\n\nSubject Object Possessive\nFor people | who whom/ who whose\nwhat that\nFor things | which which whose\nthat of which\n\nExamples\n\n@ This is the picture which/that caused such a sensation.\n@) The car which/that I hired broke down.\n3 | The ladder on which I was standing began to slip.\n\nC4 | The year when (in which) he was born was a time of natural\n\ndisasters.\n\n5 ) The hotel where (in/at which) they were staying was not much\n\nconvenient.\n\n7.4.2 Relative pronouns used in non-defining relative\n\nclauses\nSubject Object Possessive\nFor people | who whom/ who whose\nFor things | which which/that whose\nExamples\n\n1) Fentahun, whom everyone suspected, turned out to be innocent.\n\n@ Dilnesa, for whom I was working, was very generous about\n\novertime payments.\n3 | Emebet, whose children are at school all day, is trying to get a job.\n4 ) These books, which you can get at any bookshop, will give you all\n\nthe information you need.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 167,
            "text": "em B\n\n“\n\n§ Grammar\n\nActivity 7.11 Join each of the pairs of sentences\ninto one forming defining or\n\nnon-defining relative clauses.\nThe first two are done for you.\n\nThe man was late. Duressa invited the man.\nThe man whom Duressa invited was late.\n\nThe couple lives next to us. Their daughter has two\ncharming boys.\nThe couple, whose daughter has two charming boys, lives next\nto us.\n\nThe doctor was sick. I wanted to see the doctor.\n\nThe accountant was arrested. The accountant works for my\nfather’s company.\n\nThe mobile phone can’t be fixed. The mobile phone is\nbroken.\n\n6. | John made a copy of the photo. I took the photo.\n\nI met a girl. The girl was a doctor.\n\n8. | We talked about the party. Sarah wants to organize it for\nmy birthday.\n\n9. | This is the house. I had my first party here.\n\nAdapted from www.english-practice.at & www.perfect-english-\n\ngrammarcom\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 168,
            "text": "7.5.1 Speaking activity related to the reading passage\n\nActivity 7.12 Do you believe in helping you\ncommunity? The following\ntable lists some areas you\ncan participate in communi\n\nservices and benefits you coula\nobtain. In groups, discuss which\nareas you would like to involve\nin and why? Add more areas\nand reasons for participating\n\nActivities benefits /reasons to involve\n\nCleaning sewages | mental satisfaction, clean environment\nTutoring children | person satisfaction, changing life of the generation\n\nPlanting trees personal satisfaction, sharing skills\n\nExample\n\nm | would like to involve in serving my community through community\nmobilization programmes for peace and cooperation because it gives\nme sense of satisfaction.\n\n7.5.2 Discussion related to social problems in Ethiopia\n\nActivity 7.13 Discuss in detail about th\nenvironmental, health,\nand educational problems\n\nin Ethiopia based on\ninformation given in the Table.\nAnswer also the following\nquestions in your discussion.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 169,
            "text": "em B\n\n“\n\n§ Writing Skills\n\nWhich of the problems is/are the most serious problem/s?\nWhat should people do to solve the problems?\nWhat roles can you play to solve the problems?\n\nEnvironmental Health Social Education\nproblems problems problems problems\n- soil erosion - deadly HIV/  |- lack of basic |- quality\nand land AIDS, needs - budget for\ndegradation, - malaria, - education, education\n- deforestation |- bacterial and |- safe and - drop-out rate\nand forest protozoal healthy (out-of-school\ndegradation, diarrhea, environment | youth)\n- water scarcity, | - typhoid fever, - lack of facilities\n- biodiversity - hepatitis A, - teacher\nloss shortage in\npublic schools.\n\nWriting Skills\n\n7.6.1 Writing activity related to the reading passage.\n\nActivity 7.14 In the reading lesson, you got\ninformation about communi\nservice. Now give answers to\n\nthe following questions with\ncomplete sentences. Then,\ndevelop the sentences into a\nparagraph.\n\nWhat is a community service?\n\nWhat is the purpose of community service program?\nWhat are the benefits of community service programs?\nWhat are the duties of a community service worker?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 170,
            "text": "§ Writing Skills\n\n7.6.2 Writing essays\n\nActivity 7.15 Write an essay about the basi\nneeds of life in Ethiopia\nconcerning the issues includea\nin the diagram. Focus\n\nBasic\n\nneeds in\n\nEthiopia\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 171,
            "text": "em B\n\n“\n\n§ Writing Skills\n\nActivity 7.16 Discuss the causes of lana\ndegradation and provid\npossible solutions in groups.\n\nThen, write individually about\nthe causes and solutions fo\nland degradation. A sampl\nparagraph is given to you.\n\nIn your discussion and writing, include answers to:\n\nHow do the factors affect land degradation?\n\nWhat are the effects of land degradation?\n\nTo what extent, do you think, the national tree plantation\n\nprograms in Ethiopia solve the problem of degradation and\nits effects?\n\nCauses for land degradation Solutions to the\nproblems\n* population growth family planning\n\n* intensive land use\n\ntoo much plowing\n\n* overgrazing\n\ndeforestation\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 172,
            "text": "§ Writing Skills\n\nSample essay\n\nRead the following essay, and develop similar kind of essay of your\nown about the basic needs of the people and land degradation.\n\nDeveloping countries and problems they face\n\nThere are basic needs which developing countries lack in part or in total.\nThe basic needs include food, water, housing, health, education and work.\nFood is a basic need because food helps people grow and develop. It gives\nus energy to keep us health and work. Without the right amount of food or\nthe right kinds of food, people suffer from malnutrition which can result in\ndeath. At least one in eight of the world’s population does not have enough\nto eat. Water, clean, safe drinking water is essential for life. It is vital for\nthe control of diseases such as diarrhea, typhoid and cholera. About 80%\ndiseases are from dirty, unsafe drinking water.\n\nHousing is a major problem, which can affect the developing countries\nbecause more and more people in developing countries are drawn to cities\nin search of work and a better life. The cities getting overcrowded and the\nsupply of affordable housing in the cities does not match the population\ngrowth so there is a serious of lack of houses, so in developing countries\nthere are nearly more than half of the population living in shanty towns.\nHealth care is important to ‘ensure a state of complete physical, mental\nand social well-being and not merely the absence of disease or illness.\n70% of the population in developing countries does not have access to any\norganized health care.\n\nEducation is another problem in poor countries. There are only four adults in\nten who can read and write and less than one in four children go to secondary\nschool. Education 1s a very important basic to the development of a nation.\nTo solve the problems of basic needs, people in developing countries\n\nshould work hard cooperatively to ensure their basic needs are satisfied.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 173,
            "text": "= 8. Communicable Diseases\n\n4 Learning Outcomes )\n\nAt the end of this unit, learners are expected to:\n\nlisten to a variety of texts with medium level understanding\nand transfer information,\n\ninteract in English in varied communication situations\nwith comprehensible grammar,\n\ntalk about communicable diseases,\n\ndescribe the characteristics of communicable diseases,\n\nread medium level reading resources and comprehend\n\ncontents,\nguess meanings of words using context clues,\nextend their vocabulary using phrasal verbs,\n\nunderstand the forms and functions of present perfect and\npresent perfect continuous tenses,\n\nconstruct sentences using present perfect and present\nperfect continuous tenses,\n\napply conditional type 3 sentences for conversational\npractices (purpose), and\n\nwrite descriptive or expository essays.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 174,
            "text": "§ Listening Skills\n\n8.1\n\nIllness\nActivity 8.1 Before you listen to the listening\ntext, lookatthe above pictureand\n\nanswer the following questions.\nDiscuss your answers with your\n\nFW what is wrong with the person in the picture ? Share your ideas\nwith your partner.\n\nWhat are the deadly diseases you know?\n\n3 How do you think diseases are transmitted from one person\nto another?\n\nActivity 8.2 Listen to your teacher’s reading\n\nor a recorded audio and fill in\nthe blank spaces below.\nJ) Epidemiologists work to prevent or minimize of\n\ndiseases in the population.\n\nEpidemiologists act as “detectives” who track down the\n\ncauses of a “new” and transmission.\nInfectious diseases may be transmitted through or\ncontact.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 175,
            "text": "§ Reading Skills\n\nDirect contact occurs when an individual is infected by\ncontact with the reservoir, for example, by\n\na\n\nor being bitten by an infected animal or insect.\nThe modes of horizontal transmission are examples of\n\ninfectious diseases that transmit from\n\nin a group.\n\n‘Activity 8.3 Answer the following questions.\n\nDiscuss with your partner the types of diseases you have\ncommonly experienced or which are prevalent in the\ncommunity you live in.\n\nWrite a paragraph on the major causes of HIV/AIDS and\n\nCovid19 and their prevention mechanisms.\n\nReading Skills\n\nActivity 8.4 Before you read the passage,\n\nanswer the following questions.\nDiscuss your answers in groups.\n\nHave you ever got a health problem? What kind of disease\nwas it?\n\nDiscuss different types of diseases and their transmission\n\nmechanisms.\n\nWhy do you think people face a health problem?\n\nStudy the following words. They are important for\nunderstanding the reading passage.\n\npredict mortality infections treatment\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 176,
            "text": "§ Reading Skills\n\nHIV/AIDS\n\n1. Within the next 25 years, AIDS is set to join heart diseases and\nstroke as the top three causes of death worldwide. Currently\nranked fourth behind heart diseases, stroke and respiratory\n\ninfections, AIDS is set to become No.3. It accounts for about\n2.8 million deaths every year. But researchers estimate a\ntotal of nearly 120 million people who could die in the next\n25 years. Overall, researchers predict that in the next three\ndecades, the causes of global mortality will be strikingly\nsimilar worldwide—apart from the prevalence of AIDS in\npoorer countries. Most people will be dying at an older age\nof non-infectious diseases like cardiovascular diseases,\n\nstroke and cancer.\n\n2. The World Health Organization estimates that a total of\nat least 117 million people will die from AIDS from 2006\nto 2030. In an optimistic future projection, if new HIV\ninfections are curbed and access to life-prolonging anti-\nretroviral is increased, 89 million people will die from the\n\ndisease.\n\n3. “What happens in the future depends very much on what\nthe international community does now,” said Mathers, who\nis a doctor. These marked differences should spark changes\nin current approaches to controlling AIDS now, say some\n\nexperts.\n\n4. “It will be increasingly hard to sustain treatment programmes\nunless we can turn off the tap of new HIV infections,”\nsaid Richard Hays. “These AIDS numbers point to a need\nto do more in prevention.” Simply focusing on treatment\n\nor politically uncontroversial prevention methods will\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 177,
            "text": "§ Reading Skills\n\nnot suffice. “You can’t put all your eggs in the abstinence\nbasket,” said Hays.\n\n. “We need a menu of strategies for real people,” he said,\nadding that condom distribution as well as new methods,\n\nsuch as a vaccine, are needed.\n\n. Mathers and Loncar analysed data from more than 100\ncountries. The authors looked at the links between mortality\ntrends and income per capita, as well as factors including\neducation levels and tobacco use. Their research also used\nUN estimates for projected AIDS infection rates and the\nWorld Bank’s numbers for future income per capita. They\npredicted the future causes of deaths and diseases.\n\n. “This is an important contribution that will help us determine\nthe priorities in public health,” said Majid Ezzati, a doctor\nand an associate professor of international health at Harvard\nUniversity, who was not connected to the paper. While it may\nbe possible to avert some of the impending damage from\nHIV/AIDS, Mathers says that other predictions are unlikely\nto vary significantly. As populations age, he explains, they\nare naturally more susceptible to illnesses like cancer and\nheart diseases than infectious diseases-even in the developing\nworld. Life expectancy is expected to increase worldwide,\nwith the highest projected life expectancy in 2030 to be in\n\nJapanese women at 88.5 years.\n\nAdapted from EAT: The Associated Press, Nov. 28,2006\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 178,
            "text": "§ Reading Skills\n\nActivity 8.5 Read the passage carefully ana\ndecide whether each of th\nstatements is ‘true’ or ‘false\n\nbased on the information in th\npassage. Give evidence to you\nanswers..\n\nWithin the next 25 years, HIV/AIDS will join heart\n\ndiseases and stroke as the top three causes of death\n\nworldwide.\n\nIn the next 25 years, a total of nearly 120 million people\nwill die of HIV/AIDS.\n\nSeveral people will be dying at an older age of infectious\ndiseases like stroke and cancer.\n\nAccording to the World Health Organization, around 117\nmillion people will die of HIV/AIDS within the coming 25\nyears.\n\nOur future will be determined very much by what the\ninternational community does today.\n\n6. | More condom distribution and new methods like vaccine\nfailed to minimize the spread of HIV/AIDS.\n\nThe more we are aged, the more we will be susceptible\nto illnesses like cancer and heart diseases than infectious\ndiseases even in the developing world.\n\n8. | Life expectancy will increase in some developing countries\nwith the highest projected life expectancy in 2030.\n\n9. | Researchers Mathers and Loncar used UN estimates for\nprojected HIV/AIDS infection rates and the World Bank’s\nnumbers for future income per capita.\n\nHeart diseases, stroke, respiratory infections and AIDS\n\nare the top four causes of death worldwide\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 179,
            "text": "§ Vocabulary Development\n\nActivity 8.6 Read the reading passag\n\ncarefully and give answers to\nthe following questions\n\nWhat does the writer mean by: ““What happens in the future\ndepends very much on what the international community\ndoes now’? (paragraph 3, line 1).\n\nWhy, in the next 30 years, does the global mortality rate\nbecome similar worldwide?\n\nWhat new methods did the writer suggest for the\nprevention of HIV/AIDS prevalence?\n\nWhy did the researchers (Mathers and Loncar) analyze\ndata from more than 100 countries?\n\nWhich country in the world is expected to reveal the\nhighest life expectancy by 2030?\n\nVocabulary Development\n\n8.3.1 Vocabulary from the reading text\n\nActivity 8.7 Based on their contexts used in\nthe reading passage, find th\n\nmeanings of the following\nwords given below\n\nestimate (paragraph 1, line 5 )\noptimistic ( paragraph 2, line 3 )\ncurbed (paragraph 2, line 4)\nspark (paragraph 3, line 3)\nsuffice (paragraph 4, line 6 )\n\n6. | avert (paragraph 7, line 5)\nsusceptible (paragraph 7, line 8)\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 180,
            "text": "§ Vocabulary Development\n\n8.3.2 Phrasal verbs\n\nActivity 8.8 Complete the following sentences\n\nchoosing from the phrasal verbs\ngiven below.\n\ncame through |came...on came in came out\n\ncame out comes off come up with\n\nCome over come down came across\n\nMaybe you should go to a doctor. This is the third time\nyou’ve with a cold this month.\n\nAster last in the race, but she enjoyed herself.\n\nTeferi_——_—s as ahard person, but in fact he is quite caring\n\nWorku as a hard person, but in fact he is\nquite caring.\n\nThe electricity back two hours after\nthe power cut.\n\n6. | The player’s past when his old friends spoke\nto the press.\n\nfor dinner tonight, we’re having a chicken stew.\n\n8. | Jack only after Senait begged him for three days\nto get the tickets for the game.\n\n9. | Desalegn a very good idea for the marketing\ncampaign.\n\nWhen I was cleaning my room, I my middle-\n\nschool diaries.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 181,
            "text": "§ Grammar\n\n8.4, Grammar\n\nPresent Perfect and Present Perfect\nContinuous Tenses\n\nHow are present perfect and present perfect continuous tenses\nformed? Read the excerpt in the Box, and identify the present\n\nperfect and present perfect continuous tenses.\n\nOur friend has disappeared. We have been looking for him day and\nnight, searching frantically in places where he is likely to be found. He\nis nowhere to be seen. Even his sister does not know where he is. He just\nran off like that, vanished like thin air. We are not surprised as a matter of\nfact. He has been feeding us with fat lies and the time of reckoning has\n\ncome. We all believe so.\n\nSince the day we made friendship with him, he has been taking us for a\nswim, to a café, or other recreation areas and makes us pay the expense.\nHe thought that we were foolish for being friends with him. He has been\ntaking our respect and loyalty for granted. He has never fulfilled any of\nhis friendship promises. Naturally, we got fed up with him. At first, we\nhave protested against him verbally, but he has refused to hear us. So\n\nwe have left him alone. Now, he has disappeared for good. I think he\n\nmight have psychological problem we were not aware of.\n\nActivity 8.9 Write down the verb tenses you\n\nified in the box above\n\n8.4.1 The Present Perfect Tense\n\nHow are the forms of the verbs different? The present perfect verbs\nhas appeared, has come, has fulfilled, have protested, has refused,\nhave left, and has disappeared are formed by having the ‘have\n\nverbs’ (has or have) and the past participles of verbs. ‘Have’ is used\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 182,
            "text": "§ Grammar\n\nas a helping (auxiliary) verb in ‘ have protested’ and ‘have left’,\nbut ‘has’ is used with all other present perfect verb tenses in the\nexcerpt. Note that ‘have’ is used when the subjects of the sentences\n\nor clauses are plural, while ‘has’ is used when the subjects are\n\nsingular. See more examples below.\nExamples\n\n@ The teacher has given us a test on Chapter 5.\n\n@) T have lived in Benshangul all my life.\n\n3 | I have taken care of communicable diseases.\n\n4 ) Communicable diseases have killed many people in the world.\n5 ) Zelalem has finished his studies.\n\nNow look at the Box and note how the present perfect is formed.\n\nSubjects Example sentences\n\nSingular | The teacher has finished her/ his / work/lessons/ studies.\nZelalem has finished his work/ his studies.\nShe has finished her work/ her studies\n\nHe has finished his work/ his studies.\nPlural Communicable diseases have killed many people in the\n\nworld.\n\nI have lived in Shashemene/in Goba/Dire Dawa/Makalle/\nAssosa/Metu/ Nekemte/ etc.\n\nThe students have taken the exam.\n\nThey have finished their work.\n\nYou have finished your work.\n\n1st I have taken the exam.\n\nperson | We have taken the exam.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 183,
            "text": "§ Grammar\n\nAll the above examples are positive in form. You can also form the\n\nnegative and question forms using the present perfect tense.\n\nNegative sentences\nExamples\n\n1) The teacher has not (hasn’t) given us a test on Chapter 5.\n@) Ihave not (haven’t) lived in Benshangul all my life.\n3 | Ihave not (haven’t) taken care of communicable diseases.\n\n4 | Communicable diseases have not (haven’t) killed many people in\nthe world.\n\n5 ) Zelalem has not (hasn’t) finished his studies.\n\nQuestions\nExamples\n1) Has (Hasn’t) the teacher given us a test on Chapter 5?\n\n@) Have (Haven’t) / lived in Benshangul all my life?\n3 | Have (Haven’t) / taken care of communicable diseases?\n\n4 ) Have (Haven’t) communicable diseases killed many people in the\nworld?\n\n5 | Has(Hasn’t) Zelalem finished his studies?\n\nWhen you form the present perfect tense, you have to carefully use\nthe past participle forms of verbs. Some of the verbs add ‘-d’ or ‘-\ned’ when they form their past participle; and such verbs are called\nregular verbs. However, verbs like, take, give, leave form their\npast participle form, as you see in the examples and the excerpt,\ndifferently. They are called irregular verbs. Now discuss in a\ngroup of four and write ten regular and irregular verbs, which you\n\nwill share to the whole class.\n\nThe most important point you should know is the meanings of\nsentences with present perfect tenses. Let’s learn the meaning of\n\nthe sentences from the following examples.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 184,
            "text": "§ Grammar\n\nExamples\n1) Ihave repaired my bicycle.\n\n@) She has eaten her breakfast.\n3 | They have finished their jobs.\n\nIn all the above sentences, the actions expressed by the verbs have\nrepaired, has eaten and have finished show that the actions were\ncompleted in the past, but you inform people now. As you see the\ntime when the actions were done is not expressed (told). Look at\nalso the following examples in which you can understand a different\nmeaning of sentences with the present perfect tense.\nExamples\n1) T have lived in Bahir Dar since 1959.\n\n@) She has learned English for six years.\n3 | The students have been in the Club since they joined secondary\n\nschool.\n\noO Covid-19 has expanded all over the world since a year ago.\n\nUnlike the above examples which indicate actions that were\ncompleted, these examples show that the actions began in the past\nand continue until the present time. For instance, the meaning of the\nfirst example is that J began living in Bahir Dar starting from 1959\nuntil now. The rest of the above examples have similar meanings.\nCan you tell the uses of ‘since’ and ‘for’ based on the above four\n\nexamples?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 185,
            "text": "§ Grammar\n\nActivity 8.10 Complete the following\nsentences changing the verbs in\n\nparenthesis into present perfect\ntense.\n\nThe weather (be) awful in the past few days.\n\nWe (wash) the dishes. They’re clean now.\n\n(your course, start) yet?\n\nShall we play tennis? We (not play) since we\nwere children.\n\nThe airplane (land). The pilot is just getting out.\n\n6. | Prices (go) up. Everything is more\nexpensive this year.\n\nI’m tired. We (walk) 10 kilo meters.\n\n8. | We (just come) back from our holidays.\n\n9. | You parcel (arrive). The postman\n(bring) it two hours ago.\n\nWe (not have) a party for ages.\n\nMy sister’s car is only a year old but she\n(already crash) it.\n\nIt (not rain) yet today.\n\n8.4.2 The Present Perfect Continuous Tense\nThe present perfect continuous tense is formed by using have (has)\n+ been + -ing forms of verbs.\nExamples\n\n1) The telephone has been ringing for a few minutes.\n@) It has been raining for a long time.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 186,
            "text": "§ Grammar\n\n3 | The students have been reading books in the library.\noO They have been working on the farm.\n\nThe positive, negative, and questions forms of the present perfect\n\ncontinuous tense are shown in the Table below.\n\nPositive Negative Question forms Meaning\nThe telephone | The telephone has | Has (Hasn’t) — | The present\nhas been not (hasn’t) been | the telephone perfect\n\nringing for a\n\nringing for a few\n\nbeen ringing\n\nfew minutes | minutes for a few\nminutes?\nIt has been It has not (hasn’t) | Has(Hasn’t) it\n\nraining for a\n\nlong time.\n\nbeen raining for a\n\nlong time.\n\nbeen raining\n\nfor a long time?\n\nThe students\n\nThe students have\n\nHave (Haven’t)\n\nhave been not (haven’t) the students\nreading been reading been reading\nbooks in the | books in the books in the\nlibrary. library. library?\n\nThey have They have not Have (Haven’t)\nbeen working | (haven’t) been they been\n\non the farm.\n\nworking on the\n\nfarm.\n\nworking on the\n\nfarm?\n\ncontinuous tense\nshows that the\nactions ringing,\nraining, reading,\nand working\nstarted in the past\nand is continuing\nat the present\ntime or unfinished\n\nactions.\n\nThe words for and since are commonly used with the present perfect\nand present perfect tenses. How are they used? Since is used to\nsituate an event in relation to a moment in time and for is used to\n\ntalk about a period of time. Take a look at the following examples.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 187,
            "text": "§ Grammar\n\nExamples\n1) That restaurant has been open since this morning.\n@) Fikrte has lived here since 2012.\n3 | It has been raining for a Jong time.\n4 | The telephone has been ringing for some time.\n\nActivity 8.11 Complete the paragraph with\nthe words in parentheses. Use\n\nthe present perfect or present\nperfect progressive. Add ‘not’\nwhere necessary.\n\n(1) Both Alemu and Silenat (plan) a daily menu. Alemu (2) (complete)\nthe online food science course yet because he was sick for two weeks.\n\nThe professor is letting him make up the final exam next week. He (3)\n(already/take) the course, so he (4) (help) Alemu study for the exam. (5)\n(already/turn in) his food safety paper. He (6) (work) hard on his food\nsafety paper, but he (7) (finish) it yet. (8) (plan) the food budget and\nthe menu for the holiday meal together for a few weeks. (9) (serve)\n\nthe holiday meal yet, but they plan to serve it next Thursday. Both\nhope to graduate in December.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 188,
            "text": "§ Grammar\n\nActivity 8.12 Write present perfect or present\n\nperfect continuous tense forms\nof the verbs in parentheses.\n\nA Lifelong Adventurer\n\nHelen Thayer never (1. let) age stop her. She and her husband, Bill,\nfulfilled a lifelong dream for their 40\" wedding anniversary. They\nwalked 2575 kilometers in intense heat across the Gobi Desert.\nThere they met Mongolian nomads and learned about their culture.\nTo celebrate 50 years of marriage, the Thayers walked almost\n1448 kilometers across the Sahara Desert to study the customs of\nthe people who live there. Now in her seventies, Thayer keeps on\nplanning trips for the future.\n\nThayer, born in New Zealand, (2. explore) the outdoors for most of\nher life. Since childhood, she (3. travel) widely in harsh climates\nand across rough lands. She (4. walk) to the North Pole with her\ndog as her only companion. She also (5. kayak) 3541 kilometers\ndown the Amazon, and (do) several mountain climbs. These trips\n(6. be) easy, but they (7. be) very satisfying.\n\nIn recent years, Thayer (talk) to groups around the world. She (8.\ncontinue) to travel and bring back stories to share with both children\nand adults. Thayer hopes to inspire people to follow their passions\nand fulfill their dreams. What is her advice? Set goals, plan for\n\nsuccess, and never give up.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 189,
            "text": "§ Speaking Skills\n\nSpeaking Skills\n\n8.5.1 Discussion on health issues\n\nActivity 8.13 Discuss the following questions\n\nHow many types of infectious diseases do you know?\nHow, do you think, they are transmitted from person to\nanother?\n\nWhat do you think people should do to prevent these\ndiseases? In pairs, practice arole play of adoctor anda\npatient. Improvise it further by adding your own ideas with\nthe help of the\n\ngiven expressions in the table.\n\nDialogue\n\nDoctor: | How do you feel in your stomach?\n\nPatient: My stomach is cramping and I’m very nauseous; I vomit\n\nwhen I eat or drink anything.\n\nDoctor: OK, I’m going to check your temperature and your\npulse. You may need an antibiotic if you have an\ninfection.\n\nPatient: | Would you please give me something for the pain, my\n\nwhole body is sore and my head is aching too.\n\nDoctor: Yes, I will prescribe something for the pain now.\n\nPatient: | Thank you.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 190,
            "text": "§ Speaking Skills\n\n. Doctor’s Questions and Answers to\nIlIness expressions\n\nPatient\n¢ feel ill, sick ¢ What’s the matter? Where’s the\n* have a temperature pain? What do you complain of?\n¢ haveapainin your back, |* Have you taken your temperature?\n\nchest, waist, arm, shoulder |* For how long have you been\n\n¢ have a headache feeling ill?\n¢ feel weak ¢ Take your clothes off. I’ll examine\n¢ feel dizzy you. Let me take your pulse,\n¢ suffer from stomach please.\ncramps ¢ [ll measure your blood pressure.\n¢ have a black eye ¢ Your blood pressure is rather high.\n* have a swollen, sprained Your blood pressure is too low.\nankle, wrist, foot ¢ Let me sound your back. Take a\n* (go to) see a doctor deep breath. I’1l check your lungs.\n* examine a patient * Have you been injured?\n* take, feel your pulse * Don’t worry. There’s no serious\n* take, measure your problem.\ntemperature ¢ [don’t think it’s too serious.\n\n¢ diagnose an illness, disease }* You’ve got to be vaccinated\n\n¢ diagnose a condition, against tetanus.\n\ndisorder * You must stay in bed and take this\n* prescribe medicine medicine three times a day, after\n* make up a prescription meals.\n\nSource: https://www.myenglishteacher.eu/blog/\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 191,
            "text": "§ Speaking Skills\n\n8.5.2 Identification and classification of diseases\n\nActivity 8.14 In groups, discuss the common\n\ndiseases in your local area ana\nanswer the following questions.\n\nWhich of the diseases is killing people most?\nWhat are the causes for the diseases?\nWhat measures should be taken to alleviate the causes?\n\n8.5.3 Speaking based on conditional sentence type 3\n\nActivity 8.15 You are given a short story below.\nBased on the story, ask questions\neach other and provide answers\n\nas in the examples given. Extena\nthe discussion by adding you\n\nown questions and answers\nrelated to the story.\n\nThe story\n\nMy friend called me last night. I was asleep at the time of the call. I still\nheard that my phone was ringing but I couldn’t get up and pick it up. In\nthe morning, when I woke up I saw that my friend was online. We started\n\nexchanging messages.\n\nExample questions and answers\n\nA: Why didn’t you return my call last night?\n\nB: Iwould have returned your call last night if I hadnt been asleep.\nA: Why did you go to bed so early?\n\nB: Iwouldnt have gone to bed so early if I hadnt been tired.\n\nA: What did you do to be tired?\n\nB: Iwouldnt have been tired if I hadnt been studying so much.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 192,
            "text": "§ Writing Skills\n\nA: Wow, why did you study so much?\n\nthe communicable diseases in\nyour surroundings.\nInclude the following points in\n\nThe communicable disease in your surroundings (e.g.\nDiarrhea),\n\nWho are affected more by the disease,\nSymptoms of the disease,\n\nCauses of the disease,\n\nPrevention mechanisms experienced,\n\n6. | Your recommendations about preventions, and treatments\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 193,
            "text": "§ Writing Skills\n\n=O) Faimess and Equity\n\nC Learning Outcomes )\n\nAt the end of this unit, learners are expected to:\n\nlisten to a variety of texts with medium level understanding\n\nand transfer information,\n\ninteract in English in varied communication situations\n\nwith comprehensible grammar,\nappraise unity in diversity in Ethiopia,\n\nread medium level reading resources and comprehend\n\ncontents,\nguess meanings of words using context clues,\nextend their vocabulary using phrasal verbs,\n\ncontrast the forms and functions of the present perfect and\nsimple past tenses,\n\nparticipate in conversation based on the ideas in the\n\nreading passage,\nintegrate ideas from the reading passage to writing, and\n\nwrite descriptive essays.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 194,
            "text": "§Listening Skills\n\nERE cistening Skills\n\nCultural Diversity, Human Rights\nand Democratic Governance\n\nCultural diversity\n\nActivity 9.1 Before you listen to the listening\ntext, look at the above picture\nand answer the following\n\nquestions individually, and\nshare your answers with your\n\nWhat do you see in the picture above? Share your ideas\nwith your friends.\n\nWhat do you know about cultural diversity, human rights\nand democracy?\n\nHow do you think cultural diversity, human rights and\ndemocracy can be practiced in Ethiopia effectively?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 195,
            "text": "§Listening Skills\n\nActivity 9.2 Listen to your teacher’s reading o\nrecorded audio about cultura\n\ndiversity, human rights ana\ndemocracy. Then, complete th\nblank spaces.\n\nAll rights and freedoms have a cultural dimension that\ncontributes to their\n\nIt is precisely this dimension that forms the link between\nthe individual, and\n\nHuman rights are universal because they\n\nall of humanity.\n\nAn enabler of dialogue and mutual enrichment include\n> , and\n\nDemocratic governance presupposes forms of government\nand modes of\n\nActivity 9.3 Answer the following questions.\n\nWhat does human rights constitute?\n\nWhat are the benefits of cultural diversity to the national\ndevelopment?\n\nWrite a paragraph about the importance and challenges of\nhuman rights and freedoms\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 196,
            "text": "Reading Skills\n\nyA Reading Skills\n\nActivity 9.4 Before you read the passage,\nanswer the following questions.\n\nShare your answers with you\npartner.\n\nWhat do you know about justice system?\nHow do you differentiate equality and equity?\n\nStudy the following words. They are important for you to\nunderstand the reading passage.\n\nverdict jury fair\n\nEquality, Equity and Justice\n\n1. Equality aims to ensure that everyone gets the same things in\norder to enjoy full, healthy lives. On the other hand, equity\ninvolves trying to understand and give people what they\nneed to enjoy healthy lives. Sometimes, these terms are used\nin an interchangeable manner, which leads to confusion. For\nexample, like equity, equality also aims to promote fairness\nand justice, but it can only work if everyone starts from\nthe same place and needs the same things. There exists a\nthin layer of similarity in purpose but different approach\nhas to be applied for fair results. One might think both are\npretty much the same but in actuality, they are very different\nconcepts that cannot be accurately explained by a simple\ndefinition. Justice is the collective responsibility of a free\nand just society, to ensure that civil and human rights are\npreserved and protected for each individual regardless of\n\ngender, race, ethnicity, nation of origin, sexual orientation,\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 197,
            "text": "Reading Skills\n\nclass, physical or mental ability, and age. It can be considered\nas a_scheme of law in which every person receives his/her\ndue from the system, including all rights, both natural and\n\nlegal.\n\nIt is good to understand the difference between equity\nand equality as it helps us to recognize and respond to the\ndifferences. Let us analyze it on the basis of few examples:\nShould per student funding at every school be exactly the same?\nIf we evaluate it, we find that it is the question under the\ndomain of Equality. Here, we make sure that all the students\nhave equal access to resources which is an important goal.\nAll the students should have the resources necessary for a\nhigh-quality education.\n\n. But if we go deeper, we see another question arising. That is,\n\nshould the students who come from less get more in order to ensure\nthat they can catch up? It is the question of equity where it is\nsensed that the students who are furthest behind (most often\nlow-income students and students of color) require more of\nthose resources to catch up, succeed, and eventually, close\nthe achievement gap.\n\n. And on the resulting ground, we come to a conclusion\n\nto these questions that giving the students who come to\nschool lagging academically (because of factors outside of\na school’s control) the exact same resources as students in\nhigher income schools alone will not close the achievement\ngap. But making sure that low-income students and students\nof color have access to exceptional teachers and that their\nschools have the funding to provide them with the kind of\nhigh-quality education they need to succeed will continue\nus on the path towards narrowing that gap.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 198,
            "text": "Reading Skills\n\n5. If we look at another example about the runners sprinting\naround an oval track during a competition, through this\nconcept of equality we should treat the runners in exactly\nthe same way, ensuring that they all start at the same place\n\non the track. On the surface, this seems fair. But we know\nthat runners in the inside lanes have a distinct advantage\nover runners in the outer lanes because the distance they\nhave to travel is shorter. As a result, equality — starting at\nthe same place — doesn’t result in fairness. The concept\nof equity, in contrast, would lead us to stagger the starting\npositions of the runners in order to offset the disadvantages\nfacing those in the outer lanes. In this case, different or\ntailored treatment is a surer path to fairness and justice than\nthe same treatment. John Rawls says justice is of central\nimportance in political practice and theory. In defending or\nopposing laws, public policies and administrative decisions\nof governments, appeals are made to notices of justice.\nJustice is also invoked in social and political movements,\ncivil- disobedience and opposition campaigns. Thus, the civil\nrights or civil liberties movements are essential movements\nfor justice. While a decent or good society or polity must\nhave several virtues, according to a widespread view justice\nis the first of them. But the real question is how many are\nfollowing the path of justice. We live in a materialistic\nworld, where ethics, laws and order etc. are less cared\nabout. Everything can be purchased with money even love\nand respect. People generally measure others on the scale\nof richness, “the richer a person is, the more will be his love and\nrespect in the society” and vice-versa. Confucius once said, “Jn\na country well governed, poverty is something to be ashamed of.\n\nIn a country badly governed, wealth is something to be ashamed\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 199,
            "text": "Reading Skills\n\nof”. People with lack of money suffer everywhere; they not\nonly struggle for their survival but also find it hard to earn\n\nrespect in the society. Being poor is a curse, people with no\n\nmoney end up doing low paid jobs with no bright future. We\ncan see examples of many domestic workers who work hard\nday and night in the same household throughout their life.\n\n. Justice, we see, manifests itself through the channels that\nsociety set up. Setting these channels involve laws that are\nset down by the founders and later rulers of the society. In\ntheory, this is done by a person or group of people selected\nby the community and with inputs from the community\nregarding what issues are important. In practice, though,\nlaws are often created by rulers without the input of the\npeople or without certain situations in mind. This is when\nthe principles of justice and fairness come in. Though there\nare a lot of ways but in many ways the best way to practice\nfairness and justice that has been found so far is the court\nsystem. For example: When a crime has been_allegedly\ncommitted under the law, the perpetrator is allowed a trial by\njury. The jury is constructed of people from the community\nwho have no interest or previous disposition in the case.\nThus, the jury is theoretically fair. The defendant and the\naccuser both have their chances to present their reasons for\nwhy a certain verdict should be given. It is not only the job\nof the jury to discern what events took place and whether\nthey are illegal, but also whether the law is justly applied\nto the current case. In theory, the jury (given true evidence)\nwill decide what is best for the community in the particular\n\ncase.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 200,
            "text": "Reading Skills\n\n7. To conclude, I quote Mahatma Gandhi:” peace will not come\nout of a clash of arms but out of justice lived and done by unarmed\nnations in the face of odds”. We are the ones responsible\nfor our world. Change from us can ultimately change our\nsocieties for better. We must advocate to the people about\n“equality, equity & justice, educate them about their rights\nand encourage them to treat others fairly, equally and nicely.\nThat is how we will end up creating a beautiful society for\nour future generations.\n\nAdapted from, Kumar, S. 2017: Equality, Equity and Justice\n\nActivity 9.5 Read the passage carefully ana\ndecide whether each of th\n\nstatements below is ‘true’ or\nfalse’ based on the information\nin the passage.\n\nUsing the terms equality and equity interchangeably could\ncreate confusion.\n\nJustice can be understood as a legal system, in which every\nperson receives his/her due from the system, including all\nrights.\n\nUsually laws are created by rulers without considering\ntheir people’s opinions or reflections.\nFor equity reasons, students who come from low social\n\nstatus must not get more resources than other students.\n\nEquality can be granted through creating equal access to\nresources to every individual regardless of race and social\n\nclass differences.\n6. | According to the writer, important values such as ethics,\n\nlaws and order are degraded and only money drives almost\neverything.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 201,
            "text": "Reading Skills\n\nThe best way to practice fairness and justice that has been\nfound so far is the court system.\n\n8. | The jury is responsible for identifying the type of event and\nits legality and the appropriateness of the law for the case.\n\n9. | Justice does not require social and political movements,\ncivil- disobedience and opposition campaigns.\n\nStable and peaceful society can be created through\nteaching the people about equity, equality and justice.\n\nActivity 9.6 Read the passage carefully ana\ngive answers with complete\n\nsentences to the following\nquestions.\n\nWhat kinds of movements are essential for justice?\n\nAccording to the passage, how do people measure others?\n\nTheoretically, what role does the jury have for the society?\n\nAccording to the passage, what makes the poor suffer\neverywhere in the world?\n\nAccording to the passage, how can we create a successful\nsociety?\n\n6. | The writer noted that in this material world where money\ngoverns most of the things maintaining justice becomes\ndifficult not impossible. Do you agree or disagree? Justify\n\nyour answers.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 202,
            "text": "Reading Skills\n\nYee Vocabulary Development\n\nActivity 9.7 Based on their contexts used in\nthe reading passage, find th\n\nmeanings of the following\nwords given below.\n\nA. Vocabulary taken from the reading passage\nscheme (paragraph 1, line 18)\nallegedly ( paragraph 6, line 12)\ndomain (paragraph 2, line 6)\npolity (paragraph 5, line 16)\ninvoked (paragraph 5, line 18)\n6. | sprinting (paragraph 5, line 1)\nstagger (paragraph 5, line 10)\ndiscern (paragraph 6, line 19)\n\n9. | curse (paragraph 5, line 34)\nperpetrator (paragraph 6, line 13)\n\nB. Phrasal Verbs\n\nActivity 9.8 Match the phrasal verbs in th\nsentences under Column A wit\n\nthe meanings in Column B.\n\nYou should count on yourself to improve\n\n1 : a | reduced\nyour English.\n\n5 Ayele, would you please count up the b deleted from\nnumber of tickets sold? list\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 203,
            "text": "§ Grammar\n\nThe police always crack down on drink-\n\n3 | driving offences over the Christmas c | depend on/rely\nperiod.\n\n4 She crossed him off her Christmas card d reduce/\nlist after they argued. consume less\n\nThe firm cut back production because ;\n5 e | made mistake\nsales were slow.\n\n6 I’m trying to cut down the amount of f use more\ncoffee I drink during the day. authority\n\ng | add\n\nh | ask\n\n9.4 Grammar\n\nSimple Past and Present Perfect\nTenses\n\nIn Unit 8, you were introduced with the present perfect tense.\nDiscuss the positive, negative and question forms of the present\nperfect tense and its forms with your partner. In this Unit, you\nwill learn about the form and functions of present perfect tense in\ncomparison with the simple past tense. As an introduction to the\n\ntenses, read the following dialogue.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 204,
            "text": "§ Grammar\n\nActivity 9.9 Read the following dialogue ana\nlook at how the present perfect\nand the simple past tenses are\n\nused in a partner’s e-mail. As\nand answer questions about\neach other’s passion.\n\nDialogue\n\nA: You've been playing the flute ever since you were a child. I\n\ndidn’t know that.\n\nB: Yeah. Pve always loved it.\n\nA: | Have you always wanted to play in an orchestra?\n\nB: No. At first, !wanted to be a music teacher.\nThe above short dialogue consists of simple past (were, didn’t know,\nwanted) and present perfect (have loved, have wanted) tenses used\n\nin positive, negative and question forms.\n\n9.4.1 Forms of the Simple past tense\n\nPositive sentences\n@ He played football with his friends.\n@ He cut his finger when he chopped the onion.\n3 They ate their dinner together.\n4 ) The student studied his lessons very well.\n\nThe verbs in bold in the examples are simple past tenses. Three of\nthe verbs (played, chopped and studied) are regular verbs, while\ntwo of them (cut and ate) are irregular verbs. You learned about\nregular and irregular verbs in Unit 8. Can you explain it to your\npartner?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 205,
            "text": "§ Grammar\n\nNegative sentences\n\nThe negative forms of simple past verbs are developed using the\n\nverb did+ not + the infinitive form of the verbs.\n\nExamples\n1) He did not (didn’t) play football with his friends.\n\n@) He did not (didn’t) cut his finger when he chopped the onion.\n3 | They did not (didn’t) eat their dinner together.\noO The student did not (didn’t) study his lessons very well.\n\nQuestions\n\nThe question form of the simple past tense is did (didn’t)+ subject+\n\nthe infinitive form of the verbs....\nExamples\n1) Did (Didn’t) he play football with his friends?\n@) Did (Didn’t) he cut his finger when he chopped the onion?\n3 ) Did (Didn’t) they eat their dinner together?\noO Did (Didn’t) the student study his lessons very well?\n\nSimple past verbs help us express actions which were done in the\npast. Therefore, all the actions in the examples given above indicate\n\nactions that were done in the past.\n\nActivity 9.10 Give the correct simple past forms\n\nof the verbs given in brackets in\nthe following sentences.\n\nI (1. finish) my work last night.\nWhen I (2. leave) school, I (3. cut) my hair ad (4. wear) it\n\nshort ever since.\n1 (5. enjoy) reading the book; it’s a nice story.\nDid you (6. do) your homework?\n1 (7. be) in the stadium when you (8.call) me.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 206,
            "text": "§ Grammar\n\nActivity 9.11 Change the sentences given into\n\ngative and question forms.\n\nHe wore his hair long when he was at school.\nNegative:\n\nQuestion:\nMy brother wrote several short stories.\nNegative:\n\nQuestion:\n\nHe smoked for two weeks. Now he is trying to give it up.\nNegative:\n\nQuestion:\nShe arrived with her mother yesterday.\nNegative:\n\nQuestion:\nZeberga read books when he was at school.\nNegative:\n\nQuestion:\n9.4.2 The Present Perfect Tense\n\nThe following dialogue consists of the different forms (positive,\nnegative and questions) of the present perfect tense. We have\nwritten the first two in bold for you. Can you identify the rest?\n\nDialogue\nRahel: Have you finished that report yet?\nMerhawit: No, I haven’t finished that report. I’m still\nworking on it. It should be ready by evening.\nRahel: Good. What about your presentation? Have you\nprepared for it?\nMerhawit: Yes, I’ve prepared for the presentation. I’ll make the\n\npresentation to morrow morning.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 207,
            "text": "§ Grammar\n\nRahel: Have you shown the draft to the manger?\nMerhawit: Yes, I’ve shown it to him. He is impressed with what I’ve\ndone.\nRahel: I’m glad that you are well-prepared for the presentation.\nAll the best!\nMerhawit: Thank you.\n\nFor you to remember the forms of the present perfect tense, read the\n\nsentences in the Table below.\n\nForms of the Present Perfect Tense\n\nPositive Negative Question\n\n1. Ihave studied hard. | 1. I haven’t studied 1. Have I studied\n\nhard. hard?\n2. She has played 2. She hasn’t played 2. Has she played\nvolleyball. volleyball. volleyball?\n3. They have come 3. They haven’t come | 3. Have they\nback. back. come back?\n\nSo far, you have learned about the present perfect and simple past\ntenses. The two tenses have differences. What are the differences\nbetween the present perfect and simple past tenses? In the following\nTable, the differences between the two tenses are presented. Read\neach of the differences carefully, and try to learn more from the\n\nexamples given.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 208,
            "text": "§ Grammar\n\nPresent Perfect Past Simple\n\nUnfinished actions that started . ;\n; Finished actions\nin the past and continue to the\n\npresent e I knew Julie for ten years (but\n\nthen she moved away and we\ne I’ve known Julie for ten\n\n: lost touch).\nyears (and I still know her).\nShows a finished action Shows a finished action\n* My brother has been to e My great-grandmother went to\nAsmara three times. Asmara three times.\n\nA finished action with a result in | A finished action with no result in\n\nthe present the present\ne I’ve lost my keys! (The e I lost my keys yesterday. It was\nresult is that I can’t get into terrible! (Now there is no result.\nmy house now). I got new keys yesterday).\n\nWith an unfinished time phrase _ | With a finished time phrase (last\n(this week, this month, today) week, last month, yesterday)\n\ne I’ve seen John this week. e I saw John last week.\n\nActivity 9.12 Use the present perfect o\nsimple past forms of the words\n\nin parentheses to complete th\ninterview.\n\nSara: How long (1) have you been (you/be) a snake\ncatcher, Yalemwork?\n\nYalemwork: (2) (I/have) this job for over ten years.\n\nSara: When (3) (you/become) interested in snakes?\n\nYalemwork: | When (4) (I/be) a kid, and (5) (snakes / fascinate) me\never since then. When (6) (I/be) in middle school, (7)\n(I/not read) much about any other subject. During my\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 209,
            "text": "§ Grammar\n\nhigh school years, (8) (I/ often/volunteer) at the local\nzoo, and then in college (9) (I/major) in her\npetology—the study of reptiles.\nSara: And after college (10) (you/ spend) a few years in Thailand.\nIsn’t that right?\nYalemwork: Yes, I was working with Thai snake experts. (11) (I/\nreally enjoy) my time with them.\nSara: (12)(you /ever/ experience) any life-threatening\nsituations since you started working with snakes?\nYalemwork:: (13) (/ work) with many poisonous snakes\nover the years, but (14) (only one / bite) me. That\nwas scary! Since that time, (15) (I/ pay more\n\nattention) to the snakes’ behavior.\n\nSara: Why do you love your job?\nYalemwork: (/6) Because (I/ be) able to live my childhood\ndream.\n\nActivity 9.13 Read Tefera’s diary and complete\nwith the verbs in brackets into\n\nthe simple past or the present\nperfect tense.\n\nYesterday my grandfather (1. tell) me about his adventures\nand then I (2. learn) a lot of things about him. He\n\n(3. travel) to different cities since 1960. He (4. already /\nvisit) Assela and Goba. He and my father (5. know) Metu\nin 1973. They (6. already/be) to Semera for a month,\ntoo. Exciting! I (7. not see) such nice places yet. Last year,\nmy mother (8. want) to go on holidays to different regions\nof the country but my father (9. have) an accident in\nMay, so finally we (10. cannot) leave. But my grandmother\n\n(11. just come) back from a short trip to the south.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 210,
            "text": "§ Speaking Skills\n\nActivity 9.14 Choose the correct answer that\nbest completes the sentence.\n\nWhere last month?\n\na) did he go b) he went c) has he gone\nyou ever a wild tiger?\n\na) Have ------- seenb) Did.----- seen c) Did ------ see\nI have studied English five years.\n\na) already b) since c) for\nShe has waited for you four o’clock.\n\na) since b) ever c) for\nThey haven’t studied for the exam\n\na) yet b) already c) just\n\noS Speaking Skills\n\nActivity 9.15 In the following Table, th\ncauses, effects and ways of\n\npreventing discrimination are\ngiven. Discuss in groups basea\non the notes given to you.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 211,
            "text": "§ Speaking Skills\n\n- age, unequal societies |- Respect cultural and\n\n- disability, experience racial differences in\n\n- ethnicity, - social, schools, workplaces and\n\n- origin, - environmental, communal activities\n\n- political - economic, - Be good in conduct and\nbelief, - cultural, speech,\n\n- race, - unity, problems |- Refuse to initiate,\n\n- religion, participate, or condone\n\n- sex or discrimination and\ngender, harassment,\n\n- language, - Avoid race-based or\n\n- culture culturally offensive talks,\n\nhumor or stories\n\nActivity 9.16 In Ethiopia, there is a strong\nbelief (and policy is also\ndeveloped) that there shoula\nnot be any  educationa\ndiscrimination among citizens.\nDiscuss with your partner ho\ndiscriminations associated with\nthe issues raised below are\nprevented or can be preventea\nin the country.\n\n- ethnicity, - race\n\n- nationality - economic condition\n\n- age - disability and religion\n- gender,\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 212,
            "text": "§ Speaking Skills\n\nActivity 9.17 In groups, choose any three hints\ngiven and ask questions each\nother in turns, and respond\nusing present perfect tense to\n\ndevelop a story. The first one,\nalthough it can be extended\nmore, is done for you as an\nexample.\n\n(travel you had)\n\n. Where have you traveled?\n\n. Lhave travelled to Gondar?\n\n. Why have you gone to Gondar?\n\nGOW >\n\n.I have gone to Gondar to visit the historical\nCastles?\nHave you had any information about the\nCastles?\n\nYes, I have been informed by a friend.\n\nm\n\nm\n\nG. What special things has your friend visited in\nthe Castle?\nH. He has visited the ingenuous crafts of our\npeople in buildings.\nI.\n(sports you play)\n(a place you have been)\n(interesting food you have eaten)\n\n(The greatest person whom you have met)\n\n6. | (the length of time you have studied English and your\nability in English)\n\n(The most exciting think you have done this week)\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 213,
            "text": "§ Writing Skills\n\na Writing Skills\n\n9.6.1 Extended writing activity to the reading passage\n\nActivity 9.18 Write a paragraph based on\nthe answers you give to th\n\nfollowing questions. Make sure\nthat the sentences are connectea\nlogically and coherently.\n\nHow do you define cultural diversity?\n\nWhat benefits can people get being aware of cultural\ndiversity?\n\nWhat challenges or disadvantages do you face from\ncultural diversity?\n\n9.6.2 Descriptive essay using the present perfect tense\n\nActivity 9.19 The following paragraph is a\nShort story developed using\npresent perfect tense. Following\n\nthe example paragraph, you\nwill develop your own paralle\nparagraph based on_ th\n\ninformation given to you.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 214,
            "text": "§ Writing Skills\n\nao oe\nMerhawit has just walked outside with her grandmother. She wears\n\nan apron. So far, she has finished cleaning and washing. She has\nalso gathered seeds and crumbs. Now Merhawit and Grandmother\nare outside. Merhawit has just dropped some seeds on the ground to\nfeed the birds. The birds have not come yet. Recently, Grandmother\nhas moved in with Merhawit’s family. She now enjoys living with\nthem. Grandmother has already sat down on the bench. She also\n\nwears an apron. She has just finished cooking.\n\nAdapted from www.really-learn-english.com\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 215,
            "text": "§ Writing Skills\n\nInformation\n\nmw Jemila lives in Semera (Afar Region)\n\nHer grandchildren live in Dire Dawa\n\nHer grandchildren lived in Dire Dawa for three years\n\nJemila and her grandchildren did not meet for three years\nThey talk on the phone\n\nThey email each other\n\nThey share pictures\n\nJemila knits scarves and blankets to send to her grandchildren\nShe has knitted two large blankets and a scarf\n\nActivity 9.20 Write a descriptive essay about\n\nyour community (i.e. in you\nhometown or village)\n\nEveryone belongs to many different communities and/or groups\ndefined by (among other things) shared geography, religion,\nethnicity, income, cuisine, and others. Choose one of the\ncommunities to which you belong, and describe that community\n\nand your place within it.\n\nAdd the following points in your essay as an example.\n\nDescription of where your community is,\n\nHow many people there are (approximate),\nLivelihood,\n\nReligion and ethnicity,\n\nNatural and/or man-made heritages available, and\n\n6. | Others.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 216,
            "text": "§ Writing Skills\n\nUnit\n\nL(), The Internet\n\nC Learning Outcomes )\n\nAt the end of this unit, learners are expected to:\n\nlisten to a variety of texts with medium level understanding\n\nand transfer information,\n\ninteract in English in varied communication situations\nwith comprehensible grammar,\n\ncreate awareness about the uses of computer and the\ninternet,\n\nread medium level reading resources and comprehend\ncontents,\n\nguess meanings of words using context clues,\nextend their vocabulary using phrasal verbs,\nreview about tenses,\n\nparticipate in conversation based on the ideas in the\nreading passage, and\n\nwrite descriptive or expository essays.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 217,
            "text": "§Listening Skills\n\nListening Skills\n\nThe internet\n\nActivity 10.1 Before you listen to the passage,\nlook at the above picture ana\nanswer the following questions\nindividually, and share you\nanswers with your partner.\n\nWhat do you see in the picture above? Share your ideas with\nyour friend.\n\nWhat do you know about Internet technology?\nWhat changes does Internet bring to your life?\n\nActivity 10.2 Listen to the passage and complete\n\nthe following sentences.\n\nThe internet has reshaped and redefined most traditional\n\ncommunications media including ; ;\n\nand\n\nThe Internet accelerated new forms of human interactions\n\nthrough instant messaging, and\n\nBusiness-to-business and financial services on the Internet\naffect supply chains across\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 218,
            "text": "Reading Skills\n\nAn international network resulted in its and\ninto virtually every aspect of modern human life.\n\nNearly a third of the Earth’s population uses the services\n\nof\n\nDiscuss with your partner how the Internet affects people’s\nlives.\n\nWrite sentences about the impact of the Internet on\npeople’s interaction.\n\nWrite the summary of the advantages of the Internet..\n\noe Reading Skills\n\nActivity 10.4 Before you read the passage,\nanswer the following questions.\n\nShare your answers to you\n\nWhat do you know about computers and the Internet?\n\nDiscuss the advantages and disadvantages of computers\nand the internet.\n\nStudy the following words, which may be important for\nyou to understand the reading passage.\n\nsurfing advent software\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 219,
            "text": "Reading Skills\n\nThe roles of computers and Internet in our lives\n\nComputer and the Internet\n\n1. Computer is perhaps the most controversial inventions of\nthe 20th century. Ever since Bill Gates made it a household\nname, people have been debating over its merits and\ndemerits. Most students would agree that the computer is\nthe greatest invention on earth because it has opened up a\nvast store of easily available information for them. At a click\nof the mouse they get to learn all the things that help them\nto keep abreast with today’s fast moving world. However,\nfor each positive aspect of the computer there is an equal or\n\nmore negative counter point.\n\n2. Worksheets are the days of vigorous handwriting practice.\nThe computer has come as a blessing for students who can\nnow submit their assignments in neat and legible sheets.\nThey can loop up any information to put together their\nprojects and use various software applications to present\nthem in an impressive manner. Colored graphs and diagrams\ncan be inserted, there is very little scope of spelling errors\nand even grammatical mistakes are done away with.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 220,
            "text": "Reading Skills\n\n3.\n\nKnowledge increases with its spread and anyone who wants\nto spread his thoughts and knowledge can put it on the\ninternet. It is available to the world and research students no\nlonger need to labor through piles and piles of manuscripts.\nUniversities can be contacted, websites can be consulted\nand even queries are answered through the internet. All\nthese save them a lot of time, labour, as well as money. For\nthose who want to discuss, there are numerous e-forums and\nconferences that they can log onto. They can always indulge\nin a healthy interaction with other literary enthusiasts.\n\nAs computers become increasingly pervasive into our lives,\nan increasing number of people are facing problems on\nthe domestic front because of computers and the internet.\nIndividuals are spending hours on end chatting or surfing\non the net, but they do not have time for the other members\nin the family. Each one is becoming less communicative\nand more dependent on the computer. Children, especially\nof the advanced and more developed countries are known to\n\nspend 20 hours a week playing computer games.\n\n. Alternately, computers are helping to build up a global family\n\ninstead of narrow groups based on community and caste.\nThe different groups that can be found on social networks\nare witness to the growing popularity on ‘international\n\ncommunities’.\n\n. In a very short time people can be brought together, to\n\nprotest against some wrong, to fight for some right or garner\nsupport for someone. As people become increasingly aware\nof what is going on in the world, more and more people\nare involving themselves in the service of other. There are\n\ndoctors who can be consulted online, lawyers who clarify\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 221,
            "text": "Reading Skills\n\nlegal points and teachers who help students with their\nassignments. There are net cafes that allow people to play\nonline video games — most of which show a lot of violence\n\nand aggressiveness.\n\n. Children, who spend a substantial time playing these games,\nbelieve that such violence is the accepted behaviour in\nlife too. If on the other hand playing of video games can\nbe restricted and supervised, children can develop better\nreaction time, visual activity and dexterity. Is it not amazing\nto know that a child sitting in the US may be playing a game\nwith a child in Japan, or Australia? This international level\nof activity, excludes a lot of negative prejudices allowing\nthe child to develop into a world citizen. However, the child\ncan very easily get in touch with negative groups also.\n\n. Sadly, the advent of computers and the internet has rung\nthe death knell on a lot of habits that are essential for the\ndevelopment of a good character. Reading is one such\nhabit that is fast dying. Be it the daily newspaper or a work\nof fiction, the practice of group reading is decreasing.\n\nCommunicative skills are deteriorating and health too is\n\nsuffering because of the long hours spent sitting in front\nof the computer. It depends on our wisely making use of a\n\ncomputer to turn it into a boon instead of a bane for us.\n\nTaken from: https://www.mykidsway.com/essays/essay-on-role-of-\n\ncomputers-and-internet-in-our-lives/\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 222,
            "text": "Reading Skills\n\nActivity 10.5 Read the passage carefully ana\ndecide whether each statement\nis ‘true’ or ‘false’ based on th\n\ninformation in the passage. Give\nevidences in the passage fo\nour ‘true’ or ‘false’ answers.\n\nComputers help students use various software applications\nfor presenting their projects in an impressive manner.\n\nFor every positive aspect of the computer, there is an equal\nor more negative counterpart.\n\nExchange of ideas and new thoughts become facilitated\nbecause of the Internet and technology.\n\nThese days, computers are not creating a global family\ninstead they are creating narrow groups based on\ncommunity or ethnicity.\n\nBecause of computers, only limited spelling errors and\ngrammatical mistakes occur.\n\n6. | Many people face problems on their private lives because\nof computers and the Internet\n\nBecause of horror games in computers, children accept\nviolence as a normal behavior.\n\n8. | Reading habits don’t seem to decline because of the\nInternet.\n\n9. | As people become increasingly aware of what is going on\nin the world, more and more people involve themselves in\nthe service of others.\n\nIt seems good for the Internet to allow more people to\n\nplay online video games but most of the time it shows\n\nviolence and aggressiveness.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 223,
            "text": "§Vocabulary Development\n\nActivity 10.6 Read the passage carefully ana\n\ngive answers to the following\nquestions.\n\nWrite at least two advantages of computers and the\n\nInternet.\n\nWrite at least two disadvantages of computers and the\nInternet.\n\nState the main idea of paragraph 1.\nThe word ‘these’ in paragraph 3, line 7 refers to\n\nHow does the Internet decrease the reading and\ncommunicative behavior of students?\n\nVocabulary Development\n\n10.3.1 Words taken from the reading passage\n\nActivity 10.7 Find the meanings of th\nfollowing words based on thei\n\ncontexts used in the reading\n\ncounter (paragraph 1, line 10)\nvigorous (paragraph 2, line 1)\nlegible (paragraph 2, line 3)\nscope (paragraph 2, line 7)\npervasive (paragraph 4, line 1)\n6. | caste (paragraph 5, line 2)\n\ngarner (paragraph 6, line 2)\n\n8. | dexterity (paragraph 7, line 5)\n\n9. | deteriorating (paragraph 8, line 6)\nboon (paragraph 8, line 9)\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 224,
            "text": "§Vocabulary Development\n\n10.3.2 Phrasal Verbs\n\nActivity 10.8 Select the appropriate particl\nfrom the list below to complete\neach of the phrasal verbs usea\nin the sentences. In groups,\nguess the meanings of th\n\nphrasal verbs from the context\nthey are used in. Then, consult\nyour dictionary and check you\nmeanings against the dictiona\n\nwithout with off out\naway with over down (on) up\n\nIf you want to lose weight, you have to cut ___ the\namount of food you consume.\n\nZinash cut ____ the piece of meat into small pieces for her\nyounger brother.\n\nThe doctor told himtocut __ salt as his blood pressure\nwas a little high.\n\nMy phone call was cut before I could get the\ninformation.\n\nHe had to cut smoking in order to be prepared for\nthe marathon.\n\n6. | With a little practice, you can cut a whole chicken\nyourself for frying.\n\nA number of people have been employed to deal\nthe backlog of work.\n\n8. | Many countries did death penalty many years ago.\n\n9. | I will do it because my first attempt was not\nsuccessful.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 225,
            "text": "§Grammar\n\n| There is no sugar, so I will have to do it\n\nFL I dozed while I was reading because I slept only\nfew hours last night.\n\nIt is not customary for men to dress as women,\nand women as men.\n\nHis hand was cut in the accident.\n\nWhy did you dress the table like this?\n\nShe dozed in front of the fire.\n\nGrammar\n\nSimple Past, Past Continuous,\nPresent Perfect and Present Perfect\nContinuous Tenses\n\nIn the grammar lessons of the different units you learned, you were\nintroduced with simple past, past continuous, present perfect and\npresent perfect continuous tenses. So, this unit is a revision unit\nthat helps you recapitulate the lessons about tenses. You will learn\n\nabout the tenses more in the different activities you will do.\n\nActivity 10.9 Discuss each of the tenses belo\nin groups focusing on thei\n\npositive, negative and question\norms and their meanings.\n\nThe simple past\nThe past continuous tense\n\nThe present perfect tense\nThe present perfect continuous tense.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 226,
            "text": "§Grammar\n\nFor you to remember your past lessons, we have summarized the\n\nforms and functions of the tenses in the following Table.\n\nPositive Negative Question ;\nTense Function\nform form form\nSimple I played I didn’t play | Did The speaker did\npast basketball | basketball | (Didn’t) the action in the\nyesterday. | yesterday. I play past, yesterday.\nbasketball\nyesterday?\nPast I was I was not Was The speaker\nprogressive | playing (wasn’t) (Wasn’t) was playing\nbasketball | playing I playing basketball for a\nthe whole | basketball | basketball | longer time in\nevening the whole the whole | the past.\nevening. evening?\nPresent I have I haven’t Have The speaker\nperfect played played (Haven’t) | tells about\nbasketball. | basketball. | I played his playing\nbasketball? | basketball,\nwhich he did in\nthe past.\nPresent Ihave been | I haven’t Have I started playing\nperfect playing been playing | (Haven’t) | basketball three\ncontinuous | basketball | basketball | I been hours ago, but\nfor three for three playing I continued\nhours. hours. basketball | playing it until\nfor three now.\nhours?\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 227,
            "text": "§Grammar\n\nActivity 10.10 Write the correct forms of\n\nthe verbs in brackets in the\n\nShambel: Tell me, why (1) (you / take) the Limalimo\nbus from Gondar to Addis Ababa.\n\nDestaw: — Because it was my dream to ride the Limalimo Bus. It was\n\nsomething (2) __ (I/ always / want) to do.\n\nShambel: How long (3) (the trip / take)?\n\nDestaw: It’s onlya day. By the time the Bus arrived at Addis Ababa’\nBus station, (4) (I/ travel) 777 kilometers.\n\nActivity 10.11 Complete the paragraph b\nselect the correct form of each\n\nverb in parentheses and write\nyour answers in the spaces\nprovided below.\n\nI(1) (have) a terrible car accident when I was sixteen. I (2)\n(lose) a leg. As an athlete, this was especially devastating. I\n(3) (be) a gymnast from the age of eight, and I (4)\n(win) three national competitions. It (5) __——_—s (take) me a lot of\ntime to recover, and I (6) (not think) about competing\nagain. Then, one of my coaches (7) (tell) me about the\nParalympics and (8) (suggest) that I train for swimming. I\ncould do that with only one leg. I (9) (always / want) to be\nin the Olympics. In fact, I (10) (train) for the Olympics at\nthe time of my accident. So I (11) (listen) to my coach and\n(12) (start) swimming. I (13) (swim) ever since\nthat day and I love it. I (14) (win) several competitions.\nLately, 1(15)__—__—s(train) for the next Paralympics. I hope to win\n\na medal!\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 228,
            "text": "§Grammar\n\nActivity 10.12 Underline the verbs used in\nthis story, tell what tenses th\n\nverbs are and discuss in groups\nwhat the writer wants to say b\nadding the verb tenses.\n\nAchieving a Goal\nAbout a year ago, I was watching the Olympics, and I decided that I\n\nwanted to become a runner. I knew I should set an achievable goal,\nso I decided to train for a 5km race. My parents were surprised when\nI told them about my goal, because I had never been interested in\nrunning before. In fact, I had never run more than a mile, and I had\nalways been very slow. My friends thought I was joking. Everyone\nassumed that I would quit after a week.\n\nFortunately, I proved them all wrong. I did two things to achieve\nmy goal. First, I went online and researched a good training plan. I\nfound a website that helps me plan workouts. I start by walking, and\nthen I gradually start running. After that, I joined a local running\ngroup. We ran in the park twice a week, and I made friends who had\nalso decided to run a 5km.\n\nThree months later, I achieved my goal: I ran in my first race. I\ndidn’t win, but I ran the whole way, so I was proud of myself. Since\nthen, I have run in several races. I have also started training for a\nlonger run. My next goal is to run in a 10km race. My friends have\nstopped laughing at me, and a few of them have even asked me to\nhelp them start.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 229,
            "text": "§Grammar\n\nActivity 10.13 Put the verb into the more\n\nsuitable form. The first one is\ndone for you as an example.\n\nWhere have you been? (you/play) tennis?\nHave you been playing tennis?\nLook! (somebody/break) that window.\nYou look tired. (you/work) hard?\n“(you/ever/work) in a factory?’ ‘No, never.’\n‘Liz is away on holiday.’ ‘Is she? Where (she/go)?’\n6. | My brother is an actor. (he/appear) in several films.\n‘Sorry I’m late.’ ‘That’s all right. (I/not/wait) long.’\n8. | ‘Is it still raining?’ ‘No, (it/stop).’\n9. | (I/lose) my phone. (you/see) it anywhere?\n(I/read) the book you lent me, but (I/not/finish) it yet. It’s\n\nvery interesting.\n\nActivity 10.14 Develop your own sentences\non simplepast, past continuous,\npresent perfect, and present\n\nperfect continuous tenses. Write\ntwo sentences in each tense ana\ndiscuss them in\n\nSimple past\na)\nb)\n\nPast continuous tense\n\nPresent perfect tense\n\nPresent perfect continuous tense\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 230,
            "text": "§ Speaking Activity\n\njee Speaking Activity\n\nActivity 10.15 The social media status of\nEthiopia in 2021 is as shown\nin the Table below. In you\n\ngroups, express your opinions\nin answering the following\nquestions.\n\nHow do you see the status of use of the social media in\neach of the media stated?\n\nWhat should the social media do to benefit the Ethiopian\npeople?\n\nWhat do you think you can contribute for the social media\nto provide genuine information?\n\nHow do you evaluate the extent of internet use in Ethiopia?\n\nWhat is the importance of internet application in Ethiopia?\n\n6. | What should be done to improve its use in the country?\n\nThe Social Media Status of Ethiopia, 2021\n\nTwitter 39.38\nFacebook 37.34\nYouTube 10.74\n\nTaken from, https://internetysociety.org\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 231,
            "text": "9 Speaking Activity\n\nNotes: Phrases that can help you express\nopinions\nPhrases\nused to . _. .\nAsking for opinion | Agreement | Disagreement\nexpress\nopinion\nI think... What do you think So do I. I disagree!\nI believe... | Of+-? Me too. I don’t agree.\nI feel... What are your Definitely. | I’m not sure I agree\nthoughts on...?\nIn my & L agree. or with you on...\nopinion... How do you feel Icouldn’t | /’™ Sorry but I\nabout...? and >\nI would agree more. don’t agree.\nsay... What’s your opinion I'm afraid I\non...? disagree.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 232,
            "text": "§ Writing Activity\n\nWriting Activity\n\nove f ctivity 10.16 Write an essay about the uses\n\nof the internet based on th\n\ninformation in the diagram. A\nsample essay is given to you.\n\nvideo\nconference\n\nUses of\n\ninternet\nself\n\npublishing\n\nonline\nshoppmg\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 233,
            "text": "§Writing Activity\n\nSample Essay: Importance of the Internet\n\nThe last few years have witnessed heavy reliance on the internet.\nThis has been because of multiple advantages that it has to offer\n— for instance reducing the work stress and changing the face of\ncommunication most importantly. If we take the current scenario,\nwe cannot ignore how important the Internet is in our everyday\nlives. It is now indeed a challenging task to visualize a world\n\nwithout the internet.\n\nOne may define the internet as a large library composed of stuff like\n— records, pictures, websites, and pieces of information. Another\nsector in which the internet has an undeniably important role to\nplay is in the field of communication. Without access to the internet,\nthe ability to share thoughts to share thoughts and ideas across the\n\nglobe would have also been just a dream.\n\nActivity 10.17 Write sentence-level polite\nagreements or disagreement to\n\nthe following statements first,\nand then write paragraphs on\nany two of the statements.\n\nInternet-use is important to our country. I think it is\nimportant\nMany people are using the social media dishonestly. In my\n\nopinion,\n\nI feel like that we are not doing enough to our country. If\nyou ask me,\n\nI believe that we should depend less on technology. We\nshould be creative,\n\nIn my experience, men tend to be more immature than\n\nwomen of the same age. I think,\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 234,
            "text": "§ Writing Activity\n\nActivity 10.18 Write an opinion essay agreeing\nor disagreeing on one of th\n\nfollowing topics following th\nexample short paragraphs\nbelow.\n\nI think we can combat climate change by growing trees.\nI think the computer was the best invention. There’s no\n\nquestion about it.\n\nExample paragraphs of polite agreement and disagreement to the\nstatement the different regions of Ethiopia have best staple foods.\n\nPolite agreement\n\nIn my opinion, the different regions of Ethiopia have special staple\nfoods that are delicious. For instance, the Tuhlo in Adigrat and the\nKocho in Gurage are delicious foods. When one eats the kocho with\nchopped up meat called kitfo locally, he/she may think that there is\nno equal food stuff to it anywhere. Tuhlo has also very good taste\nand its food service tradition is special which is really very much\nattractive. Fish desserts in Arba Minch, the mitin shiro in different\nregions and the chicken stew are all delicious food stuffs everyone\nenjoys to eat. So, I feel that we have variety of delicious food stuffs\n\nwhich are much enjoyable in Ethiopia.\n\nPolite disagreement\n\nThe different cultural foods in Ethiopia may be enjoyable to many\nEthiopians. But, I think the staple foods may not be delicious to\ntourists who haven t experienced such kinds of food stuffs. Tourists\nwho come from different corners of the world may have experienced\ndifferent cultural foods of their own. To such kind of people, eating\nnew food stuffs may not be easy. So, catering them with other\n\nchoices seems mandatory.\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 235,
            "text": "Writing Activity\n\nGrade 9 English Textbook"
        },
        {
            "page_number": 236,
            "text": "Grade 9 English Textbook"
        },
        {
            "page_number": 237,
            "text": ""
        }
    ]
}