{
    "textbook_id": "information_technology10",
    "chunks": [
        {
            "page_number": 1,
            "text": "INFORMATION TECHNOLOGY                  STUDENT’S TEXTBOOK                    GRADE 10\nINFORMATION\n   TECHNOLOGY\nSTUDENT’S TEXTBOOKGrade 10\nFederal Democratic Republic of Ethiopia Ministry of Education Federal Democratic Republic of Ethiopia Ministry of Education"
        },
        {
            "page_number": 2,
            "text": "Take Good Care of This Textbook\nThis textbook is the property of your school. Take good care not to damage or lose \nit. Here are 10 ideas to help take care of the book:\n1.Cover the book with protective materials, such as plastic ,old newspapers or magazines.\n2. Always keep the book in a clean dry place.\n3. Be sure your hands are clean when you use the book.4. Do not write on the cover or inside pages. 5. Use a piece of paper or cardboard as a bookmark.6. Never tear or cut out any pictures or pages.7. Repair any torn pages with paste or tape.8. Pack the book carefully when you place it in your school bag.9. Handle the book with care when passing it to another person.\n10. When using a new book for the first time, lay it on its back. Open only a few \npages at a time. Press lightly along the bound edge as you turn the pages. This will keep the cover in good condition.\n  i"
        },
        {
            "page_number": 3,
            "text": "Writers\nContent Editor\nInstructional Design Editor\nLanguage Editor\nIllustrator\nBook Designer  Abdella Kemal (Assistant Professor)\n  Tegegn Gobana (Assistant Professor)  Wogene Alemayehu (MSc)  Jerusalem Yibeltal (PhD)  Tagesse Daniel (PhD)  Kibrebeal Getinet (MSc)  Efrem Yohannes (PhD)\nFEDERAL DEMOCRATIC REPUBLIC OF ETHIOPIA\nMINISTRY OF EDUCATIONINFORMATION \nTECHNOLOGY\nGrade 10\nStudent’s Textbook\nHAWASSA UNIVERSITY\niiiiii"
        },
        {
            "page_number": 4,
            "text": "iiiFirst Published 2023 by the Federal Democratic Republic of Ethiopia, Ministry \nof Education, under the General Education Quality Improvement Program for Equity (GEQIP-E) supported by the World Bank, UK’s Department for International Development/DFID-now merged with the Foreign, Common wealth and Development Office/FCDO, Finland Ministry for Foreign Affairs, the Royal Norwegian Embassy, United Nations Children’s Fund/UNICEF), the Global Partnership for Education (GPE), and Danish Ministry of Foreign Affairs, through a Multi Donor Trust Fund.   \n© 2023 by the Federal Democratic Republic of Ethiopia, Ministry of Education. \nAll rights reserved. The moral rights of the author have been asserted. No part of this textbook reproduced, copied in a retrieval system or transmitted in any form or by any means including electronic, mechanical, magnetic, photocopying, recording or otherwise, without the prior written permission of the Ministry of Education or licensing in accordance with the Federal Democratic Republic of Ethiopia as expressed in the Federal Negarit Gazeta, Proclamation No. 410/2004 - Copyright and Neighboring Rights Protection.\nThe Ministry of Education wishes to thank the many individuals, groups and \nother bodies involved – directly or indirectly – in publishing this Textbook. Special thanks are due to Hawassa University for their huge contribution in the development of this textbook in collaboration with Addis Ababa University, Bahir Dar University and Jimma University.\nCopyrighted materials used by permission of their owners. If you are the owner \nof copyrighted material not cited or improperly cited, please contact the Ministry of Education, Head Office, Arat Kilo, (P.O.Box 1367), Addis Ababa Ethiopia. \n  iii  iiiPrinted by:\nGRAVITY GROUP IND LLC\n13th Industrial Area,\nSharjah, UNITED ARAB EMIRATES\nUnder Ministry of Education Contract no. : MOE/GEQIP-E/LICB/G-01/23ISBN: 978-99990-0-041-3"
        },
        {
            "page_number": 5,
            "text": "Table of Contents\nUNIT 1 : ORGANIZATION OF FILES\n1.1 Unit Overview 1\n1.2 File Management 1\n1.3 Storage Drives 4\n1.4 File Name Extension 6\n1.5 File Directory Structure 9\n1.6 File Conversion 14\n1.7 File Importing and Exporting 16\n1.8 Saving and Opening Files 18\n1.9 File Backup and Recovery 20\n1.10 File Compression 23\n1.11 Deleting a File 25\n1.12 Restoring Deleted File 27\n1.13 Unit Summary 29\n1.14 Unit Review Exercise 30\nUNIT 2 : COMPUTER NETWORK\n2.1 Unit Overview 36\n2.2 Network Media (Transmission Media) 37\n2.3 Telecommunications Network 53\n2.4 Mobile Communications 58\n2.5 Cellular Networks 62\n2.6 Satellite Networks 66\n2.7 Internet Protocol 72\n2.8 Unit Summary 76\n2.9 Unit Review Exercise 77\niv"
        },
        {
            "page_number": 6,
            "text": "UNIT 3 : APPLICATION SOFTWARE\n3.1 Unit Overview 81\n3.2 Word Processing 82\n3.3 Spreadsheet 102\n3.4 PowerPoint Presentation 125\n3.5 Unit Summary 131\n3.6 Unit Review Exercise 133\nUNIT 4 : IMAGE PROCESSING AND MULTIMEDIA\n4.1 Unit Overview 139\n4.2 Basics of Multimedia 139\n4.3 Multimedia File Formats 148\n4.4 Multimedia Production 149\n4.5 Multimedia Authoring and Authoring Tools 151\n4.6 Multimedia Editing 157\n4.7 Unit Summary 177\n4.8 Unit Review Exercise 178\nUNIT 5 : INFORMATION AND COMPUTER SECURITY\n5.1 Unit Overview 182\n5.2 Information and Computer Security 183\n5.3 Impact of Information and Computer Security on Society 184\n5.4 Privacy and Security 185\n5.5 Computer Security Threats 187\n5.6 Threat Prevention Strategies 188\n5.7 Cyber Security 197\n5.8 Unit Summary 199\n5.9 Unit Review Exercise 200\n  v"
        },
        {
            "page_number": 7,
            "text": "UNIT 6 : FUNDAMENTALS OF PROGRAMMING\n6.1 Unit Overview 204\n6.2 Basics of Algorithm 204\n6.3 Definition of Algorithm 206\n6.4 Characteristics of Algorithm 207\n6.5 Algorithm Representation 210\n6.6 Integrated Development Environment(IDE) 218\n6.7 Unit Summary 223\n6.8 Unit Review Exercise 224\nvi"
        },
        {
            "page_number": 8,
            "text": "Grade 10 Information Technology Student’s Textbook \n  11.1 Unit Overview\nDear student, in grade 9, you learned about file management and related concepts \nsuch as files, folders, file drivers, methods of file creation, naming and renaming files and folders, and ways of accessing drives. In this unit, you are going to learn advanced concepts of file management such as file types, extensions, drivers and paths. You will also learn about methods of file conversion, saving and deleting files, file backup and recovery, storage drive and mechanisms of file importing and exporting.\n1.2 File Management\nBefore the introduction of automation system, schools and other societies used to manage and organize their sensitive data in traditional file systems such filing cabinets. Such systems are so traditional and complicated to access files. Figure 1.1 shows a filing cabinet.At the end of this unit, learners will be able to:\nExplain the file management system.\nAnalyze extensions of file types.\nOrganize, delete and restore files and folders.\nSummarize file formats. \nConvert a file into different formats.UNIT \nORGANIZATION OF FILES\nUNIT OUTCOMES1\n Brainstorming \n1. How are files handled at your home?\n2. Can you describe ways of managing files in school or other organizations?"
        },
        {
            "page_number": 9,
            "text": "2Unit 1 : Organization of Files\nFigure 1.1 Filing cabinet\nNowadays, to recognize file management , you need to understand how your \ncomputer stores information. A file is the common storage unit in a computer, \nand all programs and data are “written” into and “read” from the file. \nComputers store information in files that are also organized and grouped \nin folders and stored on disks, not in big drawers. Computers rely on hard disk drives (HDDs) to store data permanently. They are storage devices used to save and retrieve digital information that will be required for future reference.\nA disk drive is a technology that enables the reading, writing, deleting \nand modifying of data on a computer storage disk. It is either a built-in or external component of a disk that manages the disk’s input/output (I/O) operations. The most common type of disk drive is a hard disk drive (HDD), and the terms disk drive and hard disk drive are typically \nused interchangeably. Other types of hard disc include optical drives, storage devices and floppy drives. Figure 1.2 shows a disk drive. Disk drives and other storage devices are discussed in section 1.3. \nActivity 1.1\nComplete the following activities in a group.\n1. Discuss the major types and functions of file management.\n2.Try to remember what you learned in grade 9, unit one, and explain the \ntypes of files, folders and subfolders."
        },
        {
            "page_number": 10,
            "text": "Grade 10 Information Technology Student’s Textbook \n  3\nFigure 1.2 Disk drives\nA folder holds one or more files, and it can be empty until it is filled. A folder can \nalso contain other folders, and there can be many levels of folders within folders. \nFiles are normally organized into directories in schools and other organizations to easily locate and use them. When multiple users have access to files, it may be desirable to control by whom and in what ways the files may be accessed. Therefore, file management is the process of organizing and keeping track of files and folders, helping you stay organized, so information is easily located.\nKEY CONCEPTS\nFile management is the process and act of creating an organized structure in which you store information for easy retrieval.\nFolder (directory) is a virtual storage space used to store and organize computer files.\nA disk drive  is a technology that enables the reading, writing, deleting and \nmodifying of data on a computer storage disk.3. Compare and contrast disks and drives.\n4. Briefly explain why file management is so important."
        },
        {
            "page_number": 11,
            "text": "4Unit 1 : Organization of Files\n1.3 Storage Drives\nA computer drive is a piece of hardware that is used to read and store information \non the  computer and that is usually not as easily removed as a disk. For example, \nin Microsoft windows, users can identify the drives windows has detected by \nopening file explorer (right-clicking on windows icon on the taskbar), opening \nThis PC icon on the desktop, or pressing the windows key + E.\nWhenever someone saves his/her file on the computer, it simply means that the \nfile is stored on the hard disk. Currently, there are other ways of saving files using cloud-based drives. OneDrive and google drive are examples of cloud-based \ndrives on which files are stored. You should consider the following important points about drives.\nEach drive is assigned a letter to identify it.\nThe letter identifies the root of the file where it is originated from (this \nmeans, the location where the file was saved in).\nDrives and Drive Letters\nA drive is alternatively referred to as a device letter. A drive letter is a single alphabetic character A through Z that is assigned to a physical computer drive or drive partition. For example, a computer with a 3 1/2” floppy diskette drive has a drive letter of A: assigned to the drive. Computers containing a hard drive always \nhave that default hard drive assigned to C: drive letter, and CD-ROM or another \ndisc drive, which is the last drive letter (For example E:). Figure 1.3 shows devices and drives.\n1. A cloud drive is a web-based service that provides storage space on a remote server. Cloud drives, which are accessed over the Internet with client-side software, are useful for backing up files. Figure 1.4 shows cloud drive icon. Brainstorming \n1. What do you think a drive is? Why is it used for?\n2. How do you identify a drive on your computer?"
        },
        {
            "page_number": 12,
            "text": "Grade 10 Information Technology Student’s Textbook \n  52.Some people may be confused with “drive” and “driver”. These \nare separate terms. If you are looking for help with installing or updating the software related to hardware, driver is a group of files that enable one or more hardware devices to communicate with the computer’s operating system. Without drivers, the computer could not send and receive data correctly to hardware devices such as a printer.\nFigure 1.3 Devices and drives\nFigure 1.4 Cloud drive icon\nActivity 1.2\nPerform the following activity and express what you observed.\n1. On the desktop of your computer, perform the following steps:\n   Step 1. Right Click on the Start Menu.   Step 2. Click on Windows Explorer.\n2. What have you observed on the screen? Can you identify the drive letters?"
        },
        {
            "page_number": 13,
            "text": "6Unit 1 : Organization of Files\nAfter doing the above activity, you will see the following in the folder list.\nThis is known as a hard drive and is found inside your computer. \nThis drive is where all your program software is installed, for example, Microsoft \nWord, Excel, etc.\nThis is another hard drive in your computer into which you can save \ndata.\nThis is a CD drive where you can read CD data disks and listen to audio \ndisks. Without a special CD drive (CD burner), you cannot save data to this drive. However, in some computers, the above derive letters and drive names might not appear or have different names or letters based on the partition of the computer disk. \nIf you plug in a USB drive on any operating system, it will recognize the plugged-in or inserted device and automatically gives the plugged-in drive a letter of its own. Usually, the next available letter that is not being used by another drive will be assigned.\n1.4 File Name Extension\nA computer has many different types of files on it, and each one has its own file \nextension. A file extension is a three- or four-letter identifier found at the end of a file name being followed by a period. The extension tells you about the characteristics of a file and its use. Examples of file extensions are:\nAn image uses the .jpg or.jpeg extension (for example, image.jpg ).KEY CONCEPTS\nA computer drive is a piece of hardware that is used to read and store\ninformation on the computer and it is usually not easily removed as a disk.\nOneDrive and Google drive are cloud-based drives on which files are stored.\n Brainstorming \n1. How do you identify a word file from an excel file?\n2. What do you understand by the term filename extension?"
        },
        {
            "page_number": 14,
            "text": "Grade 10 Information Technology Student’s Textbook \n  7A Word document uses the .docx extension, or .doc for older versions \n(for example, CoverLetter.docx).\nAn audio file uses the .mp3 extension (for example, song.mp3).\nAn Excel spreadsheet uses the .xlsx extension, or .xlsfor older versions \n(for example, budget.xls ).\nFile extensions are used by an operating system to identify what applications are \nassociated with a particular file type. In other words, a file extension specifies an application that opens the file when you double-click on it. For example, a file named “awesome_picture.jpg” has the “jpg” file extension. When you open that file in Windows, for example, the operating system looks for whatever application is associated with JPG files, opens that application, and loads the file.\nAn operating system is a software program required to manage and operate \ncomputing devices like smartphones, tablets, computers and supercomputers. The operating system eliminates the need-to-know coding language to interact with computing devices. Table 1.1 shows examples of operating system.\nTable 1.1 Operating systems\nOperating System Description\nWindowsWindows is developed by Microsoft Corporation to run personal computers (PCs). It featured the first graphical user interface (GUI) for IBM-compatible PCs.\nUnixUnix is a multitasking, multiuser computer operating system. A command-based computer operation has been constantly updated since the invention of Unix.\nLinux Linux is an open-source operating system (OS). \nDOS DOS is the part of a computer operating system that controls and manages files and programs stored on a disk. DOS is an abbreviation for ‘disk operating system’.\nAndroidAndroid is a mobile operating system based on a modified version of the Linux kernel and other open-source software, designed primarily for touch screen mobile devices such as smart phones and tablets."
        },
        {
            "page_number": 15,
            "text": "8Unit 1 : Organization of Files\nFilename extension and length vary according to the type of operating system \n(OS) we use. For instance, in Unix operating system, which is a command-based OS, a file extension is optional; in Linux and Windows operating systems a file extension is a requirement. However, Disk Operating System (DOS) limits the length of the file extension. For example, DOS uses three characters; Windows uses three or four characters while Unix-based OS uses unlimited characters.\nA filename extension is a suffix added to the name of a computer file to indicate \nthe encoding, convention or file format of its contents. Table 1.2 shows different types of file extension.\nTable 1.2 Different types of file extensions\nFile Type \nExtension Content Application\n.txt Simple text file Any word processing application\n.doc, docx Word processing file Microsoft Word file(doc,docx)\n.rtf Rich Text Format Any word processing application\n.pdf Portable Document Format Document presentation format\n.ppt Presentation file for slide showMicrosoft PowerPoint file\n.xls,xlsx Spreadsheet files Any spreadsheet file\n.mdb A database file Microsoft Access database file\n.zip, .Rar Compression format for PC WinZip, WinRar\n.exe Dos/Windows self-extract-\ning formatDownloads and launches it in itsown temporary directory\n.mp3 Audio file on Windows Window Media Player\n.wav Audio Files on PC Real Player\nActivity 1.3\nAnswer the following accordingly.\n1. Discuss the various types of file extension and their applications.\n2. Discuss file extension types that indicate audio and video formats.3. Mention the operating system that uses three characters for file extension.4. Identify the application file names in Figure 1.5 below."
        },
        {
            "page_number": 16,
            "text": "Grade 10 Information Technology Student’s Textbook \n  9Figure 1.5 Application files\n1.5 File Directory Structure\n Brainstorming \n1. Can you define file directory? \n2. Describe a file directory structure in a computer?3. What is a file path?\nKEY CONCEPTS\nOperating system (OS) is a program that manages a computer’s resources, \nespecially the allocation of those resources among other programs. Typical resources include the central processing unit (CPU), computer memory, file storage, input/output (I/O) devices and network connections.\nA filename extension is a suffix added to the name of a computer file to \nindicate the encoding convention or file format of its contents.\nIn Unix operating system, file extension is optional while in Windows it is mandatory.\nDOS uses three characters, Windows uses three or four characters and Unix\nuses unlimited characters as a file extension."
        },
        {
            "page_number": 17,
            "text": "10Unit 1 : Organization of Files\nThe directory structure is the way an operating system shows its system and other \ntypes of files to the computer user. Files are typically displayed in a hierarchical \ntree structure. When you see the structure, it looks like a tree; hence, the term hierarchical tree structure  is used to describe it. The first or the top folder (directory) \nin the structure is called the root directory. A directory contained inside another \ndirectory is called a subdirectory. The terms parent and child are often used to \ndescribe the relationship between the directory and the subdirectory.\nThe root directory contains all other folders or files in the drive. For Example, \nthe root directory of the main partition on a computer is usually C:\\.  The root \nfolder of a DVD or CD drive might be D:\\.\nAfolder is a virtual location where programs, files and other folders can be \nlocated. A folder is also called a directory. It is a tool for arranging files on a \ndisk. Files are organized by storing related files in the same directory. Folders \nwhich hold files or other folders on the computer are called sub-folders or sub-directories. Figure 1.5 shows simple directory structure.\nFigure 1.6 Simple directory structure\n1.5.1 Directory Path or File Path \nA path is a list beginning with a drive letter that tells which folders to open so that you can find a file or another folder.  When a file system is organized as a \ndirectory tree, someway is needed to specify the filenames. The use of a tree-structured directory minimizes the difficulty of assigning unique names. Any file in the system can be located by following a path from the root or master directory down to various branches until the file is reached."
        },
        {
            "page_number": 18,
            "text": "Grade 10 Information Technology Student’s Textbook \n  11The series of directory names, culminating in the file name itself, constitutes a \npathname for the file. Figure 1.7 shows a file path from the directory structure in \nwhich the file Click.mp3  is shown.\nFigure 1.7 Directory structure of a file\nTo access the file Click.mp3, you need to follow the steps stated below.\n1. Open the C:/ drive on your computer.\n2. Select the user folder from the drive. 3. Select the Sarah folder.4. Select the music folder and then you will see the file in the folder.5. Check that the file Click.mp3  exists in the music folder.\nTypes of Directory Paths\nThe two different methods commonly used to indicate the path of a file are \nabsolute pathname and relative pathname. \na. Absolute Pathname\nAn absolute pathname represents the complete name of a directory or file from the /(root) directory downward. Regardless of where you are working in the file"
        },
        {
            "page_number": 19,
            "text": "12Unit 1 : Organization of Files\nsystem, you can always find a directory or file by specifying its absolute path -\nname. Figure 1.8 shows an example of absolute pathname.\nFigure 1.8 Absolute pathname\nThe slash (/) is used to delimit names in the sequence. The name of the master \ndirectory is implicit because all paths start at that directory. \nNote that it is perfectly acceptable to have several files with the same file name, \nas long as they have unique pathnames. That is, the same file name may be used in different directories. Figure 1.9 shows that there is another file in the system with the file name ABC, but the pathname /User_B/Draw/ABC.\nFigure 1.9 Tree structure file directory"
        },
        {
            "page_number": 20,
            "text": "Grade 10 Information Technology Student’s Textbook \n  13b. Relative Pathname \nAlthough the path name facilitates the selection of file names, it would be difficult \nfor a user to have to spell out the entire pathname every time a reference is made to a file. Typically, an interactive user or a process associated with a current directory is often referred to as the working directory or current directory. In this case, the files are referenced relative to the working directory.\nRelative pathnames are used to specify the name of a file in the current \ndirectory or the pathname of a file or directory above or below the level of the current directory in the file system. If D is the current directory, the relative pathname for accessing 10 is F/10. For example, as you can see in Figure 1.9 above, if the working directory for user B is “Word,” then the pathname Unit_A/ABC is sufficient to identify the file.\nActivity 1.4\nAnswer the following accordingly.\n1. State the meaning of the term path name.\n2. Define absolute pathnames and relative pathnames. 3.Look at the directory structure in Figure 1.10 below and answer the \nfollowing questions. \na. Identify the root directory.\nb. Identify the name of the drive.c. Identify the subdirectory of the root directory.d. Write the name of the folders in the ‘home’ directory.e. Identify the parent directory of the user2.f. Identify the child directory of user2.g. Write the path to be used to get to file ‘status report (file)’.h. Describe what would happen if the ‘home’ folder was deleted."
        },
        {
            "page_number": 21,
            "text": "14Unit 1 : Organization of Files\nFigure 1.10 Directory structure\nKEY CONCEPTS\nDirectory structure is the way an operating system shows its system and \nother types of files to the computer user.\nA path is a list beginning with a drive letter that tells which folders or files \nto open.\nAbsolute pathname  is the path given from the root directory to the file.\nRelative pathname is the path referenced relative to the current directory.\n1.6 File Conversion\n Brainstorming \n1. How is a file converted?\n2. Why do you think file conversion is so important?"
        },
        {
            "page_number": 22,
            "text": "Grade 10 Information Technology Student’s Textbook \n  15File conversion is the process of taking a file of one format and changing it into \nanother. This is especially handy since you may one day work with files that are not compatible with the different programs you need to use. In Figure 1.11, you will see different types of files. It is possible to convert from one file format to another; for example, you can take a file used in Microsoft Word (.doc) and convert it to the Portable Document Format (PDF) file format.\nFigure 1.11 Types of files\nThere are dozens of file formats for word processing documents, graphics and \nspreadsheets, and so on. If a file was created in one application and you want to use it in another, you can either import the file or use a conversion program.\nFile Converter\nA file converter is software that converts a document from one file type to another. These solutions offer simple step-by-step processes to perform conversions so that a user simply needs to upload the original document, select which file type they would like the document to be converted to and convert it. Some common file converter soft wares include FoxitPDFEditor, PDF to Word Converter, PDF Convert Free, EliteCloudConvert, PDFShiftPDF and CandySelectPdf.\nActivity 1.5\nAnswer the following items individually.\n1. Define the term file conversion.\n2. Summarize the advantages of file conversion from one format to another.\n3. Describe how image and drawing files are converted. 4.Mention the file formats that cannot be converted into drawing or vector \ngraphics formats."
        },
        {
            "page_number": 23,
            "text": "16Unit 1 : Organization of Files\nKEY CONCEPTS\nFile conversion is the process of taking a file of one format and changing it \ninto another. \nFile converter is the software that converts a document from one file type to another.\nIf a file was created in one application and you want to use it in another, you can either import the file or use a conversion program.\n1.7 File Importing and Exporting\nWhat is a File Import?\nFile import is the process of moving files or data used in one program to another. As shown in figure 1.12 below, when you import, you are bringing in information from a file into a program. For example, you could import a CSV file you \ndownloaded from the Internet into an Excel spreadsheet. \nA comma-separated values (CSV) fileis a delimited text filethat uses a comma \nto separate values. Each line of the file is a record of data.\nWhat is a File Export?\nA file export is a process of moving information from a program into a file. As seen in figure 1.12, when you are exporting, you are taking information from a program and putting it into a file. For example, you may export a Microsoft \nExcel spreadsheet to a CSV file.  Brainstorming\n1. What do you think is file importing?\n2. Would you describe what a file export means?3. Can you tell the difference between file import and export?"
        },
        {
            "page_number": 24,
            "text": "Grade 10 Information Technology Student’s Textbook \n  17\nFigure 1.12 File import and export\nIn programs, you can export data in a format recognized by another program by \nopening the file menu in that program and selecting export (the feature may be \nlocated in different menus in different programs). Then you can enter what file format you want the file to be exported in. Some commonly used formats are txt, BMP, jpg, gif and more. Figure 1.13 shows the export window in OneNote application. Here, notes are exported as a .doc files, which is commonly used by \nMicrosoft Word and other word processors.\nFigure 1.13 Exporting files"
        },
        {
            "page_number": 25,
            "text": "18Unit 1 : Organization of Files\nActivity 1.6\nWork in a small group to answer the following items.\n1. Discuss the terms file import and file export.\n2.Open any word document and try to convert it into a PDF file using the \nexport method.\n3.Open any word document and use save as or export options to convert it into PDF, Plain text, or any other options that appear in the pop-down menu.\nKEY CONCEPTS\nFile import is the process of moving a file or data used in one program to another. When you import a file, you are bringing in information from a file\ninto a program.\nFile export is the process of moving information from a program into a file. \nWhen you are exporting, you are taking information from a program and putting it into a file.\n1.8 Saving and Opening Files\nAlthough it is often a wise decision to save files using the default file format  of \na program (since the program is guaranteed to store all the information correctly then), you can also easily change the file format when saving a file. In most programs, you can change the file format using the following path.\nClick on the File Menu \n click on Save As option  click on Browse folder \nselect the file and click on the Save as type list in the bottom part of the window \nthat opens and choose the file type you like and then click on the Save button.  Brainstorming \n1. Why do you think we need to open and save files in a different format?\n2.Can you mention the steps you follow to open and save files in different \nformats?"
        },
        {
            "page_number": 26,
            "text": "Grade 10 Information Technology Student’s Textbook \n  19The list will display the file formats in which you can save your file. Figure 1.14 \nshows how a tiff image is saved as a jpeg image.\nFigure 1.14 Saving files in different formats\nWhen you save a file in another file format, some of the original file’s features may not be transferred correctly. Check your new file after saving it and always save the original. To change the format of afileyou are opening, follow the same \nprinciple as saving in a different file format.\nWhen you open a file in Windows, it will usually open in the default \napplication for that type of file. In Microsoft (MS) Word, you can open documents \nthat are in different formats. You can specify a file format to narrow down your \nsearch, or choose the All-Files option and let Word do the work for you.  \nPractical Exercise 1.1\nComplete the following activities.\n1. Discuss the importance of saving the files in different formats.\n2. Describe the importance of file export and file import.3.\nSummarize steps to open different file formats in the Microsoft office          \napplication."
        },
        {
            "page_number": 27,
            "text": "20Unit 1 : Organization of Files\nKEY CONCEPTS\nWhen you save a file in any application program, the application saves the \nfiles using the default file format of a program. \nWhen you open a file in Windows, it will usually open in the default application for that type of file.\n1.9 File Backup and Recovery\nBackup and recovery describe the process of creating and storing copies of data that can be used to protect individuals and organizations against data loss. This is sometimes referred to as operational recovery. \nA backup is a digital copy of your most important information such as photos, \nhealth records, assignments, academic records and other credentials. It can be saved to an external storage device or the cloud. A proper backup copy is stored in a separate system or medium, such as tape, from the primary data to protect against the possibility of data loss due to primary hardware or software failure.\nBacking up is a precautionary measure so that your data is accessible in case \nit is lost, stolen or damaged. \n1.9.1 Steps Followed to Take File Backup \nHow to Backup Files\nYou will learn how to take backup using MS Windows operating systems. To take back up of a file, follow each of the following steps carefully.4.In Microsoft word, write one page about the Ethiopian renaissance dam and save it with the name ETHIOPIA.  Observe file format.\n5. Covert the file ETHIOPIA into PDF file format.\n Brainstorming \n1. How do you understand file backup?\n2. Why do you think it is necessary to take a file backup?"
        },
        {
            "page_number": 28,
            "text": "Grade 10 Information Technology Student’s Textbook \n  21The step of Backing up your files using an external storage device in Windows is \nshown below:\n1.Ensure your external storage device is plugged in. Click on Start, and then \nclick on the Settings icon, or type settings on  Type here to search the textbo x.\nFigure 1.15 Click on start\n2. Select Update and Security among the options given. \nFigure 1.16 Select Update and Security"
        },
        {
            "page_number": 29,
            "text": "22Unit 1 : Organization of Files\n3. Click Backup in the left column.\nFigure 1.17 Click Backup\n4. Select your backup removable drive from your computer. \n5. The file will be copied to the specified format.\n1.9.2 File Recovery\nRestoring is the process of copying backed-up data from a secondary location \nand restoring it to its original device or a new device. The purpose of the backup \nis to create a copy of data that we use to recover in the event of a primary data failure.  Primary data failures can be the result of hardware or software failure, data corruption or a human-caused event, such as a malicious attack (virus or malware) or accidental deletion of data. Backup copies allow data to be restored from an earlier point in time to help the business recover from an unplanned event.\nKEY CONCEPTS\nBackup and recovery describe the process of creating and storing copies of data that can be used to protect individuals and organizations against data loss.\nRestoring is the process of copying backed-up data from a secondary location and restoring it to its original or a new device. \nThe purpose of the backup is to create a copy of data that we use to recover in the event of a primary data failure."
        },
        {
            "page_number": 30,
            "text": "Grade 10 Information Technology Student’s Textbook \n  23When you want to work on your previous document next time, first you have to \nopen it. To open the existing file, you have already done in practical exercise 1.2 on your computer, follow practical exercise 1.3.\nPractical Exercise 1.3\nComplete the following activities using in a group.\n1.From the application’s file menu, click open or simply click the open () button of the application. \n2.Click on Browse, choose the drive and folder you want to look in for the file. \n3. Double-click the filename from the list of files.\n1.10 File Compression\n Brainstorming \n1. What does it mean by a file compression?\n2. Why is file compression so important during file management?\nFile compression is a data compression method in which the logical size of a file \nis reduced to save disk space for easier and faster transmission over a network or the Internet. It enables the creation of a version of one or more files with the same Practical Exercise 1.2\nOpen MS Word document and write a paragraph on the uses of MS word and do the following activities in a group.\n1.Click the Save icon. If you have never saved the file before, the Save As dialog box appears. \n2.If you are saving a new file or saving the file under a new location, select the drive and folder you want to save the file in from the Save inbox. \n3. Type a name for the file in the File name box. \n4. Click the Save button."
        },
        {
            "page_number": 31,
            "text": "24Unit 1 : Organization of Files\ndata at a size substantially smaller than the original file. File compression is also \nknown as file zipping. Figure 1.18 shows the file compression icon.\nFigure 1.18 File compression icon\nZipped (compressed) files occupy less storage space and can be transferred to other computers more quickly than uncompressed files. In Windows, you work with zipped files and folders in the same way that you work with uncompressed files and folders. You need to combine several files into a single zipped folder to share a group of files more easily.To compress file and folders, we follow the following steps.\nTo zip (compress) a file or a folder\n1. Locate the file or the folder that you want to zip.\n2. Press and hold or right-click the file or the folder.3. Select or point to Send to, and then select Compressed (zipped) folder. \nA new zipped folder with the same name is created in the same location. Figure \n1.19 shows how to compress a file on the desktop.\nFigure 1.19 Compressing a file"
        },
        {
            "page_number": 32,
            "text": "Grade 10 Information Technology Student’s Textbook \n  25File or Folder Compression Tools\nThere are a lot of file or folder compression software packages; among them, the \nmost popular compression tools are WinRAR, WinZip and 7zip. Below are steps to unzip compressed files.\nTo Unzip Files\n1. Open File Explorer and find the zipped folder.\n2.To unzip the entire folder, right-click to select Extract All, and then follow \nthe instructions.\n3.To unzip a single file or folder, double-click the zipped folder to open it. Then, drag or copy the item from the zipped folder to a new location.\nPractical Exercise 1.4\nPractice the following in a small group.\n1.Open Microsoft Word and write a paragraph about the Ethiopian Renaissance Dam and save it at any drive you like in the file name AbayDam.\n2. Compress the file in the same location.\n3. Unzip the file on the desktop.4.Insert any file from your computer into the zip folder AbayDam and send \nit to any external storage device.\n1.11 Deleting a File\n Brainstorming \n1. Do you think that it is important to delete a file? Why?\n2. Can you delete a file you have saved into C-drive of your computer?\nFile deletion is the removal of a file from a computer’s file system. The Recycle \nBinis a location where deleted files or folders are temporarily stored in all versions \nof Windows operating systems. To delete a file, a folder or multiple selected files, \nyou need to right-click on the file and select Delete. Alternatively, you can select"
        },
        {
            "page_number": 33,
            "text": "26Unit 1 : Organization of Files\nthe file and hit the Delete key on the keyboard. When you delete a folder, you \ndelete all its contents as well. You may get a dialog prompt that asks if you want \nto move the file to the recycling bin. In Windows, Recycle Bin icon is located on the desktop as shown in Figure 1.20 below.\nFigure 1.20 Recycle Bin icon\nWe may need to delete files or folders for various reasons. Some of the reasons \nare:\nFreeing the disk space.\nRemoving duplicated or unnecessary data to avoid confusion.\nMaking sensitive information unavailable to others.\nThe following activity will help you to delete unwanted files from folders of your computer.\nPractical Exercise 1.5\nWork in a group. Find and open any folder that contains the file you want to delete and follow the steps below. \n1.Right-click the file you want to delete. If you need to remove more than one files, select all the files you want to delete. \n2. Click Delete; then the Delete File dialog box appears. \n3. Click Yes. \nNote: Check that the file disappears from its original location.\nAnother way to delete a file is to click and drag it to the desktop’s \nRecycle Bin icon. \nYou can hold down the shift key and hit the Delete key when you \nwant to delete a file to prevent it from going to the Recycle Bin. This \nwill remove the file totally from your computer."
        },
        {
            "page_number": 34,
            "text": "Grade 10 Information Technology Student’s Textbook \n  27KEY CONCEPTS\nFile deletion is the removal of a file from a computer’s file system.\nRecycle Bin  is the location where deleted files or folders are temporarily \nstored in a computer. \nTo delete a file, a folder or multiple selected files, right-click on the file \nand select Delete.  You can also select the file and hit the Delete key on the \nkeyboard. Deleting a folder deletes all its contents as well.\n1.12 Restoring Deleted File\n Brainstorming \n1. Why do you think restoring a file is required?\n2. How could we restore deleted files?\nFiles deleted from your computer’s hard drive will not be removed immediately; \nthey will be automatically moved to the Recycle Bin. \nIt is possible to restore the deleted files. Data restoration is the process of \ncopying backup data from secondary storage and returning it to its original or a new location. Restoration is performed to return the lost, stolen or damaged data \nto their original conditions or to move to new locations. You will practice how \nto restore a deleted file from your computer in Activity 1.7.\n1.A deleted file cannot be restored by the flowing conditions.\nThe file you deleted is not in the Recycle Bin. \nThe Recycle Bin is emptied permanently.\nThe file is deleted using the shift key (shift key + Delete) on the \nkeyboard.\n2. To empty the Recycle Bin in Windows:Find the Recycle Bin icon on the desktop.\nRight-click (or press and hold) and select Empty Recycle Bin."
        },
        {
            "page_number": 35,
            "text": "28Unit 1 : Organization of Files\nActivity 1.7\nWork in a group to practice restoring deleted files.\n1. Double-click Recycle Bin icon in the desktop.\n2.The Recycle Bin folder appears. The files currently in the Recycle Bin will \nbe displayed. \n3. Right-Click the file you want to restore.\n4. Click Restore this item, see Figure 1.21.5.Observe that the file disappears from the recycling bin and will be restored \nto its original location.\nFigure 1.21 File restore\nKEY CONCEPTS\nData restore is the process of copying backup data from secondary storage and reinstating it to its original or a new location. Restoration is performed to return data that has been lost, stolen or damaged to its original condition or to move data to a new location."
        },
        {
            "page_number": 36,
            "text": "Grade 10 Information Technology Student’s Textbook \n  291.13 Unit Summary\nA file is the basic unit of storage that enables a computer to distinguish one set of \ninformation from another file. It is the common storage unit in computers where \nall programs and data are “written” into and “read” from. A folder holds one or more files, and it can be empty until it is filled. A folder can also contain other folders, so there can be many levels of folders within it.\nPrograms, files and folders can be found in a virtual location called folder. \nAfolder, which is also called a directory, is a tool for arranging files on a disk. \nFiles are organized by storing related data in the same directory. In naming a file, it would have two parts, with a period separating them. The part on the left side of the period character is called the main name while the part on the right side is \ncalled the extension. File extension shows the file type and the application that the \noperating system will use when opening it. Any file in the system can be located by following a path from the root or master directory down to various branches until the file is reached.\nFile import is the process of moving files or data from program to program; file \nexport is the process of moving information from program to file; file conversion \nis the process of changing a file from one format to another. \nRestoring is the process of copying backed-up data from a secondary location \nand returning it to its original device or a new device to create a copy of the data.  Backup and recovery describe the process of creating and storing copies of data that can be used to protect individuals and organizations against data loss. This is sometimes referred to as operational recovery.\nFile compression is a data compression method in which the logical size of a \nfile is reduced to save disk space for easier and faster transmission over a network or the Internet. It enables the creation of a version of one or more files with the same data at a size substantially smaller than the original file.\nFile deletion is the removal of a file from a computer’s file system. The Recycle \nBin is the location where deleted files or folders are temporarily stored in all \nversions of Windows operating systems. Data restoration is the process of \ncopying backup data from secondary storage and returning it to its original or a new location. Restoration is performed to return lost, stolen or damaged data to their original conditions or to move to new locations."
        },
        {
            "page_number": 37,
            "text": "30Unit 1 : Organization of Files\n1.14 Unit Review Exercise\nPart I:  Write whether the following statements are true or false.\n1. A file is a container in a computer system for storing information.\n2. A folder holds one or more files and can be empty until it is filled. 3.The operating system implements the abstract concept of a file by managing \nmass storage media and the devices.\n4.The purpose of backup is to create a copy of data that we use to recover in the event of a secondary data failure.\n5.File conversion is the process of taking a file of one format and changing it into another.\n6. File compression changes the contents of the original file.\n7.Files can be deleted by clicking and dragging them to the desktop’s Recycle \nBin icon.\nPart II: Choose the correct answer among the alternatives provided.\n1.________ is a self-contained piece of information available to the operating system and its programs.\nA. Record\nB. IconC. FileD. Data\n2. What do we call the organization of files and folders on a disk?\nA. Directory or directory treeB. PathC. File managementD. Root directory"
        },
        {
            "page_number": 38,
            "text": "Grade 10 Information Technology Student’s Textbook \n  313. Which one of the following is logical component of a file?\nA. Field\nB. Record C. DatabaseD. All of the above.\n4. What could be possible to do with a folder created and named?\nA. Moving it to another location.B. Renaming it.C. Creating other folders inside it.D. All of the above.\n5.The process of copying backed-up data from a secondary location and \nreturning it to its original or a new device is called ____________.\nA. recording\nB. restoringC. duplicatingD. resizing\n6.Which one of the following is among the fundamental aspects of file \nmanagement?\nA. OrganizingB.  Labeling C. Classifying D. All of the above.\n7.______ is the way an operating system’s file system and its files are displayed \nto the computer user.\nA. Directory structure\nB. Directory contentC. Directory NameD. Directory folder"
        },
        {
            "page_number": 39,
            "text": "32Unit 1 : Organization of Files\n8. Which of the following always start at the root directory and are unique?\nA. Relative file names\nB. Directory namesC. Absolute file namesD. Directory path names\n9._________ is a collection of files typically created for organizational purposes.\nA. DirectoryB. FileC. DriveD. Folder\n10. What do you call the suffix added to the base name of a computer file?\nA. Operating system identifierB. Program applicationC. Filename pathD. Filename extension\n11. Which one is not an extension for an image file?\nA. BMPB. GIFC. XLSD. JPG\n12._____________ is a software program required to manage and operate \ncomputing devices.\nA. Operating system\nB. File recoveryC. File searchD. File import and export\nPart III: Discuss the following questions.\n1. Explain how Operating System differentiates one file from another."
        },
        {
            "page_number": 40,
            "text": "Grade 10 Information Technology Student’s Textbook \n  332. What types of file extensions do the following contents have?\nA. A movie on a video CD\nB. A word-processed fileC. A file in a musical CDD. A scanned imageE. A picture was taken with a digital camera.F. A file sent in compressed format \n3. Discuss how to name a file and give examples of valid and invalid filenames.\n4.Differentiate between absolute and relative path names with appropriate \nexamples.\n5. Use Figure 1.22 below to answer the following questions.\nFigure 1.22 File directory"
        },
        {
            "page_number": 41,
            "text": "34Unit 1 : Organization of Files\na.Write out the absolute pathname for EXAM.DOC, TEST.TXT, SALARY.\nXLS and ARREARS.REC. \nb.Write out the relative pathname for DEPT.RTF and ID.MDB using STUDENTS and STAFF as the working directory respectively.\n6.Ethiopia sends a spreadsheet file called Budget2021 via email to his teacher. His teacher attempted to view the file in his web browser online but was unsuccessful. \na.What could be a possible cause of the problem Ethiopia’s teacher encountered?\nb.Suggest one solution that either Ethiopia or his teacher could do to rectify the problem?\nc.Show the file name that Ethiopia’s teacher would see when he opens the email. \n7. What is the definition of the term ‘drive’ as it relates to computing?\n8.List at least four types of drives available to store files on the computer system \nalong with their respective drive letters.\n9.Describe, using a step-by-step process, how to save a file you prepared in Microsoft Word as PDF.\n10. Define the following terms.\na. File path\nb. Disk drive  c. Folder \n11.Answer the following questions based on the file path below. C:\\Documents\\\nSchool\\Maths.Docx\na. What is shown in the file path above?  b. What does “C:\\” refer to?   \n12.Using Figure 1.23 below, provide the file path to get to the file: Communication.\npdf."
        },
        {
            "page_number": 42,
            "text": "Grade 10 Information Technology Student’s Textbook \n  35Figure 1.23 Determining the file path for the file, communication.pdf\n13.Identify the drive letter, folder, sub-folder, file name and extension in the the \nfollowing file paths and complete table 1.3. \na. c:\\Games\\Solitaire\\Solitaire.exe \nb. e:\\assignment\\IT\\hardware, Docxc. c:\\Program Files (x86) \\Calculator.exe\nTable 1.3 Identifying drive letter, folder, subfolder, filename, and extension\nNoDrive Letter Folder Sub-folder File Name Extension\na\nb\nc"
        },
        {
            "page_number": 43,
            "text": "36Unit 2 : Computer Network\n2.1 Unit Overview\nAs it was defined and discussed in grade 9, unit 2, the computer network is the \nconnection of two or more computers or communication devices connected by transmission media and guided by a set of rules for communication purposes \nthat allow users to communicate with each other and share applications and data. The fundamental components of a network are devices, media, messages and protocols. Figure 2.1 shows representation of network in a given school.\nFigure 2.1 Representation of network in school\nAt the end of this unit, learners will be able to:\nExplain transmission media.\nDescribe telecommunications network.\nExplain mobile and cellular communications.\nAnalyze satellite networks.\nDiscuss data communication.\nConceptualize the use of Internet protocols (IP).UNIT \nCOMPUTER NETWORK\nUNIT OUTCOMES2"
        },
        {
            "page_number": 44,
            "text": "Grade 10 Information Technology Student’s Textbook \n  37In this unit, you are going to learn about network media, telecommunications \nnetworks, mobile communications, cellular networks, satellite networks, data \ncommunications and internet protocol (IP).\n2.2 Network Media (Transmission Media)\n Brainstorming \n1. What do you think is a transmission medium?\n2. How are data transmitted in modern networks?\nFor data to be transmitted from one location to another, a physical pathway or \nmedium must be used. These pathways are called transmissions media and can be either physical or wireless. The physical transmission use wire, cable, and other tangible materials; wireless transmission media send communications signalsthrough the air or space. The physical transmission media are generally referred to as cable media (example, twisted pair wire, coaxial cable, and fiber optic cable).Wireless media include cellular radio, microwave transmission, satellite transmission, radio and infrared media.Modern networks primarily use three types of media to interconnect devices and to provide the pathway over which data can be transmitted. These media are:\nCopper cables\nGlass or plastic fibers (fiber optic cable)\nWireless transmission"
        },
        {
            "page_number": 45,
            "text": "38Unit 2 : Computer Network\nFigure 2.2 Network media\nThe signal encoding that must occur for the message to be transmitted is different \nfor each media type. On metallic wires, the data is encoded into electrical impulses that match specific patterns. Fiber optic transmissions rely on pulses of light, within either infrared or visible light ranges or in wireless transmission, and patterns of electromagnetic waves depict the various bit values. Different types of network media have different features and benefits.  All network media do not have the same characteristics and are appropriate for the same purpose.\nActivity 2.1\nDiscuss the following items in a group.\n1.What categories of transmission media could you use to communicate in school and local environment?\n2. Analyze characteristics of the signal in each media.\n3.Bring some physical media to the class and discuss how they are arranged \nto be used in the network. \n4. Explain factors to be considered while choosing a transmission medium\nKEY CONCEPTS\nSignal is an electric or electromagnetic form of data that passes over transmission media.\nA wire is a long thin piece of metal that is used to fasten things or to carry electric current. \nCategories of Network Media (Transmission Media)\nThe transmission medium can be divided into two broad categories: wired or guided media and wireless or unguided media, as shown in Figure 2.3."
        },
        {
            "page_number": 46,
            "text": "Grade 10 Information Technology Student’s Textbook \n  39\nFigure 2.3 Classification of transmission media\n2.2.1 Guided (Wired) Media \nGuided media are those that provide a conduit from one device to another. These \ninclude twisted-pair cable, coaxial cable and fiber-optic cable. A signal traveling \nalong any of these media is directed and contained by the physical limits of the medium. Twisted-pair and coaxial cables use metallic (copper) conductors that accept and transport signals in the form of electric current. Optical fiber is a cable that accepts and transports signals in the form of light.\nTwisted-pair Cable\nA twisted pair consists of two conductors (normally copper), each with its plastic insulation, twisted together as shown in Figure 2.4. One of the wires is used to carry signals to the receiver and the other is used only as a ground reference.\nIn addition to the signal sent by the sender on one of the wires, interference \n(noise) and crosstalk may affect both wires and create unwanted signals. \nFigure 2.4  Twisted-pair cable\nIf the two wires are parallel, the effect of these unwanted signals is not the same on both wires because they are at different locations relative to the noise or crosstalk sources (for example, one is closer and the other is farther). This results in a difference at the receiver."
        },
        {
            "page_number": 47,
            "text": "40Unit 2 : Computer Network\nBy twisting the pairs, a balance is maintained. For example, suppose in one \ntwist, one wire is closer to the noise source and the other is farther; in the next \ntwist, the reverse is true. The twisting makes it probable that both wires are equally affected by external influences (noise or crosstalk). Fundamentally, twisted pairs are classified as unshielded twisted-pair (UTP) and shielded twisted-pair (STP).\nUnshielded Twisted-Pair (UTP)\nUnshielded twisted-pair (UTP) isthe most common form of network cable. This \ncable format is used for the Ethernet wiring standards which are managed by the Institute of Electrical and Electronics Engineers (IEEE). These wiring standards \nare referred by code 802.3. \nThe Ethernet standards include specifications of cable configurations and the \ntypes of connectors used to plug cables into devices. \nFigure 2.5  UTP cable\nWhat we conventionally know as a network cable is an 802.3 specified cable \nfor Ethernet networks. This type of cable, which is shown in Figure 2.5, can block interference and does not depend on a physical shield for this purpose. In modern networks, UTP cables are considered in different categories starting from cat1 to cat7 and so on."
        },
        {
            "page_number": 48,
            "text": "Grade 10 Information Technology Student’s Textbook \n  41UTP Cable Connectors\nThe most common UTP connector is RJ45. RJ stands for registered jack, implying \nthat the connector follows a standard borrowed from the telephone industry, as \nshown in Figure 2.6. The RJ45 is a keyed connector, meaning the connector can be inserted in only one way. UTP cabling, terminated with RJ45 connectors, is \na common copper-based medium for interconnecting network devices such as computers with intermediate devices like routers and network switches.\nFigure 2.6 UTP connector\nUTP cables are wired according to different wiring conventions. The individual \nwires in the cable have to be connected in different orders to different sets of pins in the RJ45 connectors. \nEthernet straight-through and Ethernet crossover are the main cable types \nthat are obtained by using specific wiring conventions (see Figure 2.7).\nFigure 2.7 Ethernet cable color coding a) cross-over  b)Straight-through \nThe straight-through is the most common type and is used to connect \ncomputers to hubs or switches (connect different network devices). They are most likely what you will find when you go to your local computer laboratory. Crossover Ethernet cable is more commonly used to connect a computer to a computer (connect similar network devices) and may be a little harder to find since they are not used nearly as much as a straight-through Ethernet cable."
        },
        {
            "page_number": 49,
            "text": "42Unit 2 : Computer Network\nWhen electromagnetic signals are conducted on copper wires that are \nnearby (such as inside a cable), some electromagnetic interference occurs. This \ninterference is called crosstalk.  Twisting two wires together as a pair minimizes such interference and also provides some protection against interference from outside sources. \nUnshielded twisted pair is subject to external electromagnetic interference, \nincluding interference from nearby twisted pairs and noise generated in the environment. In an environment with several sources of potential interference (for example, electric motors, wireless devices and radio frequency (RF) transmitters), a shielded twisted-pair (STP) may be a preferred solution.\nShielded Twisted-Pair (STP)\nThis type of cable, as shown in Figure 2.8, consists of a special jacket to block external interference. It is used in fast-data-rate Ethernet and voice and data channels of telephone lines.\nFigure 2.8 Shield twisted-pair\nShielded twisted-pair (STP) cable combines the techniques of cancellation and \ntwisting of wires with shielding.  Each pair of wires is wrapped in metallic foil to further shield the wires from noise.  The four pairs of wires are then wrapped in an overall metallic braid or foil.  STP reduces electrical noise from the cable (crosstalk) and outside the cable (EMI and RFI).Practical Exercise 2.1\nDo the following exercises in a group.\n1.Practice color code arrangements of straight-through and cross-over cables.\n2. Practice UTP cabling in your school laboratory.\n3. Connect any two computers using UTP cable cat5, cat 6 or cat 7."
        },
        {
            "page_number": 50,
            "text": "Grade 10 Information Technology Student’s Textbook \n  43Activity 2.2\nDiscuss the following points in a group.\n1. Discuss the term signal.\n2.Compare and contrast unshielded twisted-pair (UTP) and shield twisted-\npair (STP).\nCoaxial Cable\nCoaxial cable (or coax), as shown in Figure 2.9, carries signals of higher frequency ranges than those in twisted pair cable in part because the two media are constructed quite differently. Instead of having two wires, coax has a central core conductor of solid or stranded wire (usually copper) enclosed in an insulating sheath which is, in turn, encased in an outer conductor of metal foil, a combination of the two. The outer metallic wrapping serves both as a shield against noise and the second conductor which completes the circuit. This outer conductor is also enclosed in an insulating sheath and the whole cable is protected by a plastic cover.\nFigure 2.9 Coaxial cableKEY CONCEPTS\nRJ45 stands for Registered Jack 45.\nElectromagnetic (EM) waves are waves that are created as a result of vibrations between electric and magnetic fields. In other words, EM waves are composed of oscillating magnetic and electric fields.\nRF is short for radiofrequency. RF is any frequency within the electromagnetic spectrum which is associated with radio wave propagation. When an RF current is supplied to an antenna, an electromagnetic field is created and then able to travel or propagate through space."
        },
        {
            "page_number": 51,
            "text": "44Unit 2 : Computer Network\nCoaxial cables are available in a variety of thicknesses, with two primary \nphysical types: thick coaxial cable and thin coaxial cable, as shown in Figure 2.10. \nThick coaxial cable ranges in size from approximately 6 to 18 mm (1/4 to 3/4 inch) in diameter. \nFigure 2.10  Thick and thin coaxial cables\nThe thin coaxial cable is approximately 4 mm (less than 1/4 inch) in diameter. \nCompared to a thick coaxial cable which typically carries broadband signals, a thin coaxial cable has limited noise isolation and typically carries baseband signals. Thick coaxial cable has better noise immunity and is generally used for the transmission of analog data such as single or multiple video channels.\nCoaxial Cable Connectors\nTo connect coaxial cables to devices, we need coaxial connectors. The most common type of connector used today is the Bayonet Neill-Concelman (BNC) \nconnector.  Figure 2.11 shows three popular types of these connectors: the BNC connector, the BNC T connector, and the BNC terminator.\nFigure 2.11 BNC connector"
        },
        {
            "page_number": 52,
            "text": "Grade 10 Information Technology Student’s Textbook \n  45Practical Exercise 2.2\nAnswer the following exercises in a group and demonstrate them to class.\n1.Bring some of the coaxial cable and its connector to class and demonstrate \ntheir connection.\n2.Telecommunications office provides Internet service at home for Individuals’ use; explain the technologies used to provide Internet services.\nKEY CONCEPTS\nEthernet is the traditional technology for connecting devices in a wired local area network (LAN) or wide area network (WAN).\nUnshielded twisted-pair (UTP) is a ubiquitous type of copper cabling used in telephone wiring and local area networks (LANs). There are different types of UTP cables - identified with the prefix CAT, as in category - each supporting a different amount of bandwidth.\nCoax, short for coaxial, is a type of cable used to transmit data, the internet, \nvideo and voice communications.\nElectromagnetic is used to describe the electrical and magnetic  forces or \neffects produced by an electric current.\nFiber-optic Cable\nFiber-optic cabling uses either glass or plastic fibers to guide light impulses, Figure 2.12, from source to destination. The bits are encoded on the fiber as light impulses .  Fiber optic cabling consists of a center glass core surrounded \nby several layers of protective materials. It transmits light rather than electronic signals eliminating the problem of electrical interference. This makes it ideal for certain environments that contain a large amount of electrical interference. It has also made it the standard for connecting networks between buildings due to its immunity to the effects of moisture and lighting."
        },
        {
            "page_number": 53,
            "text": "46Unit 2 : Computer Network\nFigure 2.12 Fiber optic cable\nFiber optic cable can transmit signals over much longer distances than coaxial \nand twisted pairs. It can also carry information at vastly greater speeds. This \ncapacity broadens communication possibilities to include services such as video conferencing and interactive services. \nThere are two common types of fiber cable: single mode and multimode \ncables. Multimode cable has a larger diameter; however, both cables provide high bandwidth at high speeds. The single mode cable can provide more distance, but it is more expensive.\nFiber-optic Cable Connectors\nThere are three types of connectors for fiber-optic cables, as shown in Figure 2.13. These are subscriber channel (SC), straight-tip (ST) and Mechanical Transfer Registered Jack (MT-RJ) connectors. The subscriber channel (SC) connectoris used for cable TV. It uses a push/pull locking system. The straight-tip (ST ) \nconnector is used for connecting cables to networking devices. It uses a bayonet locking system and is more reliable than SC . MT-RJ is a connector that is the \nsame size as RJ45.\nFigure 2.13 Fiber-optic cable connectors"
        },
        {
            "page_number": 54,
            "text": "Grade 10 Information Technology Student’s Textbook \n  47Activity 2.3\nDo the following activities in a group.\n1.If an internet service provider (ISP) needs to connect offices from Addis \nAbaba to Bahir Dar, which types of cable do you think are relevant to this connection?\n2. Explain the importance of the protection of these cables from damage.\n3.Suppose you need to connect 20 computers to a local area network (LAN); \nwhich cable do you think is relevant?(Why?)\n4.Explain the advantages and disadvantages of fiber optics cable over other copper cables.\nPractical Exercise 2.3\nDo the following activity in a group.\nRefer to Figure 2.14 and visit the installation of fiber- optics and twisted-pair cables in your school and present what observed to your classmates.\nFigure 2.14 Fiber-optic backbone with CAT 6 twisted pair running to the work -\nstations"
        },
        {
            "page_number": 55,
            "text": "48Unit 2 : Computer Network\n2.2.2 Unguided (Wireless) Media \nUnguided media transport electromagnetic waves without using a physical \nconductor. This type of communication is often referred to as wireless \ncommunication. Signals are normally broadcast through free space and thus are available to anyone who has a device capable of receiving them. Figure 2.15 shows categories of wireless transmission.\nFigure 2.15 Categories of wireless transmission waves\nUnguided signals can travel from a given source to its destination in several \nways: ground propagation, sky propagation and line-of-sight propagation. Figure 2.16 shows propagation methods.\nIn-ground propagation, radio waves travel through the lowest portion of \nthe atmosphere, hugging the earth. These low-frequency signals emanate in all directions from the transmitting antenna and follow the curvature of the planet. Distance depends on the amount of power in the signal. The greater the power, the greater the distance will be.\nFigure 2.16 Propagation methods"
        },
        {
            "page_number": 56,
            "text": "Grade 10 Information Technology Student’s Textbook \n  49In sky propagation , higher-frequency radio waves radiate upward into the \nionosphere (the layer of the atmosphere where particles exist as ions) where they \nare reflected on earth. This type of transmission allows for greater distances with lower output power.\nIn line-of-sight propagation, very high-frequency signals are transmitted in \nstraight lines directly from antenna to antenna. Antennas must be directional, facing each other and either tall enough or close enough together not to be affected by the curvature of the earth. Line-of-sight propagation is tricky because radio transmissions cannot be completely focused.\na. Radio Waves\nAlthough there is no clear-cut demarcation between radio waves and microwaves, electromagnetic waves ranging in frequencies between 3 kHz and 1 GHz are normally called radio waves; waves ranging in frequencies between 1 and 300 GHz are called microwaves. However, the behavior of the waves, rather than the frequencies, is a better criterion for classification.\nRadio waves, for most parts, are omnidirectional. When an antenna transmits \nradio waves, they are propagated in all directions. This means that the sending and receiving antennas do not have to be aligned. A sending antenna sends waves that can be received by any receiving antenna. The omnidirectional property has a disadvantage too. The radio waves transmitted by one antenna are susceptible to interference by another antenna that may send signals using the same frequency or band. Radio waves, particularly those that propagate in the sky mode, can \ntravel long distances. This makes radio waves a good candidate for long-distance broadcasting such as AM radio.\nOmnidirectional Antenna\nRadio waves use omnidirectional antennas that send out signals in all directions. Based on the wavelength, strength and purpose of transmission, we can have several types of antennas. Figure 2.17 shows an omnidirectional antenna.\nFigure 2.17 Omnidirectional antenna"
        },
        {
            "page_number": 57,
            "text": "50Unit 2 : Computer Network\nThe omnidirectional characteristics of radio waves make them useful for \nmulticasting, in which there is one sender but many receivers. AM and FM \nradio, television, maritime radio, cordless phones and paging  are examples of \nmulticasting.\nb. Microwaves\nA microwave is a line-of-sight wireless communication technology that uses \nhigh-frequency beams of radio waves to provide high-speed wireless connections \nthat can send and receive voice, video and data information. Microwaves are unidirectional. When an antenna transmits microwaves, it can be narrowly focused. This means that the sending and the receiving antennas need to be aligned. The unidirectional property has an obvious advantage. A pair of antennas can be aligned without interfering with another pair of aligned antennas.\nActivity 2.4\nDiscuss the following items in a group.\n1. Explain the term unguided media.\n2. Describe the fundamental characteristics of microwave propagation.3.Summarize the advantages of microwave technology in today’s \ncommunication system.\n4. Compare and contrast omnidirectional and unidirectional antennas.\nUnidirectional Antenna\nMicrowaves need unidirectional antennas that send out signals in one direction. Two types of antennas are used for microwave communications: parabolic dish and horn (see Figure 2.18).\nFigure 2.18  Unidirectional antenna"
        },
        {
            "page_number": 58,
            "text": "Grade 10 Information Technology Student’s Textbook \n  51A parabolic dish antenna is based on the geometry of the parabola where \nevery line is parallel to the line of symmetry (line of sight). Figure 2.18 portrays \nthe curve at angles such that all the lines intersect in a common point called the focus. The parabolic dish works as a funnel, catching a wide range of waves and directing them to a common point. More of the signal is recovered in this way than a single-point receiver.\nFigure 2.19 Microwave antenna\nIn microwave communications, line-of-sight devices must be placed in \nrelatively high locations. Information is converted to a microwave signal, sent through the air to a receiver, and recovered.\nA horn antenna  looks like a gigantic scoop. Outgoing transmissions are \nbroadcast up a stem (resembling a handle) and deflected outward in a series of narrow parallel beams by the curved head. Received transmissions are collected by the scooped shape of the horn, like the parabolic dish, and are deflected down into the stem.\nApplications of Microwave Technologies\nMicrowaves, due to their unidirectional properties, are very useful when unicast (one-to-one) communication is needed between the sender and the receiver. They are used in cellular phones, satellite networks  and wireless LANs (which will \nbe discussed in the next sections of this unit)."
        },
        {
            "page_number": 59,
            "text": "52Unit 2 : Computer Network\nActivity 2.5\nDo the following activities in a group.\n1. Explain the application area of radio waves, microwaves and infrared.\n2.Discuss how microwave antennas and their accessories are protected in \nyour local environment.\n3. Explain the difference between omnidirectional and unidirectional waves.\n4. Discuss the advantages of wireless media over wired ones.\nc. Infrared Waves\nInfrared, which is sometimes called infrared light, is electromagnetic radiation \nwith wavelengths longer than those of visible lights. It is therefore invisible to the human eye. For example, you use infrared light waves to change channels on your TV. Figure 2.20 shows the remote control, which is an example of infrared wave device.\nFigure 2.20 Remote control\nKEY CONCEPTS\nElectromagnetic (EM) waves are waves that are created as a result of vibrations between an electric field and a magnetic field. Electromagnetic waves are formed when an electric field comes in contact with a magnetic field. They are, hence, known as electromagnetic waves.\nOmnidirectional means being in or involving all directions, especially receiving or sending radio waves equally well in all directions. \nOmnidirectional antenna is a wireless transmitting or receiving antenna that radiates or intercepts radio-frequency (RF) electromagnetic fields equally well in all horizontal directions in a flat, two-dimensional (2D) geometric plane."
        },
        {
            "page_number": 60,
            "text": "Grade 10 Information Technology Student’s Textbook \n  53Radio waves are types of electromagnetic radiation with the longest \nwavelengths in the electromagnetic spectrum, typically with frequencies of less or equal to 300 gigahertz (GHz). They are used in standard broadcast radio and television, shortwave radio, navigation and air-traffic control, cellular telephony and even remote-controlled toys.\n2.3 Telecommunications Network\n Brainstorming \n1. Can you describe the term telecommunication networks?\n2. Can you mention the importance of telecommunication?3. What are services offered by a telecommunication system?\n2.3.1 Telecommunications Concepts\nThe term telecommunications generally refer to all types of long-distance \ncommunication that use common carriers, telephone, radio, and television. It is the exchange of information in any form (voice, data, text, images, audio, and video) over networks. Data communications is a subset of telecommunications and is achieved through the use of telecommunication technologies.\nIn modern organizations, communications technologies are integrated. \nBusinesses are finding electronic communications essential for minimizing time and distance limitations. Telecommunications plays a special role when customers, suppliers, vendors, and regulators are part of a multinational organization in a world that is continuously awake and doing business somewhere 24 hours a day, 7 days a week (“24/7”). Figure 2.21 represents a model of an integrated computer and telecommunications system common in today’s business environment.\nTelecommunications system\nA telecommunications system is a collection of compatible hardware and software arranged to communicate information from one location to another. These systems can transmit text, data, graphics, voice, documents, or video information. A typical telecommunications system is shown in Figure 2.22. Such systems have"
        },
        {
            "page_number": 61,
            "text": "54Unit 2 : Computer Network\ntwo sides: the transmitter and the receiver. The major components are:\n1. Hardware— all types of computers and communications processors (such as \na modems or small computers dedicated solely to communications).\n2.Communications media— the physical media through which electronic \nsignals are transferred; includes both wireline and wireless media.\n3.Communications networks— the linkages among computers and communications devices.\n4.Communications processors— devices that perform specialized data communication functions; includes front-end processors, controllers, multiplexors and modems.\n5.Communications software—software that controls the telecommunications system and the entire transmission process.\n6.Data communications providers— regulated utilities or private firms that provide data communications services.\n7.Communications protocols—the rules for transferring information across the system.\n8.Communications applications— electronic data interchange (EDI), teleconferencing, videoconferencing, e-mail, facsimile, electronic funds transfer, and others.\nFigure 2.21 General telecom network components\nTo transmit and receive information, a telecommunications system must \nperform the following separate functions that are transparent to the user:\nTransmit information.\nEstablish the interface between the sender and the receiver."
        },
        {
            "page_number": 62,
            "text": "Grade 10 Information Technology Student’s Textbook \n  55Route messages along the most efficient paths.\nProcess the information to ensure that the right message gets to the right \nreceiver.\nCheck the message for errors and rearrange the format if necessary.\nConvert messages from one speed to that of another communications line or from one format to another.\nControl the flow of information by routing messages, polling receivers, and maintaining information about the network.\nSecure the information at all times.\nFigure 2.22 A modem converts digital to analog signals and vice versa.\nElectronic Signals\nTelecommunications media can carry two basic types of signals, analog and digital (see Figure 2.22). Analog signals are continuous waves that “carry” information by altering the amplitude and frequency of the waves. For example, sound is analog and travels to our ears in the form of waves— the greater the height (amplitude) of the waves, the louder the sound; the more closely packed the waves (higher frequency), the higher the pitch. Radio, telephones, and recording equipment historically transmitted and received analog signals, but they are rapidly changing to digital signals.Digital signals are discrete on-off pulses that convey information in terms of 1’s and 0’s, just like the central processing unit in computers. Digital signals have several advantages over analog signals. First, digital signals tend to be less affected by interference or “noise.” Noise (e.g., “static”) can seriously alter the information carrying characteristics of analog signals, whereas it is generally easier, in spite"
        },
        {
            "page_number": 63,
            "text": "56Unit 2 : Computer Network\nof noise, to distinguish between an “on” and an “off.” Consequently, digital \nsignals can be repeatedly strengthened over long distances, minimizing the effect of any noise. Second, because computer-based systems process digitally, digital communications among computers require no conversion from digital to analog to digital.Communications processors are hardware devices that support data transmission \nand reception across a telecommunications system. These devices include modems,multiplexers, front-end processors, and concentrators.Modem- a modem is a communications device that converts a computer’s digitalsignals to analog signals before they are transmitted over standard telephone lines. The public telephone system (called POTS for “Plain Old Telephone Service”) was designed as an analog network to carry voice signals or sounds in an analog wave format. In order for this type of circuit to carry digital information, that information must be converted into an analog wave pattern. The conversion from digital to analog is called modulation, and the reverse is demodulation. The device that performs these two processes is called a modem; a contraction of the terms modulate/ demodulate (see Figure 2.22). Modems are always used in pairs.\n2.3.2 The Importance of Telecommunications\nAdvances in telecommunications technology allow us to communicate rapidly and learn at distance. Education sectors can take advantage of this technology and communicate almost anywhere in the world. In the business sector, telecommunications also reduce the amount of time needed to transmit information that can drive and conclude business actions. \nFigure 2.23 Telecommunications in business"
        },
        {
            "page_number": 64,
            "text": "Grade 10 Information Technology Student’s Textbook \n  57The range of telecommunications applications is broad and includes telephony \nand video conferencing, facsimile, broadcast and interactive television, instant \nmessaging, e-mail, distributed collaboration, a host of Web- and Internet-based communication, and data transmission.\nIn general, telecommunications create an impact on the everyday activities \nof people all over the world. Through telecommunications, people can develop solutions and provide support to causes and problems across the world, hence, making it a closer and safer place to live in. For example, to take advantage of telecommunications, Ethio-telecom is installing 4G LTE advanced (this will be discussed under section 2.4 of this textbook) across all regions.\nFigure 2.24  4GLTE\nActivity 2.6\nDo the following activities individually.\n1.Explain the term telecommunications  and its system components. (Refer to \nfigures 2.21 and 2.22).\n2.Currently, what are the fundamental effects of telecommunications systems in our daily life?\n3.Define and discuss the terms modem and multiplexer in telecommunications \nsystems.\n4.For what purposes do students may use telecommunications technologies in school/local villages? What could be the impact of these technologies on their daily lives?\n5. Discuss the implications of telecommunications system in business."
        },
        {
            "page_number": 65,
            "text": "58Unit 2 : Computer Network\nKEY CONCEPTS\nThe term telecommunications refers to all types of long-distance \ncommunication that use common carriers, telephone, radio and television \nfor the exchange of information in any form (voice, data, text, images audio and video) over networks.\nTelecommunications system is a collection of compatible hardware and software arranged to communicate information from one location to another.\nTelecommunications network components are terminals (inputs used to transmit and receive data), telecom processors (devices that perform control and provide support function), telecom channels (media for transmission of information), various computer and telecom control software (programs that control telecom activities). \n2.4 Mobile Communications\nMobile communication is the use of technology that allows us to communicate with others in different locations without the use of any physical connection (wires or cables). Mobile communication saves time and effort and makes our life easier. The following sections discuss basic mobile communications technologies.\n2.4.1 A Bluetooth Network \nBluetooth technology  is a short-range wireless communications technology to \nreplace the cables connecting electronic devices, allowing a person to have a phone conversation via a headset. Figure 2.25 shows a Bluetooth headset. Brainstorming \n1. Can you describe what is meant by mobile communication?\n2. Where and when do you think Bluetooth technology is so important?3. What is wireless LAN?"
        },
        {
            "page_number": 66,
            "text": "Grade 10 Information Technology Student’s Textbook \n  59\nFigure 2.25 Example of a Bluetooth headset\nThe Bluetooth Radio Frequency transceiver operates in the unlicensed \nIndustrial, Scientific, and Medical (ISM) band centered at 2.4 gigahertz (the same \nrange of frequencies used by microwaves and Wi-Fi). Every Bluetooth-enabled device in the system can establish a connection via pairing and can communicate with each other. Figure 2.26 shows a Bluetooth connection. \nFigure 2.26 Bluetooth connection \nActivity 2.7\nAnswer the following activities in a small group.\n1. Analyze the advantages of Bluetooth over other wireless technologies.\n2.Use your mobile phones and share at least two messages with your nearby \nfriends’ via Bluetooth.\n3. Discuss the basic features of Bluetooth."
        },
        {
            "page_number": 67,
            "text": "60Unit 2 : Computer Network\n2.4.2 Wireless Local Area Network (WLAN)\nWith the success of wired local area networks (LANs), the local computing market \nis moving toward wireless LAN (WLAN) with the same speed as the current wired LAN. It is a communication system established through the use of radio frequency (RF) technology that can function either as an extension to an existing LAN or as an alternative for a wired LAN. There is a need for an access point (AP) that bridges wireless LAN traffic into the wired LAN. Figure 2.27 shows WLAN.\nFigure 2.27 Wireless local area network (WLAN)\nWireless local area networks are flexible data communication systems that \ncan be used for applications in which mobility is required. This gives users the \nability to move around within a local coverage area and still be connected to the network. \nCurrently, WLANs can provide data rates up to 11 Mbps, but the industry \nis making a move toward high-speed WLANs. The high speed makes WLANs a promising technology for the future data communications market. The International Enterprise for Electronics Engineering (IEEE) 802.11 committee is responsible for WLAN standards. Most modern WLANs are based on IEEE 802.11 standards and marketed under the Wi-Fi brand name."
        },
        {
            "page_number": 68,
            "text": "Grade 10 Information Technology Student’s Textbook \n  61Figure  2.28 APs overlap.\nThe access point (AP), can also act as a repeater for wireless nodes, effectively \ndoubling the maximum possible distance between nodes. To service larger areas, \nmultiple APs may be installed with a 10-15% overlap. Figure 2.28 above shows the access points overlap.\nActivity 2.8\nAnswer the following activities in a group.\n1. Discuss the fundamental components of WLAN (Refer to Figure 2.27).\n2. Analyze wireless LAN and report to the class based on: \na. Its implication to learning in school.\nb. Advantages and disadvantages.c. Similarities and differences with wired local area network.\n3.Visit WLAN (Wi-Fi) at your school or local environment and report its \nimplication to business to your class.\n4. Summarize the role of access points in WLAN. \n5. Describe the advantages of overlapping the access points?"
        },
        {
            "page_number": 69,
            "text": "62Unit 2 : Computer Network\nKEY CONCEPTS\nMobility is the ability to move freely.\nBluetooth is a wireless technology that uses a radio frequency to share data \nover a short distance, eliminating the need for wires. You can use Bluetooth on your mobile device to share documents or to connect with other Bluetooth-enabled devices.\nElectromagnetic fields, radio waves, microwaves and wireless signals are referred to as radio frequency (RF) energy.\nWireless local area networking, also known as WLAN or wireless LAN, is a term used to refer to wireless digital signals to connect computers and other devices. \n2.5 Cellular Networks\nA cellular network or mobile network is a radio network distributed over land areas called cells, each served by at least one fixed-location transceiver, which is known as a cell site or base station.\nA cellular network is designed to provide communications between two \nmoving units (called mobile stations (MSs)), or between one mobile unit and one stationary unit (often called a land unit). A service provider must be able to locate and track a caller, assign a channel to the call and transfer the channel from the base station to the base station as the caller moves out of range. To make this tracking possible, each cellular service area is divided into small regions  called \ncells. Each cell contains an antenna and is controlled by a solar- or AC-powered network station called the base station (BS). Brainstorming \n1. How is your handheld device mobile?\n2. What are the services provided by cellular systems?3. In Ethiopia, which organization(s) provide(s) cellular system services?"
        },
        {
            "page_number": 70,
            "text": "Grade 10 Information Technology Student’s Textbook \n  63\nFigure 2.29 Cellular system\nEach base station is controlled by a switching office called a mobile switching \ncenter (MSC). The MSC coordinates communication between all the base stations \nand the telephone central office. It is a computerized center that is responsible for connecting calls, recording call information and billing. Figure 2.29 shows the cellular system.\nActivity 2.9\nDiscuss the following activities in a group.\n1. Describe the role of the cellular base station around you or at school.\n2. Explain how your hand-held device (mobile) accesses the base stations.3.Visit any Ethio-telecom office found in your local area and summarize the \nservices of a cellular system.\n4.Analyze how cell sizes are different from one another in the cellular system.\nKEY CONCEPTS\nCellular refers to a network technology that facilitates mobile device \ncommunication over areas comprised of cells and transceivers, which are also known as base stations or cell sites. In a cellular network, the most widely used mobile transceivers are mobile phones, or cell phones.\nBase station  is a fixed transceiver that is the main communication point for \none or more wireless mobile client devices. A base station serves as a central connection point for a wireless device to communicate.\nCell is a small geographic unit in a cellular system."
        },
        {
            "page_number": 71,
            "text": "64Unit 2 : Computer Network\nGeneration of Cellular System\nThe cellular communication networks are known by their numeric generation \nsuch as 1G, 2G, 3G and 4G designations. We are currently in the fourth generation \nwith 5G emerging.\nActivity 2.10\nDiscuss the following items and present them to the class.\n1. Discuss the basic characteristics and advantages of 1G, 2G and 3G cellular.\n2. Explain the fundamental reason to move from one generation to another.3. Analyze the difference between 1G, 2G, 3G, 4G and 5G.4. Describe your handheld device to which generation it complies. Why?5. Discuss advantages of cellular network over Wireless LAN.\na. Fourth Generation (4G)\nThe fourth generation of cellular telephony is expected to be a complete evolution \nin wireless communications.\nFigure 2.30 4G devices\nSome of the objectives defined by the 4G working group are:\nHigh network capacity.\nData rate of 100 Mbit/s for access in a moving car and 1 Gbit/s for stationary users.\nData rate of at least 100 Mbit/s between any two points in the world.\nSmooth handoff across heterogeneous networks.\nSeamless connectivity and global roaming across multiple networks."
        },
        {
            "page_number": 72,
            "text": "Grade 10 Information Technology Student’s Textbook \n  65High quality of service for next-generation multimedia support.\nInteroperability with existing wireless standards.\n4G is also known as mobile broadband everywhere.\n4G LTE\n4G LTE (long term evolution) is a type of 4G technology. It is a mobile broadband \ntechnology that promises data transfer rates of 100 Mbps. See Figure 2.24 for 4GLTE.\nb. 5G\n5G is the 5th generation mobile network and it is the latest in the evolution of mobile wireless technologies. 5G goes beyond 4G LTE and is expected to bring not just faster downloads, but a much more flexible and responsive network that can adapt to enable different uses. 5G enables a new kind of network that is designed to connect everyone and everything virtually including machines, objects and devices. Figure 2.31 shows the 5G network.\nFigure 2.31 5G network\n5G wireless technology is meant to deliver higher multi-Gbps peak data speeds, \nultra-low latency, more reliability, massive network capacity, increased availability and a more uniform user experience to more users. Higher performance and improved efficiency empower new user experiences and connect new industries."
        },
        {
            "page_number": 73,
            "text": "66Unit 2 : Computer Network\n2.6 Satellite Networks\n Brainstorming \n1. What is a satellite network?\n2.Which type of network do you think that television broadcast we watch at \nhome belongs to?\nA satellite network is a combination of nodes, some of which are satellites that provide communication from one point on the earth to another point. A node in the network can be a satellite, an earth station, an end-user terminal or a telephone. The fundamental components of a satellite system are earth stations, uplink, downlink and transponder. Satellites communicate with antennas on earth by using radio waves. Figure 2.32 shows components of the satellite network.\nFigure 2.32 Components of satellite system\nSatellite networks are like cellular networks in that they divide the planet \ninto cells. Satellites can provide transmission capability to and from any location on Earth, no matter how remote they are. This advantage makes high-quality communication available to undeveloped parts of the world without requiring a \nhuge investment in ground-based infrastructure."
        },
        {
            "page_number": 74,
            "text": "Grade 10 Information Technology Student’s Textbook \n  672.6.1 Orbits of Satellite\nAn artificial satellite needs to have an orbit, the path in which it travels around the \nEarth. The orbit can be equatorial, inclined or polar. Figure 2.33 shows satellite orbits.\nFigure 2.33 Satellite Orbits\n2.6.2 Categories of Satellites\nBased on the location of the orbit, satellites can be divided into three categories: geostationary Earth orbit (GEO), low-Earth-orbit (LEO) and medium-Earth-orbit (MEO). Figure 2.34 shows the satellite altitudes concerning the surface of \nthe Earth. There is only one orbit, at an altitude of 35,786 km, for the GEO satellite. MEO satellites are located at altitudes between 5000 and 15,000 km. LEO satellites are normally below an altitude of 2000 km.Activity 2.11\nAnswer the following activities individually.\n1. Describe the role of the satellite system in education.\n2. Explain each component of the satellite system as shown in Figure 2.32.3.Discuss the advantages of satellite systems over other wireless technologies.\n4.In Ethiopia, which part of the community do you think benefits more from \nthe satellite system?"
        },
        {
            "page_number": 75,
            "text": "68Unit 2 : Computer Network\nFigure 2.34 Satellite types and their orbit altitudes\nOne reason for having different orbits is the existence of two Van Allen belts. \nA Van Allen belt is a layer that contains charged particles. A satellite orbiting in \none of these two belts would be destroyed by the energetic charged particles. The MEO orbits are located between these two belts.\nKEY CONCEPTS\nA satellite is basically a self-contained communication system with the ability \nto receive signals from Earth and to retransmit those signals back with the use of a transponder - an integrated receiver and transmitter of radio signals.Activity 2.12\nAnswer the following activities in a group.\n1. Discuss satellite systems in your respective group and report to class. \n2.Among the categories of satellite systems, which one(s) correspond(s) to \nEthiopian satellite system?\n3. Visit a home dish system and report its basic installations to your class."
        },
        {
            "page_number": 76,
            "text": "Grade 10 Information Technology Student’s Textbook \n  69Satellite networks are defined as the orientation of various elements that \nestablish communication through various nodes from one point of the earth to another. Any satellite network can provide both types of transmission technologies, i.e. point to point as well as broadcasting connections.\nAn orbit is a regular, repeating path that one object in space takes around another one. An object in an orbit is called a satellite. A satellite can be natural like Earth and the moon. Many planets have moons that orbit them. A satellite can also be man-made like International Space Station.\n2.6.3 Data Communications\n Brainstorming \n1. What do you mean by data communication?\n2. Can you explain how data is communicated?\nData communication is a specialized subset of telecommunications that refers to \nthe electronic collection, processing, and distribution of data, typically between computer system hardware devices. The effectiveness of a data communication system depends on four fundamental characteristics: delivery, accuracy, timeliness and jitter.\n2.6.4 Components of Data Communication\nA data communications system has five components (see Figure 2.35).\nFigure 2.35 Five components of data communication"
        },
        {
            "page_number": 77,
            "text": "70Unit 2 : Computer Network\n2.6.5 Data Transmission Mode/Flow\nData transmission mode refers to the direction of signal flow between two linked \ndevices. Communication between two devices can be simplex, half-duplex or full-duplex. \nSimplex\nIn simplex mode, the communication is unidirectional, as on a one-way street. Only one of the two devices on a link can transmit; the other can only receive. Figure 2.36 shows simplex transmission.\nFigure 2.36 Example of simplex transmission\nKeyboards and traditional monitors are examples of simplex devices. The  \nkeyboard can only introduce input; the monitor can only accept output. The   sim -\nplex mode can use the entire capacity of the channel to send data in one direction.\nHalf-Duplex\nIn half-duplex mode, each station can both transmit and receive, but not at the same time. When one device is sending, the other can only receive and vice versa.\nThe half-duplex mode is like a one-lane road with traffic allowed in both \ndirections. When cars are traveling in one direction, other cars going the other way must wait. In half-duplex transmission, the entire capacity of a channel is taken over by whichever of the two devices is transmitting at the time. Figure 2.37 shows a half-duplex.\nFigure 2.37 Half-duplex"
        },
        {
            "page_number": 78,
            "text": "Grade 10 Information Technology Student’s Textbook \n  71The half-duplex mode is used in cases where there is no need for communication \nin both directions at the same time; the entire capacity of the channel can be \nutilized for each direction.\nFull-duplex\nIn full-duplex mode (also called duplex), both stations can transmit and receive simultaneously \nThe full-duplex mode is like a two-way street with traffic flowing in both \ndirections at the same time. In full-duplex mode, signals going in one direction share the capacity of the link with signals going in the other direction. This sharing can occur in two ways: either the link must contain two physically separate transmission paths, one for sending and the other for receiving, or the capacity of the channel is divided between signals traveling in both directions. Figure 2.38 shows the full-duplex.\nFigure 2.38 Full-duplex\nOne common example of full-duplex communication is the telephone network. \nWhen two people are communicating by a telephone line, both can talk and listen at the same time. The full-duplex mode is used when communication in both directions is required all the time. The capacity of the channel, however, must be divided between the two directions."
        },
        {
            "page_number": 79,
            "text": "72Unit 2 : Computer Network\n2.7 Internet Protocol\n Brainstorming \n1. Can you state what Internet protocol (IP) is?\n2.Can you identify the IP into which your computer is connected to the net -\nThe Internet Protocol (IP) is the principal communications protocol in \ninternetworking; it would not be an exaggeration to say that you cannot comprehend modern networking without a good understanding of IP. \n2.7.1 IP Address\nAn IP address is a unique address that identifies a device on the internet or a local network. As it is described earlier, IP stands for Internet Protocol, which is the set of rules governing the format of data sent via the internet or local network. In essence, IP addresses are the identifier that allows information to be sent between devices on a network; they contain location information and make devices accessible for communication. \nThe internet needs a way to differentiate among different computers, routers \nand websites. IP addresses provide a way of doing so and form an essential part of how the Internet works. The IP address has two fundamental versions: IPv4 and IPv6. IPv4 is a common version that can be used in current networks. IP v4 (version 4) addresses are 32-bit integers that can be expressed in hexadecimal notation. The most common format, known as dotted quad or dotted decimal, is x.x.x.x, where each x can be any value between 0 and 255. For example, 192.0. 2.146 is a valid IPv4 address.Activity 2.13\nDo the following activities in a group.\n1. Explain the fundamental characteristics of data communication.\n2.Refer back to grade 9 IT textbook and explain the terms data and \ncommunication .\n3.Explain the fundamental components of data communications that are \nillustrated in Figure 2.35."
        },
        {
            "page_number": 80,
            "text": "Grade 10 Information Technology Student’s Textbook \n  73Activity 2.14\nDo the following activities in a group.\n1.Discuss different types of IP address notation which are illustrated in          \nFigure 2.39.\n2. Discus the role of IP addresses in today’s communication network.\n3. How is IP address unique and universal?4. Compare and contrast IPv4 and IPv6.\nFigure 2.39 Three different notations in IPv4 addressing\n2.7.2 Classes of IP Address\nWhen Internet addresses were standardized (the early 1980s), the Internet address \nspace was divided into classes. TCP/IP defines five classes of IP addresses: Class A, B, C, D and E. Each class has a range of valid IP addresses. The value of the first octet determines the class.\nFigure 4.40 Classes of IP address"
        },
        {
            "page_number": 81,
            "text": "74Unit 2 : Computer Network\n IP addresses from the first three classes (A, B and C) can be used for host addresses. \nThe other two classes are used for other purposes. Class D is used for multicast and Class E for experimental purposes. Figure 2.40 and table 2.1 show classes of IP addresses.\nThe system of IP address classes was developed for Internet IP addresses \nassignment. The classes created were based on the network size. For example, Class A was created for the small number of networks with a very large number of hosts. Class C was created for numerous networks with a small number of hosts.\nClass A: The first octet is the network portion. Octets 2, 3 and 4 are for \nsubnets/hosts. Class A starts with 0.\nClass B: The first two octets are the network portion. Octets 3 and 4 are \nfor subnets/hosts. Class B starts with 10.\nClass C: The first three octets are the network portion. Octet 4 is for sub -\nnets/hosts. It starts with 110.\nTable 2.1 Classes of IP address\nIP Address \nClassHigh Order Bits First Octate       \nAddress RangeNumber of Bits in the \nNetwork Address\nClass A 0 0-127* 8\nClass B 10 128-191 16\nClass C 110 192-223 24\nClass D 1110 224-239 0\nClass E 1111 240-255 0\nNetwork Masks\nA network mask distinguishes which portion of the address identifies the network and which portion identifies the node.\nDefault Masks\nClass A: 255.0.0.0\nClass B: 255.255.0.0\nClass C: 255.255.255.0"
        },
        {
            "page_number": 82,
            "text": "Grade 10 Information Technology Student’s Textbook \n  75Activity 2.15\nAnswer the following items accordingly.\n1. Explain fundamental steps used to demonstrate IP address on Windows10 \ncomputer.\n2. Discuss the purpose of IP address.\n3. Find the class of each of the following addresses.\na. 00000001 00001011 00001011 11101111\nb. 1000001 10000011 00011011 11111111c. 10100111 11011011 10001011 01101111d. 11110011 10011011 11111011 00001111\n4. Rewrite the following IP addresses using the binary notation.\na. 110.11.5.88     b. 12.74.16.18  c. 201.24.44.32\n5.Open your computer on the network and identify the classes of the address \nand its subnet mask.\n6. Explain how IP addresses work.\nKEY CONCEPTS\nAn IP address is a unique address that identifies a device on the internet or \na local network. IP (Internet Protocol) is the set of rules governing the format of data sent via the internet or local network.\nNetmasks (or network masks) are shorthand for referring to ranges of consecutive IP addresses in the Internet Protocol. They are used for defining networking rules. Every entity (server or client) communicating on the internet will have a unique IP address."
        },
        {
            "page_number": 83,
            "text": "76Unit 2 : Computer Network\n2.8 Unit Summary\nA transmission medium can be broadly defined as anything that can carry \ninformation from a source to a destination. For example, the transmission medium for two people having a dinner conversation is the air. The air can also be used to convey the message in a smoke signal or semaphore. The transmission medium for a written message might be a mail carrier, a truck, or an airplane.\nA guided medium provides a physical conduit from one device to another. \nTwisted-pair cable consists of two insulated copper wires twisted together. Twisted-pair cable is used for voice and data communications. Coaxial cable consists of a central conductor and a shield. Coaxial cable is used in cable TV networks and traditional Ethernet LANs. Fiber-optic cables are composed of a glass or plastic inner core surrounded by cladding, all encased in an outside jacket. Fiber-optic transmission is becoming increasingly popular due to its noise resistance, low attenuation and high bandwidth capabilities. Fiber-optic cable is used in backbone networks, cable TV networks and fast Ethernet networks.\nUnguided media (free space) transport electromagnetic waves without the \nuse of a physical conductor. Wireless data are transmitted through ground propagation, sky propagation and line-of-sight propagation. Wireless waves can be classified as radio waves, microwaves or infrared waves. Radio waves are omnidirectional; microwaves are unidirectional. Microwaves are used for cellular phone, satellite and wireless LAN communications. Infrared waves are used for short-range communications such as those between a PC and a peripheral device. They can also be used for indoor LANs.\nThe nature and characteristics of a wireless network are different from those of \na wired network. There are some issues in a wireless network that are negligible in a wired network. Wireless communication is one of the fastest-growing technologies and the demand for connecting devices without the use of cables is increasing everywhere. Wireless networks, as the name implies, interconnect devices without using wires; instead they use air, radio frequency (RF ) as the \nmain transmission medium.\nBluetooth technology is a short-range wireless communications technology to \nreplace the cables connecting electronic devices, allowing a person to have a phone conversation via a headset, use a wireless mouse and synchronize information from a mobile phone to a PC, all using the same core system."
        },
        {
            "page_number": 84,
            "text": "Grade 10 Information Technology Student’s Textbook \n  77Telecommunications are the means of electronic transmission of information \nover distances. The information may be in the form of voice telephone calls, data, \ntext, images or video. Telecommunications link form a channel through which information is transmitted from a sending device to a receiving device.\nIn data communication terminology, a transmission medium is a physical path \nbetween the transmitter and the receiver; that is, it is the channel through which data is sent from one place to another. Transmission media is broadly classified into the following types:  guided and unguided.\nWLANs are flexible data communication systems that can be used for \napplications in which mobility is required.  In the indoor business environment, although mobility is not an absolute requirement, WLANs provide more flexibility than that achieved by the wired LAN.\nCellular network provides communication between two devices. One or both \nmay be mobile. A cellular service area is divided into cells. Advanced mobile phone system (AMPS) is a first-generation cellular phone system. Digital AMPS (D-AMPS) is a second-generation cellular phone system that is a digital version of AMPS. Global System for mobile communication (GSM) is a second-generation cellular phone system used in Europe. The third-generation cellular phone system provides universal personal communication. The fourth generation is the new generation of cellular phones that are becoming popular.\nSatellite networks are defined as the orientation of various elements that \nestablish communication through various nodes from one point of the earth to another. Any satellite network can provide both types of transmission technologies, i.e. point to point as well as broadcasting connections. A satellite network uses satellites to provide communication between any points on Earth. \nAn IP address is a unique address that identifies a device on the internet or \na local network. IP (Internet Protocol) is the set of rules governing the format of data sent via the internet or local network.\n2.9 Unit Review Exercise\nPart I: Write whether the following statements are true or false.\n1.Fiber-optic cables are composed of a glass or plastic inner core surrounded by cladding, all encased in an outside jacket."
        },
        {
            "page_number": 85,
            "text": "78Unit 2 : Computer Network\n2.Guided media transport electromagnetic waves without the use of a physical \nconductor.\n3.Infrared waves are used for short-range communications such as those between a PC and a peripheral device.\n4. Twisted-pair cable is used for voice and data communications.\n5. Satellite network does not influence the education system.6.Data communication is a specialized subset of telecommunications that refers \nto the electronic collection, processing and distribution of data.\n7.It is possible to achieve communication in the network without an IP address.\nPart II: Choose the correct answer among the alternatives provided.\n1.Which of the following cable consists of an inner copper core and a second conducting outer sheath?\nA. Twisted-pair\nB. Shielded twisted-pairC. CoaxialD. Fiber-optic\n2._____ cable can carry signals of higher frequency ranges than ____ cable.\nA. Coaxial; twisted-pairB. Twisted-pair; fiber-opticC. Coaxial; fiber-opticD. None of the above.\n3._______ are used for cellular phone, satellite and wireless LAN communications.\nA. Radio waves B. Infrared wavesC. MicrowavesD. None of the above."
        },
        {
            "page_number": 86,
            "text": "Grade 10 Information Technology Student’s Textbook \n  794.The inner core of an optical fiber is _________ in composition.\nA. copper\nB. glass or plasticC. bimetallicD. liquid\n5.What is the major factor that makes the coaxial cable less susceptible to noise \nthan twisted-pair cable?\nA. Insulating material\nB. Inner conductorC. Diameter of cableD. Outer conductor\n6.In fiber optics, the signal is __________ waves.\nA. radioB. lightC. infraredD. very-low-frequency\n7. Which of the following is not a guided medium?\nA. Fiber-optic cableB. Coaxial cableC. Twisted-pair cableD. Atmosphere\n8.Microwaves are _________.\nA. omnidirectionalB. bidirectionalC. unidirectionalD. None of the above."
        },
        {
            "page_number": 87,
            "text": "80Unit 2 : Computer Network\n9. Which of the following primarily uses guided media?\nA. Radio broadcasting\nB. Satellite communicationsC. Local telephone systemD. Cellular telephone system\n10.Transmission media are usually categorized as ___________.\nA. determinate or indeterminateB. fixed or unfixedC. guided or unguidedD. metallic or nonmetallic\nPart III: Discuss the following questions.\n1. Write the two major categories of transmission media.\n2. How is guide media different from unguided media?3. What are the three major classes of guided media?4. What is the function of the twisting in the twisted-pair cable?5. Name the advantages of optical fiber over twisted-pair and coaxial cable.6.Compare the medium of a wired LAN with that of a wireless LAN in today’s \ncommunication environment.\n7. Explain the role of the access points in WLAN.\n8. What are the basic components of WLAN?9. Compare and contrast Bluetooth and WLAN\n10.What is the relationship between a base station and a mobile switching center?\n11. What are the functions of a mobile switching center?12. What are the three types of orbits?13. Explain uplink and downlink in the satellite system.14. What is the difference between omnidirectional and unidirectional waves?"
        },
        {
            "page_number": 88,
            "text": "Grade 10 Information Technology Student’s Textbook \n  813.1 Unit overview\nYou learned basic concepts on word processing and spreadsheet in grade 9, unit \n3. In this unit, you are going to learn advanced topics such as creating table, formatting table, inserting pictures, clip arts and shapes, and formatting page numbers in word processor. Under spreadsheet, advanced topics are included like understanding and displaying formulas, functions, working with data, working with charts and applying different effects to a cell (formatting cells). Finally, you are going to learn other advanced topics such as using animation and transitions, and creating a slide master in PowerPoint.At the end of this unit, learners will be able to:\nCreate tables.\nOrganize and insert pictures, clip arts and shapes.\nExplain how page numbers are formatted.\nAnalyze mathematical operators on data to perform addition and others.\nSummarize functions such as filter, sort and rank.\nApply different effects to a cell and its contents.\nPrepare and present a slide show.\nCreate a slide master.UNIT \nAPPLICATION SOFTWARE\nUNIT OUTCOMES3"
        },
        {
            "page_number": 89,
            "text": "82Unit 3 : Application Software\n3.2 Word Processing\n Brainstorming \n1. Can you open and identify word processing on your school computer?\n2. Can you explain for why word processing is used?\nWord processing refers to the act of using a computer to create, edit, save and print \ndocuments. In order to perform word processing, specialized software (known as word processor) is needed. One example of word processor is Microsoft Word, but other word processing applications are also widely used. For the purpose of accessibility, we use Microsoft word in this textbook\n3.2.1 Creating a Table\nA table, such as the one shown in Figure 3.1 below, is an arrangement of data made up of horizontal rows and vertical columns. Cells are rectangles that are formed when rows and columns intersect. Tables are often used to organize and present information, but they have a variety of uses as well. You can use tables to align numbers and create interesting page layouts. Calendars, invoices and contact lists are examples of how tables are used every day. \nFigure 3.1 A table in word processor\nWord provides several options for creating tables  including dragging method, \ninserting table dialog box, table drawing tools and quick table method . \nDepending on the situation and availability of resources, you can use different versions of the word application."
        },
        {
            "page_number": 90,
            "text": "Grade 10 Information Technology Student’s Textbook \n  83a. Inserting a Table by Dragging\nIn this section, you will learn how easily and quickly you can create a table from \nthe Insert Table menu by dragging the mouse pointer to specify the number of \nrows and columns you need. Using this method, you can create a new, empty table as many as you like. Follow the following steps and insert a table by dragging. Before you begin these steps, launch Microsoft Word and open a new \nblank Word document.\n1.On the Insert tab, in the Tables group, click the table button. The Insert Table\nmenu appears.\n2.Point to the cell in the fifth column, second row. The menu title should read 5x2 table, as shown in Figure 3.2. Click the mouse button to create the table. Once the table is inserted into the document, you are ready to begin entering data.\nFigure 3.2 Inserting table menu\n3.Click below the table and press enter twice to insert blank lines. When you insert more than one table in a document, you should separate them with a blank line to avoid joining the tables.\n4. You can save the document as Table 1 in the folder on your drive."
        },
        {
            "page_number": 91,
            "text": "84Unit 3 : Application Software\nb. Using Insert Table Dialog Box\nIn the insert table dialog box, you can click the spin box arrows or type in the \nnumber of columns and rows you need in a table. You can use the document that is open from the previous exercise. The numbers used here are for practice; once you master the concept, you can use any number. Figure 3.3 shows the Insert Table dialog box.Following the steps below you can create a table using Insert Table dialog box.\n1.On the Insert tab, in the Tables group, click the table button to open Insert \nTable menu.\n2.On the menu, just below the rows and the columns, select Insert Table. The Insert Table dialog box appears.\nFigure 3.3 Inserting table dialog box\n3. In the number of columns box, set the value to 9.\n4.In the number of rows box, set the value to 3. The AutoFit behavior is shown \nin the dialog box \n5. Click Ok to insert the table. You inserted a new table with 9 columns and 3\nrows.\n6. Click below the table and press enter twice to insert blank lines.7. Save the document as Table 2 in the lesson folder on your flash drive."
        },
        {
            "page_number": 92,
            "text": "Grade 10 Information Technology Student’s Textbook \n  85c. Drawing Table \nWord provides options to draw complex tables using the draw table command, \nwhich enables you to draw a table as you would with a pencil and paper. The draw table command transforms the mouse pointer into a pencil tool, which you can use to outline the table and then draw rows and columns exactly where you need them. Keep your eyes on the following steps to draw a table from the Table menu. Use the document that is open from the previous exercise.\n1.If your ruler is not displayed, select the ruler check box on the View tab in the Show group.\n2.Make sure that your insertion point is at the bottom of the document; then use the scroll bar to scroll down; the insertion point is at the top of the screen.\n3.On the Insert tab, in the Tables group, click the Table button to open the Insert Table menu.\n4.On the menu, just below the rows and columns, select draw table. The pointer becomes a pencil tool.\n5.To begin drawing the table, as shown in Figure 3.4, click at the blinking insertion point and drag down and to the right until you draw a rectangle that is as wide as you want. Notice that the table tools’ contextual design and layout tabs automatically appear with the active layout tab.\nFigure 3.4 Drawing table"
        },
        {
            "page_number": 93,
            "text": "86Unit 3 : Application Software\n6.Click and drag the pencil from the left border to the right border to draw a \nhorizontal line. Use your ruler as your guide.\n7.Click the Draw Table button in the drawing group of the table tools – layout tab to turn the pencil tool off.\n8.Click below the table and press enter twice to create blank lines. If necessary, place your insertion point outside the last cell and then press enter.\n9. Save the document as Table 3 in the lesson folder on your flash drive.\nd. Inserting a Quick Table\nQuick tables are built-in preformatted tables, such as calendars and tabular lists which you can insert and use in your documents. You can edit the quick table calendar to reflect the current month and year. In this exercise, you insert a quick table calendar into a document.\n1.On the Insert tab, in the Tables group, click the Table button to open the Insert Table menu.\nFigure 3.5  Built-in quick table gallery\n2.On the menu, just below the rows and columns, select quick tables from the menu. A gallery of built-in quick tables appears, as shown in Figure 3.5.\n3.Select Calendar 2. You can edit the data in the calendar to display the current month and year."
        },
        {
            "page_number": 94,
            "text": "Grade 10 Information Technology Student’s Textbook \n  874.Save the document as Table4 in the lesson folder on your drive and then \nclose the file.\nPractical Exercise 3.1\nPractice drawing a table individually using the following steps. \n1. Open MS word document. \n2. Draw a table having 15 rows and 7 columns.3. Insert a new row between rows 3 and row 4.4. Insert a new column between columns 2 and column 3.5. Delete row 1 and column 6.6. Save your file by the name Draw Table.\n3.2.2 Formatting a Table\nOnce you have inserted a table into a document, you can apply a preformatted \nstyle using the table styles gallery. These styles add a professional appearance to the tables in your documents. In the table tools, design tab, in the borders group, you can manually format a table’s borders. The borders group enables you to draw and apply styles to the table.\na. Applying a Style to a Table\nWith table styles, it is easy to change a table’s formatting quickly. You can apply styles to tables in the same way you learned to apply styles to text in previous lessons, i.e. by positioning the insertion point in a table and selecting a style from the table styles gallery. You can preview the style before applying it and change the style as many times as needed. You can modify an existing table style or create a new table style and add it to the gallery and then modify or delete it, as appropriate. In this exercise, you apply a table style to a table in your Word document. Follow the steps below to apply styles to a table.\n1. Position the insertion point anywhere in the table.\n2.On the table tools design tab, in the table styles group, click More buttons to \nview a gallery of table styles. There are three options available: plain tables, \ngrid tables and list tables."
        },
        {
            "page_number": 95,
            "text": "88Unit 3 : Application Software\n3.Scroll down to the third row under the grid tables and select the grid table \n3, accent 3 styles, as shown in Figure 3.6.\n4. Save the document as Clients Table 5 in the lesson folder on your drive.\nFigure 3.6 Table styles gallery\nb. Resizing Rows and Columns\nWord offers several tools for resizing rows or columns. You can resize a column or \na row using the mouse or the commands on the ribbon. You can use commands in the cell size group on the table tools, layout tab to adjust height and width or ruler to adjust the column width. In addition, the table properties dialog box enables you to set the measurements at a precise height for rows or an ideal width for columns, cells and tables. \nPractice how to resize rows and columns in a word table using the following \nsteps. Use the document that is open from the previous exercise.\n1.Click in the first column and position the mouse pointer over the horizontal ruler on the first column marker (see Figure 3.7). The pointer changes to a double-headed arrow (\n) along with the screen tip move table column.\n2.Click and drag the column marker to the right, just until the contents in the first column fit in a single line. On the table tools, layout tab, in the cell"
        },
        {
            "page_number": 96,
            "text": "Grade 10 Information Technology Student’s Textbook \n  89size group, the width automatically adjusts to 2.19’’. Just as columns can be \nadjusted manually, so can rows; you use the vertical ruler to adjust the row markers.\n3.Position the insertion point in the phone number column of the table. On the table tools, layout tab, in the Table group, click Select button and choose Select Column from the drop-down menu.\n4.On the table tools, layout tab, in the cell size group, click Up Arrow in the width box until it reads 1.1” and the column width changes. The phone numbers now fit on a single line.\nFigure 3.7 Horizontal ruler on the first column marker\n5.Place the insertion point anywhere in the first row. In the table group, click the select button again, and then click Select Row from the drop-down menu. The first row is selected.\n6.On the table tools layout tab, in the cell size group, click the dialog box launcher. The table properties dialog box appears.\n7. Click the row tab in the dialog box.\n8.Select the specific height checkbox. In the height box, click the up arrow until \nthe box reads 0.5”.\n9.Click the next row button and notice that the changes are applied only to the first row. By clicking the next row button, the selection moves down one row.\n10.Click Ok. In the cell size group, notice that the height for row 2 is 0.14” and row 1 is 0.29”. You can also adjust the height of a row individually or by selection.\n11. Click in any cell to remove the selection.\n12.Save the document as Client Table 6 in the lesson folder on your flash drive."
        },
        {
            "page_number": 97,
            "text": "90Unit 3 : Application Software\nc. Inserting Rows and Columns\nInsert control feature\nThe insert control feature utilizes an interface we noticed when we were in the \nprocess of selecting various sections of the table. The tool will appear when pointing to the left or top border of the table and in the general vicinity between two rows or two columns. Figure 3.8 shows the Insert control feature. As opposed to other insertion methods, this tool facilitates an insertion without having to select any particular portion of the table. When the tool is completely in focus, it will turn from grey to blue and can then be clicked to perform an insertion. It will insert a row below the insert control tool or a column to the right of it. \nFigure 3.8 Insert control feature\nWe follow the steps below to insert rows and columns.\n1.Point to the left border of the table and move your mouse until you see the blue insert control tool on the border between the first and second rows. Click the \n+. Note it inserts a row below the first row. Click Undo.\n2.Point to the top border of the table and move your mouse until you see the blue insert control tool on the border between the first and second column and click the +. Note it inserts a column to the right of the first column. Click Undo.\nPractical Exercise 3.2\nPractice the following exercise in a group.\n1.Open word document and insert table using any of the table insertion methods.\n2. Insert days of a week (starting from Monday) in the first raw of the table."
        },
        {
            "page_number": 98,
            "text": "Grade 10 Information Technology Student’s Textbook \n  91d. Deleting Rows and Columns\nBoth the ribbon and the right-click menu have tools to delete rows and columns. \nThe ribbon tool, named delete, can be accessed when the insertion point is in a cell in the row or the column to be deleted. The right-click menu offers a specific delete button when the row or the column is selected first.\nRight-click menu\n1.Insert table, as shown in Figure 3.1, and select the row with the Wednesday cell in it.\n2. Maintain cursor focus on the selected row and right-click. \n3. Click Delete Rows. Note the deletion. Click Undo.\nFigure 3.9 Delete rows\n4. Select the column with the Wednesday cell in it.5. Maintain cursor focus on the selected column and right-click.6. Click Delete Columns. Note the deletion. Click Undo.3. Use automatic insert provided. 4. Observe the difference when you input manually."
        },
        {
            "page_number": 99,
            "text": "92Unit 3 : Application Software\nFigure 3.10 Delete columns\nPractical Exercise 3.3\nDo the following exercise in a group.\n1.Open a blank word document and create a table as shown in Figure 3.11 \nbelow; maintain out fill to complete days and months.\n2. Insert row March and delete column Friday, then observe the change. \nFigure 3.11  Format table\n3.Create your table and insert any data you like and demonstrate it to you class.\n4. Save it by your name and into your flash drive."
        },
        {
            "page_number": 100,
            "text": "Grade 10 Information Technology Student’s Textbook \n  935.To resize your table, see Figure 3.12 below, locate the small square at the \nbottom right of the table. This is a resize handle. Point to it and notice that the pointer changes to a white arrow with two ends.\nFigure 3.12 Resize the table\n6.Click and drag towards the center of the table and resize it to raw 12 and column 9.\n3.2.3 Inserting Pictures, Clip arts and Shapes\nWord offers several tools to help you capture your readers’ attention with illustrations that include pictures, shapes, SmartArt, charts and screenshots. You can modify images in several ways including converting them to SmartArt, adding captions, resizing, cropping what you do not need, rotating, applying styles and \ncolors, creating artistic effects and positioning images within the document.\na. Inserting Pictures\nWhen you insert a picture into a document, MS Word marks it as an embedded \nobject by default, which means it becomes part of the document and is no longer \nconnected to the original image. Inserting a picture is very similar to opening a document file. You use the pictures button on the Insert tab in the Illustrations group to open images instead of opening backstage. The following steps demonstrate inserting pictures.\nSteps to insert pictures\n1. Open a new blank document and type Green Legacy on a blank page.\n2. Select the text; then right-click it to display the Mini toolbar.\n3.Change the font of the title to Cambria and the font size to 28-point, bold,"
        },
        {
            "page_number": 101,
            "text": "94Unit 3 : Application Software\ngreen color, and align center .\n4. Center horizontally; then deselect the text.\n5. Press Enter.6.Click the Insert tab, and then click the pictures button in the illustrations \ngroup. The insert picture dialog box appears.\n7. Locate your lesson folder on your flash drive and select the image you like\n8. Click Insert.\nFigure 3.13 Insert picture\n9. Insert caption as shown in Figure 3.13 above.\n10.The picture appears in the document at the cursor location and the Format \ntab appears with the picture tools command groups.\n11. Save the document as Ethiopian Green Legacy in the lesson folder on your \nflash drive.\nSimilarly, you can insert pictures shapes, smart arts, charts and screenshots from online following the steps. In the following section, we will learn how to insert screenshots.\nb. Inserting Screenshots\nIn addition to inserting images from existing picture files, Word also enables you to capture images of all or part of the current screen display and insert them directly into your documents. When you click the Screenshot button in the Illustrations group on the Insert tab, a menu containing thumbnails of the computer’s currently open windows appears. Selecting a thumbnail inserts an image of that window or you can select Screen Clipping which enables you to draw a box and capture an image of its contents."
        },
        {
            "page_number": 102,
            "text": "Grade 10 Information Technology Student’s Textbook \n  95Steps to insert a screenshot\n1. Open a new blank document.\n2. On a blank page, type Athlete Haile G/Silase.\n3. Select the text then right-click it to display the mini toolbar.\n4.Change the font of the title to Cambria and the font size to 28 points and \nbold.\n5. Center horizontally; then deselect the text and press enter.6.Locate your lesson folder on your flash drive and double-click any folder \ncontaining photos. A photos window appears, displaying the image in the file.\n7.Switch to the word window, click the Insert tab and then click the screenshot button in the illustrations group. The screenshot menu appears.\n8.On the screenshot menu, select screen clipping. The photos window appears, with a gray cast over the entire screen. The pointer changes to a cross.\n9.Use the point to draw a rectangle around the photograph in the photo’s window. When you release the mouse button, the selected photo is pasted into the word document.\n10.Save the document as an Athlete in the lesson folder on your flash drive and close the document.\nc.Inserting Clip Arts \nClip Art can help in making a document look colorful and presentable. Clip arts are pre-defined images available for use in documents. For example, if you would like to create a greeting card for your friend, you can use clip arts such as balloons, flowers and much more along with text messages. You can also download clipart from websites. Depending on which version of office you have, you may be able to use an office library of clip art or get clip art from the web.\nSteps to insert clip art in a document\n1. Click Insert tab on the ribbon.\n2. Click Option Clip Art in the illustrations group."
        },
        {
            "page_number": 103,
            "text": "96Unit 3 : Application Software\n3. The clip art task pane appears. Enter the clipart category name in the search \nbox and click Go.\n4.Select the clipart that you want to use, double-click on it and it will be inserted \ninto your document\n5. Select Insert online pictures.\n6.Type a word or phrase to describe what you are looking for and then press \nenter.\n7. Filter the results by type for clipart.\nFigure 3.14 Example of online Picture\n8. Select a picture.\n9. Select Insert.\n10. Save the document as Practice.\nd. Inserting Shapes\nMicrosoft word allows you to insert various shapes into your document. For ex -\nample, you could place a circle around important information in a document. If \nyou use the word to create marketing flyers, newsletters or other types of publi-cations, you may want to insert various types of shapes to add visual interest to your documents."
        },
        {
            "page_number": 104,
            "text": "Grade 10 Information Technology Student’s Textbook \n  97Steps to insert a shape into your document\n1.Click Insert tab in the ribbon and then click Shapes button in the Illustrations \ngroup.\nFigure 3.15 Insert tab\n2.Roll your mouse pointer over the shape that you want to insert and then click it to select it.\nFigure 3.16 Shapes options\n3.Your mouse pointer will appear as a black cross-hair when you place it back over the document. Decide where you want the graphic to appear in your document and then click and drag across the area in the document where you want the object to appear. The object will then be inserted into your document."
        },
        {
            "page_number": 105,
            "text": "98Unit 3 : Application Software\nFigure 3.17 Selected shape\n4.When drawing the object, you can hold down Shift key as you click and drag \nwhile drawing to create a “perfect” version of the selected shape.\nFigure 3.18 Shape resize\n5.If you want to lock Word into its drawing mode as you select your desired shape from the Shapes button’s drop-down menu, simply right-click on the shape that you want to draw in the drop-down menu, instead of clicking it. From the pop-up menu that appears, click the Lock Drawing Mode\ncommand. Now you can return to your document and draw as many instances of the selected shape as you wish. Note that you can cancel the drawing mode lock by simply pressing the Esc key on your key board or by right-clicking on the blank area of the document."
        },
        {
            "page_number": 106,
            "text": "Grade 10 Information Technology Student’s Textbook \n  99\nFigure 3.19 Lock Drawing Mode\n3.2.4 Formatting Page Number\nPage numbers can be used to automatically number each page in your document. \nThey come in a wide range of number formats and can be customized to suit your needs. Page numbers are usually placed in the header, footer, or side margin. Practical Exercise 3.4\nAnswer the following exercises in a group.\n1.Open Microsoft word and write two paragraphs about the eagle and its lifestyle. (See Figure 3.14). Furthermore, insert the picture of the eagle from the online library.\n2. Use the picture from earlier practice to crop, resize, scale and rotate it.\n3. Write a text and arrange it around the picture.4. Insert some of the shapes in your document.5. Save the file you have created by the name Eagle on the desktop."
        },
        {
            "page_number": 107,
            "text": "100Unit 3 : Application Software\nWhen you need to number some pages differently, Word allows you to restart \npage numbering .\nFollow the following logical steps to add page numbers.\n1. On the Insert tab, click the page number command.\nFigure 3.20 Page inserts tab\n2.Open the top of the page, the bottom of the page or the page margin menu, depending on where you want the page number to be positioned, and then select the desired style of header.\nFigure 3.21 Add page numbers"
        },
        {
            "page_number": 108,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1013. Page numbering will appear.\nFigure 3.22 Page numbers position\n4. Press the Esc key to lock the header and footer.\n5.If you need to make any changes to your page numbers, simply double-click \nthe header or footer to unlock it.\nPractical Exercise 3.5\nPractice formatting page number in a group following the steps below.\n1. Open the file by the name “Eagle” you saved in Practical Exercise 3.4.\n2. Insert page numbers, header, and footer to your file.3. Hide the page number on the first page.4. Save the file to keep the changes you have made.\nKEY CONCEPTS\nMicrosoft Word is a word processing application that allows you to create a \nvariety of documents including letters and resumes.\nA table is the arrangement of data made up of horizontal rows and vertical \ncolumns. The intersection of a row and column is called a cell.\nQuick Tables are built-in preformatted tables such as calendars and tabular lists which you can insert and use in your documents.\nClip Arts are pre-defined images available for use in documents.\nPicture tools format tab appears whenever you insert a picture into a document or select an existing picture within the document."
        },
        {
            "page_number": 109,
            "text": "102Unit 3 : Application Software\n3.3 Spreadsheet\nA spreadsheet or worksheet is a file made of rows and columns that is used to \nsort, organize and arrange data efficiently, and calculate numerical data. What makes a spreadsheet software program unique is its ability to calculate values using mathematical formulas and the data in cells. \nToday, Microsoft Excel is the most popular and widely used spreadsheet \nprogram, but there are also many alternatives. For accessibility, we are using Microsoft Excel to create a spreadsheet. Figure 3.23 shows Microsoft Excel window.\nFigure 3.23 Microsoft excel window\nEach cell may contain either numeric or text data or the results of formulas that \nautomatically calculate and display a value based on the contents of other cells.  Brainstorming \n1. What do you think spreadsheet programs are used for?\n2.Can you observe different functions of spreadsheet programs from word \nprocessing?"
        },
        {
            "page_number": 110,
            "text": "Grade 10 Information Technology Student’s Textbook \n  103A spreadsheet may also refer to a program that displays data (text and numbers) \nin a table called a worksheet.\n3.3.1 Understanding and Displaying Formulas\nThe real strength of Excel is its capability to perform common and complex calculations. The formula is one of the essential elements of Excel which enables you to add, subtract, multiply and divide numbers. When you enter a formula in a cell, the formula is stored internally and the results are displayed in the cell. You can view the underlying formula in the formula bar when the cell is active as you double-click the cell to edit it or use the Formulas tab.\nFigure 3.24 Viewing a formula in the formula bar\nJust like a calculator, Excel can add, subtract, multiply and divide. In this \nlesson, you will learn how complex formulas are used in Excel.\nA simple formula is a mathematical expression with one operator, such as \n7+9. A complex formula  has more than one mathematical operator, such as 5 + 2 \n* 8. When there is more than one operation in a formula, the order of operations\ntells Excel which operation to calculate first. To use Excel to calculate complex formulas, you will need to understand the order of operations.\nOrder of operations\nExcel calculates formulas based on the following order of operations:\nOperations enclosed in parentheses.\nExponential calculations (3^2, for example)."
        },
        {
            "page_number": 111,
            "text": "104Unit 3 : Application Software\nMultiplication and division whichever comes first.\nAddition and subtraction whichever comes first.\n3.3.2 Functions\nA function is a predefined formula that performs calculations using specific \nvalues in a particular order. Excel includes many common functions that can \nbe useful for quickly finding the sum, average, count, maximum value and\nminimum value for a range of cells. To use functions correctly, you will need to understand the different parts of a function and how to create arguments to calculate values and cells.\nParts of a function\nTo work correctly, a function must be written in a specific way, which is called syntax. The basic syntax for a function is an equal sign (=) , the function name \n(SUM, for Example) and one or more arguments. Arguments contain the information you want to calculate.\nFigure 3.25 Parts of a function\nWorking with arguments\nArguments can refer to both individual cells and cell ranges, and must be enclosed \nwithin parentheses.  You can include one argument or multiple arguments \ndepending on the syntax required for the function.For example, the function =AVERAGE (B1:B9)  would calculate the average of the \nvalues in the cell range B1 to B9. This function contains only one argument."
        },
        {
            "page_number": 112,
            "text": "Grade 10 Information Technology Student’s Textbook \n  105Figure 3.26 One argument\nMultiple arguments must be separated by a comma. For example, the function \n= SUM (A1:A3, C1:C2, E2) will add the values of all the cells in the three arguments. \nFigure 3.27 shows multiple arguments.\nFigure 3.27 Multiple arguments\nCreating a function\nExcel has a variety of functions available. Here are some of the most common \nfunctions you will use:\nSUM: This function adds all of the values of the cells in the argument.\nAVERAGE: This function determines the average of the values included \nin the argument. It calculates the sum of the cells and then divides that value by the number of cells in the argument."
        },
        {
            "page_number": 113,
            "text": "106Unit 3 : Application Software\nCOUNT: This function counts the number of cells with numerical data \nin the argument. This function is useful for quickly counting items in a cell range.\nMAX: This function determines the highest cell value included in the argument.\nMIN: This function determines the lowest cell value included in the argument.\nCreating a basic function\nIn our example, Figure 3.28 below, we will create a basic function to calculate the average price per unit  for a list of recently ordered items using the AVERAGE\nfunction. To do so:\n1. Select the cell that contains a function.\n2.Type an equal sign (=) and enter the desired function name. You can also \nselect the desired function from the list of suggested functions  that will \nappear below the cell as you type. In our example, we will type =AVERAGE .\n3.Enter the cell range for the argument inside parentheses . In our example, \nwe will type (D3:D12). \n4. Press Enter on your keyboard . The function will be calculated and the \nresult will appear in the cell.\nFigure 3.28 Create basic function"
        },
        {
            "page_number": 114,
            "text": "Grade 10 Information Technology Student’s Textbook \n  107Creating a function using the AutoSum command\nThe AutoSum command allows you to automatically insert the most common \nfunctions into your formula including SUM, AVERAGE, COUNT, MIN and \nMAX. In our example below, we will create a function to calculate the total cost \nfor a list of recently ordered items using the SUM function. We follow the steps below for the same.\n1. Select the cell that contains a function.\n2.In the Editing  group on the home tab, locate and select the arrow next to the \nAutoSum command and then choose the desired function from the drop-\ndown menu. In our example, we will select Sum.\nFigure 3.29 Automatic command\n3.The selected function will appear in the cell. If logically placed, the AutoSum command will automatically select a cell range for the argument. You can also manually enter the desired cell range into the argument.\nFigure 3.30 Cell range selection\n4. Press Enter on your keyboard."
        },
        {
            "page_number": 115,
            "text": "108Unit 3 : Application Software\n3.3.3 Working with Data\nWhenever you are working with a lot of data, it can be difficult to compare\ninformation in your workbook.\na. Freezing Panes and View Options\nExcel includes several tools that make it easier to view content from different \nparts of your workbook at the same time such as the ability to freeze panes  and \nsplit your worksheet.\nFreezing rows\nYou may want to see certain rows or columns all the time in your worksheet, especially header cells. By freezing rows or columns  in place, you will be able to \nscroll through your content while continuing to view the frozen cells. Follow the steps below to freeze rows.\n1. Select the row below the row(s) you wish to freeze.\n2. Click the View tab on the Ribbon.Practical Exercise 3.6\nPractice computing with different functions in spreadsheet in a group.\n1.Open the blank worksheet and enter data as it is in Table 3.1, and compute \nsum, average, count, maximum and minimum.\nTable 3.1 Students’ grade record\n2. Format the excel sheet as it is shown above."
        },
        {
            "page_number": 116,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1093.Select the Freeze Panes  command, and then choose Freeze Panes  from the \ndrop-down menu.\nFigure 3.31 Freeze panes\nThe rows will be frozen in place, as indicated by the gray line. You can scroll \ndown the worksheet while continuing to view the frozen rows at the top.\nFreezing columns\nIn order to freeze columns, follow the steps below.\n1. Select the column to the right of the column(s) you wish to freeze\n2. Click the View tab on the Ribbon.\n3.Select the Freeze Panes  command, and then choose Freeze Panes  from the \ndrop-down menu.\n4.The column will be frozen in place, as indicated by the gray line. You can \nscroll across the worksheet while continuing to view the frozen column on \nthe left.\nIf you want to unfreeze rows or columns, click the Freeze Panes command, then select Unfreeze Panes from the drop-down menu.\nSplitting a worksheet\nSometimes you may want to compare different sections of the same workbook without creating a new window. The Split command allows you to divide the \nworksheet into multiple panes that scroll separately. To split a worksheet, follow the steps below."
        },
        {
            "page_number": 117,
            "text": "110Unit 3 : Application Software\n1. Select the cell where you wish to split the worksheet.\n2. Click the View tab on the Ribbon, and then select the Split command.\nFigure 3.32 Split worksheet\n3.The workbook will be split into different panes. You can scroll through each \npane separately using the scroll bars, allowing you to compare different sections of the workbook.\n4. To remove the split, click the Split command again.\nb. Sorting Data\nAs you add more content to a worksheet, organizing that information becomes especially important. You can quickly reorganize a worksheet by sorting your \ndata. For example, you could organize a list of contact information by the last name. Content can be sorted alphabetically, numerically and in many other ways. When sorting data, it is important to first decide if you would like the sort to \napply to the entire worksheet or just a cell range.\nSort sheet organizes all of the data in your worksheet by one column.\nSort range sorts the data in a range of cells which can be helpful when working with a sheet that contains several tables. Sorting a range will not affect other content on the worksheet.Practical Exercise 3.7\nPractice freezing and splitting in a group.\n1. Open an existing Excel worksheet.\n2. Try freezing a row or column in place.3. Use the Split command to split your worksheet into multiple panes."
        },
        {
            "page_number": 118,
            "text": "Grade 10 Information Technology Student’s Textbook \n  111Sorting a sheet\nSorting data in Excel helps the user to understand and visualize data more \neffectively, facilitates investigation of data, aids the process of searching, organizing and formatting data and ultimately, helps in making efficient decisions. You can sort data by text (A to Z or Z to A), numbers (smallest to largest or largest to smallest) and dates and times (oldest to newest and newest to oldest) in one or more columns. You can also sort using a custom list you create (such as A, C, and B) or by the format of cells which can be done on the basis of cell color, font color or cell icon.\nIn Figure 3.33, we will sort a student’s grade report form alphabetically by \nFirst Name (column C). In order to sort, you need to select a cell in the column \nyou wish to sort by. In our example, we will select cell C2 and let us follow other \nsteps.\nFigure 3.33 Sort data\n1.Select the Data tab on the Ribbon, and then click the Ascending command \n to sort A to Z or the Descending command \n  to sort Z to A. In our \nexample, we will click Ascending command."
        },
        {
            "page_number": 119,
            "text": "112Unit 3 : Application Software\nFigure 3.34 Data Sort and Filter group\n2.The worksheet will be sorted by the selected column. In our example, the \nworksheet is now sorted by the first name.\nFigure 3.35 Sorted worksheet\nc. Filtering Data\nIf your worksheet contains a lot of contents, it can be difficult to find information quickly. Filters can be used to narrow down the data in your worksheet, allowing \nyou to view only the information you need. Figure 3.36 shows data filtering.\nTo filter data:\n1.For filtering to work correctly, your worksheet should include a header row\nwhich is used to identify the name of each column.\n2. Select the Data tab, and then click the Filter command."
        },
        {
            "page_number": 120,
            "text": "Grade 10 Information Technology Student’s Textbook \n  113\nFigure 3.36 Filter data\n3. A drop-down arrow will appear in the header cell for each column.\n4. Click the drop-down arrow for the column you wish to filter.5. The filter menu will appear.6. Uncheck the box next to Select All to quickly deselect all data.7. Check the boxes next to the data you wish to filter, and then click Ok.\nTo remove all filters from your worksheet, click the Filter command on the Data \ntab.\n3.3.4 Working with Charts\nA chart is a powerful tool that allows you to visually display data in a variety \nof different chart formats such as bar, column, pie, line, area, scatter, surface or radar charts. With Excel, it is easy to create a chart.\nCreating a chart in Microsoft Office Excel is quick and easy. Excel provides a \nvariety of chart types that you can choose from when you create a chart. Excel offers pie, line, bar and column charts , to name a few. Showing data in a chart \ncan make it clearer, more interesting and easier to read. Charts can also help you evaluate your data and make comparisons between different values. Figure 3.37 shows how to insert a chart."
        },
        {
            "page_number": 121,
            "text": "114Unit 3 : Application Software\nTo insert a chart:\n1.Select the cells you want to insert chart, including the column titles and row \nlabels. These cells will be the source data for the chart.\n2. From the Insert tab, click the desired Chart command.\n3. Choose the desired chart type from the drop-down menu.\nFigure 3.37 Insert chart\n4. The selected chart will be inserted into the worksheet.\nIf you are not sure which type of chart to use, the recommended charts \ncommand will suggest several different charts based on the source data. See Figure 3.38.\nFigure 3.38 Recommended chart\nChart layout and style\nAfter inserting a chart, there are several things you may want to change about the \nway your data is displayed. It is easy to edit a chart’s layout and style from the \nDesign tab. Figure 3.39 shows chart elements."
        },
        {
            "page_number": 122,
            "text": "Grade 10 Information Technology Student’s Textbook \n  115Excel allows you to add chart elements such as chart titles, legends and data \nlabels to make your chart easier to read. To add a chart element, click the Add \nChart Element command on the Design tab ; then choose the desired element\nfrom the drop-down menu.\nFigure 3.39 Add chart\nTo edit a chart element, like a chart title, simply double-click the \nplaceholder and begin typing.\nFigure 3.40 Edit chart element"
        },
        {
            "page_number": 123,
            "text": "116Unit 3 : Application Software\nIf you do not want to add chart elements individually, you can use one \nof Excel’s predefined layouts. Simply click the Quick Layout command, and then choose the desired layout from the drop-down menu.\nFigure 3.41 Chart styles\nExcel also includes several different chart styles which allow you to modify the look and feel of your chart quickly. To change the chart style, select the desired style from the Chart styles group.\nFigure 3.42 Edited chart\nPractical Exercise 3.8\nOpen Excel’s spread sheet and practice the following in a group.\na. Create a pie chart or line chart.\nb. Change the chart layout as you like.c. Rewrite chart title as Student Grade Record."
        },
        {
            "page_number": 124,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1173.3.5 Applying Different Effects to a Cell (Formatting a Cell)\nAll cell contents use the same formatting by default which can make it difficult \nto read a workbook with a lot of information. Basic formatting can customize \nthe look and feel of your workbook, allowing you to draw attention to specific \nsections and making your content easier to view and understand. You can also apply number formatting to tell excel exactly what type of data you are using in \nthe workbook such as percentages (%), currency ($) and so on.\na. Font Formatting\nBy default, the font of each new workbook is set to Calibri. However, Excel provides a variety of other fonts you can use to customize your cell text. In the example below, we will format our title cell to help distinguish it from the rest of the worksheet.\n1. Select the cell(s) you wish to modify.\n2.Click the drop-down arrow next to the font command on the home tab.  The \nfont drop-down menu will appear. \n3.Select the desired font. A live preview of the new font will appear as you \nhover the mouse over different options.\nFigure 3.43 font options"
        },
        {
            "page_number": 125,
            "text": "118Unit 3 : Application Software\n4. The text will change to the selected font.\nTo change the font size:\n1. Select the cell(s) you wish to modify.\n2.Click the drop-down arrow next to the font size command on the home tab.\nThe font size dropdown menu will appear.\n3.Select the desired font size . A live preview  of the new font size will appear \nas you hover the mouse over different options.\n4. The text will change to the selected font size.\nYou can also use Increase Font Size and Decrease Font Size commands or enter a custom font size using your keyboard.\nFigure 3.44 Increase Font Size\nTo change the font color:\n1. Select the cell(s) you wish to modify.\n2.Click the drop-down arrow next to the Font Color  command on the home \ntab. The Color menu will appear.\n3.Select the desired font color. A live preview of the new font color will appear \nas you hover the mouse over different options."
        },
        {
            "page_number": 126,
            "text": "Grade 10 Information Technology Student’s Textbook \n  119\nFigure 3.45 Font colors\n4. The text will change to the selected font color.\nTo use the Bold, Italic and Underline commands:\n1. Select the cell(s) you wish to modify.\n2.Click Bold (B), Italic (I) or Underline ( U) commands on the home tab. In our \nexample, we will make the selected cells bold.\nFigure 3.46 Font commands\n3. The selected style will be applied to the text.\nYou can also press Ctrl+B on your keyboard to make the selected text \nbold, Ctrl+I to apply italics and Ctrl+U to apply an underline.\nb.Text Alignment\nBy default, any text entered into your worksheet will be aligned to the bottom-left of a cell, so all numbers will be aligned to the bottom-right of a cell. Changing the alignment of your cell content allows you to choose how the content is displayed in any cell which can make your cell content easier to read."
        },
        {
            "page_number": 127,
            "text": "120Unit 3 : Application Software\nTo change horizontal text alignment:\n1. Select the cell(s) you wish to modify. \n2.Select one of the three horizontal alignment  commands on the home tab. In \nour example, we will choose Center Align.\nFigure 3.47 Text alignment options\n3. The text will be realigned.\nTo change vertical text alignment:\n1. Select the cell(s) you wish to modify.2.Select one of the three vertical alignment commands on the home tab. I n \nour example, we will choose a Middle Align .\nFigure 3.48 Text realignment\n3. The text will be realigned.\nc. Cell Borders and Fill Colors\nCell borders and fill colors allow you to create clear and defined boundaries for \ndifferent sections of your worksheet."
        },
        {
            "page_number": 128,
            "text": "Grade 10 Information Technology Student’s Textbook \n  121To add a border:\n1. Select the cell(s) you wish to modify.\n2.Click the drop-down arrow next to the Borders command on the Home tab. \nThe Borders dropdown menu will appear.\nFigure 3.49 Boarders dropdown menu\n3. Select the border style you want to use. \n4. The selected border style will appear.\nYou can draw borders and change the line style and color of them \nwith the Draw Borders tools at the bottom of the Borders drop-down menu."
        },
        {
            "page_number": 129,
            "text": "122Unit 3 : Application Software\nFigure 3.50 Draw boarders\nTo add a fill color:\n1. Select the cell(s) you wish to modify.\n2.Click the drop-down arrow next to the fill color command on the home tab. \nThe fill color menu will appear.\n3.Select the fill color you want to use. A live preview of the new fill color will appear as you hover the mouse over different options. In our example, we will choose Light Green.\nFigure 3.51 Fill color menu\n4. The selected fill color will appear in the selected cells."
        },
        {
            "page_number": 130,
            "text": "Grade 10 Information Technology Student’s Textbook \n  123d. Cell Styles\nRather than formatting cells manually, you can use Excel’s predesigned cell \nstyles. Cell styles are quick ways to include professional formatting, such as titles \nand headers , for different parts of your workbook.\nTo apply a cell style:\n1. Select the cell(s) you wish to modify.\n2.Click the Cell Styles command on the home tab, and then choose the desired \nstyle from the drop-down menu.\nFigure 3.52 Color style\n3. The selected cell style will appear.\ne. Formatting Text and Numbers\nOne of the most powerful tools in Excel is the ability to apply specific formatting \nfor text and numbers. Instead of displaying all cell contents in the same way, you can use formatting to change the appearance of dates, times, decimals, percentages (%), currency ($) and much more.\nTo apply number formatting:\n1. Select the cells(s) you wish to modify.\n2.Click the drop-down arrow next to the Number Format command on the \nhome tab. The Number Formatting drop-down menu will appear."
        },
        {
            "page_number": 131,
            "text": "124Unit 3 : Application Software\n3. Select the desired formatting option.\n4. The selected cells  will change to the new formatting style.\nFigure 3.53 Number formatting\nPractical Exercise 3.9\nPractice the following activities individually.\n1. Open an existing Excel’s workbook.2. Select cells from G3 to M12 and do the following. \na. Change the font style to Tahoma.\nb. Change the font size to 32.c. Change the color of the text to Blue, Accent 5, lighter 40%.d. Make the texts on cells H4 to J5 bold, italics and underlined.e. Change alignment to vertical for cells G3 to M3.f. Add a border to cells H4 to k11."
        },
        {
            "page_number": 132,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1253.4 PowerPoint Presentation\nAs it was defined and discussed in grade 9, unit 3, PowerPoint is a graphical \npresentation program used to organize and present information. PowerPoint presentations consist of several individual pages or slides. Slides may contain text, graphics, sound, movies and other objects that can be freely arranged.\nPresentations can be printed, displayed live on a computer or navigated \nthrough at the command of the presenter. For larger audiences, the presentation is often projected onto a large screen. Handouts, speaker notes or outlines can also be produced from the slides.\n3.4.1 Using Animation and Transitions\nPresentations are greatly improved by adding animation. PowerPoint gives you a wide selection of built-in animations, both when moving between one slide and the next, and within each slide. Brainstorming \n1. Can you describe why PowerPoint presentation software is used for?\n2. Have you ever heard of the term animation? 3. What are the fundamental contents of a PowerPoint presentation?KEY CONCEPTS\nA Spread sheet is a computer application for organization, analysis and \nstorage of data in tabular form. Spreadsheets were developed as computerized \nanalogs of paper accounting worksheets.\nA spreadsheet  may also refer to a program that displays data (text and \nnumbers) in a table called a worksheet.\nAll formulas in Excel  must begin with an equal sign  (=). This is because the \ncell contains or is equal to the formula and the value it calculates.\nA chart is a powerful tool that allows you to visually display data in a variety \nof different chart formats. With Excel we can easily create charts such as bar, column, pie, line, area, scatter, surface or radar charts."
        },
        {
            "page_number": 133,
            "text": "126Unit 3 : Application Software\na. Slide Transitions\nTransitions are animated effects that occur when you move from one slide to \nanother. They differ from animations in that animations apply to individual \nitems on a slide whereas transitions apply only to entire slides. You can control the effect, its speed, its sound effect (if any) and, in some cases, other options such as direction. Figure 3.5 shows the transition tab.\nFigure 3.54 Transition tab\nInstead of simply moving abruptly from one slide to another during a \npresentation, slide transitions allow slides to dissolve into each other, using a variety of different special effects. These can make your on-screen presentation look even better and more professional.\nTo insert transitions:\n1. Check that you are in normal view and that the first slide is selected.\n2.Move to the transitions tab and click to see the ribbon as seen in Figure 3.54.\n3.Choose one of the transition effects for the first slide (the more button shows \nall the effects)\n4.Note that a small star symbol appears to the left of the first slide miniature; \nthis indicates that a transition has been set up on this slide. Next, explore the options available.\n5. Click on effect options and change the direction of the effect.\n6.Increase the duration of the transition to slow it down and see the effect \nmore clearly.\n7.Open the sound drop-down list and then click camera (to add the sound of a camera shutter opening and closing at each transition).\nIf you do not hear the sound, try previewing it again. If you still do not hear \nthe sound, make sure that your speakers are on or your system’s sound is not muted in Windows and that the volume is turned up."
        },
        {
            "page_number": 134,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1278.Under the advance slide, set the next slide to appear after you have set the \nnumber of seconds.\n9. Move to the next slide and repeat steps 3 to 6, choosing different effects.\n10.Finally save your presentation (press Ctrl+S); then run it (press F5) to see \nthe effects; press Esc when you have seen enough.\nHaving different transition effects between slides may add interest, \nbut it is not good practice. It distracts from the talk and is not good for accessibility. It is best to stick to one transition throughout (and only use a different one for effect, if you need to). \nTo standardize the transition:\n1.Remove the effects by choosing None, the first in the list; then click Apply \nto All.\n2.Next, choose your preferred transition; repeat steps 3 to 6, and then click Apply to All\n3. Finally, press F5 to see the effects.\nb. Animation Schemes\nPowerPoint allows information on your slides to appear one item at a time. This stops your audience from reading ahead of you, making them concentrated on each point individually. Figure 3.55 shows the animation tab.\nFigure 3.55 Animation tab\nTo animate a set of bullet points:\n1.Move to the ANIMATIONS tab, and then click on a slide with a bulleted list \non it.\n2.Click on the bullet points; then move the mouse over the Animations icons\nand watch the effects."
        },
        {
            "page_number": 135,
            "text": "128Unit 3 : Application Software\n3.Click on the More button at the foot of the Animations scroll bar to see more \nanimations.\nFigure 3.56 Animation options\n4. From the list of animations, choose one of them, for example, Fade.\n5. Click on Effect Options, if active, and see what is available.\n6.Repeat steps 3 to 5 for another slide with bullet points, choosing a different \nanimation.\nAs with slide transition, it is not a good idea to use too many different animations as they can distract the viewer. Always bear accessibility in mind and avoid some of the more ‘exciting’ animations.\nTo see what you can do with advanced animation:\n1. Click on the slide title on one of the slides that you have already animated.\n2.Next, click on the animation pane button in the advanced animation group \nto display the task pane."
        },
        {
            "page_number": 136,
            "text": "Grade 10 Information Technology Student’s Textbook \n  129\nFigure 3.57 Animation pane\nCurrently, the title and the picture are not animated. To add animation:\n1. Click on the add animation button and choose an entrance animation.\n2. Click the < \n > button (or move earlier in the timing group) to animate it \nbefore the list.\n3. Select the title again and this time add animation choosing an emphasis \nanimation.\n4. Repeat step 10 to move it to the second in the list.\n5. Click Play from or Preview button to view your changes.6. Next, try animating the picture, displaying it after the title animations.7.Finally, save your presentation ( press Ctrl+S), and then run it from the first \nslide (press F5) .\n8.End by closing the animation pane (click on the button or the [x] at its top \nright).\nActivity 3.1\nComplete the following activities in a group.\n1.Compare and contrast transitions and animations in PowerPoint \npresentations.\n2.Explain the importance of inserting transitions and animations into your PowerPoint presentation.\n3.Summarize and identify transition effect inserted slide and animated slide from the normal slide."
        },
        {
            "page_number": 137,
            "text": "130Unit 3 : Application Software\n3.4.2 Creating a Slide Master in PowerPoint\nA slide master is a top slide in a hierarchy of slides that stores information about \nthe theme and slide layouts of a presentation, including the background, color, fonts, effects, placeholder sizes and positioning. Figure 3.58 shows the slide master view. \nFigure 3.58 Slide master view\nTo create a slide master:\n1.On the view tab, click the slide master. In slide master view, the slide master appears at the top of the thumbnail pane with related layouts beneath it.\n2.Click to select the master slide, and then click Master Layout on the slide master tab.\n3. Make the updates that you want.\n4.To remove any built-in slide layouts that accompany the default slide master, \nin the slide thumbnail pane, right-click each slide layout that you want to delete, and then click Delete layout.\n5.To set the page orientation for all of the slides in your presentation, on the slide master tab, click Slide Orientation, and then select either portrait or landscape."
        },
        {
            "page_number": 138,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1316. On the file tab, click Save as.\n7. In the file name box, type a file name.8. In the Save as type list, click PowerPoint template, and then click Save.\nPractical Exercise 3.10\nAnswer the following items accordingly.\n1. Explain the advantages of using a slide master.2.Create a slide master by inserting your school logo or your picture on top \nof the slide master.\n3. Change the background style to style 6, and theme to crop. 4. Save your slide master and demonstrate it to your class.\nKEY CONCEPTS\nPowerPoint (ppt) is a graphical presentation program used to organize \nand present information. PowerPoint presentations consist of a number of individual pages or slides which may contain text, graphics, sound, movies and other objects that can be freely arranged.\nPresentations can be printed, displayed live on a computer or navigated through at the command of the presenter.\nTransitions are animated effects that occur when you move from one slide to another.\nSlide masters are very important features that control the layout of your whole presentation. They allow you to create your own slide template which is applied to every slide.\n3.5 Unit Summary\nWord Processing refers to the act of using a computer to create, edit, save and print documents. In order to perform word processing, a specialized software (known as Word Processor) is needed. The common example of a Word Processor is Microsoft Word; other word processing applications are also widely used."
        },
        {
            "page_number": 139,
            "text": "132Unit 3 : Application Software\nThe Insert Table dialog box enables you to create large tables by specifying up \nto 63 columns and thousands of rows. Note that in the Insert Table dialog box, \nyou can click the spin box arrows or type in the number of columns and rows you need in a table. In this exercise, you use the insert table dialog box to create a table. \nWord offers several tools for resizing rows or columns. You can resize a column \nor row using the mouse or the commands on the ribbon. You can use commands in the cell size group on the table tools – use layout tab to adjust height and width or use the ruler to adjust the column width. In addition, the table properties dialog box enables you to set the measurements at a precise height for rows or an ideal width for columns, cells and tables. \nA spreadsheet is a computer application for the organization, analysis and \nstorage of data in tabular form. Spreadsheets were developed as computerized analogs of paper accounting worksheets. The program operates on data entered in cells of a table. Each cell may contain either numeric or text data or the results of formulas that automatically calculate and display a value based on the contents of other cells. A spreadsheet may also refer to a program that displays data (text and numbers) in a table called a worksheet.\nThe real strength of spreadsheet is its capability to perform common and \ncomplex calculations. The formula is one of the essential elements of spreadsheet which enables you to add, subtract, multiply and divide numbers. When you enter a formula in a cell, the formula is stored internally and the results are displayed in the cell. You can view the underlying formula in the formula bar when the cell is active when you double-click the cell to edit it or you use the formulas tab.\nA function is a predefined formula that performs calculations using specific \nvalues in a particular order. Excel includes many common functions that can be useful for quickly finding sum, average, count, maximum value and minimum \nvalue for a range of cells. To use functions correctly, you need to understand the \ndifferent parts of a function and how to create arguments to calculate values and cells.\nThere are two types of cell references: relative and absolute. Relative and \nabsolute references behave differently when copied and filled into other cells. Relative references change  when a formula is copied to another cell. Absolute \nreferences, on the other hand, remain constant, no matter where they are copied.\nCreating a chart in spreadsheet is quick and easy. It provides a variety of"
        },
        {
            "page_number": 140,
            "text": "Grade 10 Information Technology Student’s Textbook \n  133chart types that you can choose from when you create a chart. Excel offers pie, \nline, bar and column charts. Showing data in a chart can make it clearer, more \ninteresting and easier to read. Charts can also help you evaluate your data and \nmake comparisons between different values. One of the most powerful tools in \nExcel is the ability to apply specific formatting for text and numbers. Instead of displaying all cell content in the same way, you can use formatting to change the appearance of dates, times, decimals, percentages (%) and currency ($).\nPowerPoint is a graphical presentation program used to organize and present \ninformation. PowerPoint presentations consist of several individual pages or slides, which contain text, graphics, sound, movies and other objects that can be freely arranged.\nPresentations can be printed, displayed live on a computer or navigated \nthrough at the command of the presenter. For larger audiences, the presentation is often projected onto a large screen. Handouts, speaker notes or outlines can also be produced from the slides.\nPresentations are greatly improved by adding animation. PowerPoint gives a \nwide selection of built-in animations, both when moving between one slide and the next, and within each slide. Instead of simply moving abruptly from one slide to another during a presentation, slide transitions allow slides to dissolve into each other, using a variety of different special effects. These can make your on-screen presentation look even better and more professional.\nSlide masters are very important as they control the layout of your whole \npresentation. They allow you to create your slide template which is applied to every slide. This is useful if you want to put your logo, picture, or even just your name in the same place on each slide.\n3.6 Unit Review Exercise\nPart I: Write whether the following statements are true or false.\n1.Table is an arrangement of data made up of horizontal rows and vertical columns.\n2.When you double-click and your mouse pointer has changed to the “adjust width” or “adjust height” pointers, the row/column will auto-adjust, based on the size of your text."
        },
        {
            "page_number": 141,
            "text": "134Unit 3 : Application Software\n3.A word processor is a computer application for the organization, analysis and \nstorage of data in tabular form.\n4.The real strength of Excel is its capability to perform common and complex calculations.\n5.In a worksheet, if you copy the formula = a\n1+b1 from row 1 to row 2, the formula \nwill become = a2+b².\n6. PowerPoint allows you to create static slide presentations.\n7.Transitions are animated effects that occur when you move from one slide to \nanother.\nPart II: Choose the correct answer among the alternatives provided.\n1.Which of the following is not an essential function of a word processing \nsoftware package?\nA. Indexing\nB. SavingC. EditingD. Formatting\n2. Which of the following is the benefit of Word Processor to create a table?\nA. Providing insert table dialog box B. Providing insert drawing toolsC. Providing insert quick table methodD. All of the above.\n3.Among the following, which is not the way to modify images in Microsoft \nWord?\nA. Converting them to SmartArt and adding captions \nB. Saving and deleting what you do not needC. Rotating and applying styles and colors D. Creating artistic effects and positioning images within the document"
        },
        {
            "page_number": 142,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1354._________ can be used to automatically number each page in your document.\nA. Clip arts\nB. PicturesC. Page numbersD. Smart arts\n5.Which of the following does not describe the table of content in an MS-word \ndocument?\nA.It gives users an overview of the document’s contents and organization. \nB.It allows readers to go directly to a specific section of an online document.\nC. It is a snapshot of the headings and page numbers in your document.\nD. It can be updated automatically at any time.\n6.__________ is a computer application used for organization, analysis and \nstorage of data in tabular form.\nA. Spreadsheet\nB. Word ProcessorC. PowerPointD. Word Publisher\n7.Which of the following functions calculates the average of the values in the \ncell range from B1 to B9?\nA. =AVERAGE (B1:B9)\nB. AVERAGE (B1:B9)C. =SUM (B1:B9)D. =AVERAGE (B1, B9)\n8.____________ allow your audience to see the meaning behind the numbers and \nmake showing comparisons and trends much easier in an Excel worksheet.\nA. Pictures\nB. SmartArtC. SymbolsD. Charts"
        },
        {
            "page_number": 143,
            "text": "136Unit 3 : Application Software\n9.Which of the following is not an area of importance for MS Excel in our daily \nand business lives?\nA. Availability of online access\nB. Bringing all the data to one placeC. Difficulty of arithmetic solutionsD. Analysis of charts\n10.Which of the following key combination can you press on the keyboard to \nmake a selected text bold in a worksheet?\nA.Ctrl+I\nB.Ctrl+U\nC.Ctrl+B\nD.Ctrl+V\n11.__________ is a graphical presentation program used to organize and present information.\nA. Worksheet\nB. Word ProcessorC. PowerPointD. Graphic user interface\n12. What does an animation effect do in a PowerPoint presentation?\nA. It is used to draw the audience’s attention to specific content.B. It is used to make the slide easier to read.C.It makes the presenter tell stories and communicate emotions and ideas.\nD. All of above.\n13.__________ are so important that they control the layout of your whole \npresentation.\nA. Control menus\nB. Slide mastersC. PicturesD. Slide shows"
        },
        {
            "page_number": 144,
            "text": "Grade 10 Information Technology Student’s Textbook \n  13714. How is PowerPoint Presentation so powerful?\nA. It is less text-heavy and builds space for interaction with the audience.\nB.Its visual nature encourages attention, interpretation and interest of the \naudience. \nC. It is an efficient way of conveying your full message.\nD. All of the above.\nPart III: Discuss the following questions.\n1.Discuss how word processing is so important? What are some basic \ncharacteristics of word processing?\n2. Open blank Microsoft Word, create a table and do the following.\na. Insert columns for all days of the week starting from Sunday.\nb. Insert rows for all months of the year starting from September.c. Change the table style to Grid table 5, dark-Accent 5.d. Add borders to all cells.e. Save with the name Grade 10.f.Among the SmartArt group on the insert tab, among the pyramid \ngroup, insert the basic pyramid below your table and write grade 9 at the bottom, grade 10 in the middle, and grade 10 at the top; be sure that the font size fits inside the pyramid.\ng. Save the change.\n3. What are some powerful features of Microsoft Excel?\n4.Open a blank worksheet, insert all of the data as shown in the table below and \nanswer the questions that follow it."
        },
        {
            "page_number": 145,
            "text": "138Unit 3 : Application Software\na.Calculate Total, AVERAGE, COUNT, MAXIMUM and MINIMUM on \nthe given cells (Hint: Use embedded functions).\nb. Filter students’ names A-Z.\nc. Sort the total grade from largest to smallest.d. Insert line chart by using students’ name, total grade and average.\n5. Discus the advantages of PowerPoint presentations.\n6.Open Blank PowerPoint and use the following to create your own slide master.\na. Insert Ethiopian Renaissance Dam as a title, Abay as a subtitle, Calibri-\nLight  font style, 60 font size and Green font color.\nb. Make Figure 3.59 below a logo and align left.\n        \n           Figure 3.59 Green legacy\nc. Save as Green Legacy."
        },
        {
            "page_number": 146,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1394.1 Unit Overview\nIn grade 9, unit four, you learned image processing, which is a method used to \nperform some operations on an image, get an enhanced image or contract some useful information from it. It is a type of signal processing in which input is an image and output may be an image or features associated with that image. In this unit, you are going to learn basics of multimedia, components of multimedia, multimedia file formats, application area of multimedia, multimedia authoring and authoring tools, multimedia production, multimedia editing, and computer animation and its strategies.\n4.2 Basics of Multimedia\n Brainstorming \n1. Can you state what is meant by multimedia?\n2. Can you explain what animation is?MULTIMEDIA \nAt the end of this unit, learners will be able to:\nExplain Multimedia and their components.\nDescribe multimedia authoring and its tools. \nSummarize multimedia editing. \nEdit and publish multimedia files.\nExplain computer animation.MULTIMEDIA UNIT \nIMAGE PROCESSING AND \nUNIT OUTCOMES4"
        },
        {
            "page_number": 147,
            "text": "140Unit 4 : Image Processing and Multimedia\nMultimedia is a representation of information attractively and interactively \nwith the use of a combination of text, audio, video, graphics and animation. In other words, multimedia is a computerized method of presenting information combining textual data, audio, visuals (video), graphics and animations . The \ndevelopment of the World Wide Web expanded the Internet to include pictures, sound, music and text as well. Figure 4.1 shows a combination of content forms that multimedia contains.\nFigure 4.1 Forms of multimedia content \nImportance of multimedia\nMultimedia enhances the way we learn and understand things. Integration of multiple media such as text, audio, video, graphics and animation together multiply the impact of the message.\nMultimedia is appropriate whenever a human interface connects a human \nuser to electronic information of any kind. Multimedia improves information retention. When it is properly constructed, multimedia can be entertaining as well as useful. The importance of multimedia grows as new technology develops.\nMultimedia plays an important role in education, entertainment, public places, \ncollaboration and healthcare. Let us see its importance one by one.\n1. Education:  Computer-assisted programs like Microsoft PowerPoint have \nallowed classrooms to use graphics and visuals to do presentations in creative ways. Interactive graphics make learning more visually enhanced and can clarify ideas. Multimedia activities encourage students to work in groups, express their knowledge in multiple ways, solve problems, revise their work"
        },
        {
            "page_number": 148,
            "text": "Grade 10 Information Technology Student’s Textbook \n  141and construct knowledge. The advantages of integrating multimedia in the \nclassroom are many. Students can learn new skills and knowledge without teachers’ guidance, for example virtual learning. They can also design and run websites.\nFigure 4.2 Virtual learning\nVirtual learning is a learning experience that is enhanced through utilizing computers and/or the internet both outside and inside the facilities of the educational organization. The teaching and learning activities are carried out online whereby the teacher and learners are physically separated (in terms of place, time or both). Figure 4.2 shows virtual learning.\n2. Entertainment: People can watch movies, listen to music and read books \nwith multimedia access on move. This allows people to entertain themselves wherever they go.\nFigure 4.3 Multimedia entertainment"
        },
        {
            "page_number": 149,
            "text": "142Unit 4 : Image Processing and Multimedia\n3.Public Places:  Multimedia is available at stand-alone terminals or kiosks \nused in hotels, railway stations, shopping malls, museums and libraries. The \nway we live is changing as multimedia penetrates our day-to-day experience and our culture. Today, multimedia is found in churches and places of worship as live videos with attached song lyrics shown on large screens using elaborate sound systems with special effects lighting and recording facilities.\n4. Collaboration: Multimedia platforms can be used as a collaboration device \nthat can link to two or more people from different regions of the world. People can talk over the computer through chatting, social networking and video cameras, for example virtual meeting. \nFigure 4.4 Virtual meeting\nA virtual meeting is a type of collaboration technique where people from anywhere in the world can share their ideas using audio, video conferencing, screen sharing, and webinars. Figure 4.3 shows virtual meetings.\n5. Healthcare: The healthcare staff uses multimedia applications for saving \nand sending images. Multimedia helps them make diagnoses. It is also used for medical education, training, telemedicine and virtual surgery. Figure 4.5 shows virtual surgery."
        },
        {
            "page_number": 150,
            "text": "Grade 10 Information Technology Student’s Textbook \n  143\nFigure 4.5 Virtual surgery\nVirtual surgery is a virtual reality technology that simulates surgical procedures \nwithout the need of a patient or cadaver; instead it allows surgeons to practice surgery on 3D models. It helps the surgeons to have a clear understanding of the outcome.\nTelemedicine is the exchange of medical information from one location to \nanother using electronic communication, which improves patient health status. Patients use multimedia as an informatics tool in their education and rehabilitation. Figure 4.6 shows telemedicine.\nFigure 4.6 Telemedicine\nActivity 4.1\nDiscuss the following activities in a group.\n1.Explain the benefits of multimedia in classroom teaching and learning activities.\n2.Visit certain banks in your local area and summarize their multimedia experiences.\n3. Analyze the application of multimedia in the health sector."
        },
        {
            "page_number": 151,
            "text": "144Unit 4 : Image Processing and Multimedia\n4. Explain the business implications of multimedia.\n5. Describe virtual meetings and virtual learning.\nComponents of Multimedia\nThe various components of multimedia are text, audio, graphics, video and \nanimation. All these components work together to represent information \neffectively and easily. Let us see them one by one.\n1. Text\nIn multimedia, the text is used as headlines, subtitles and captions. In addition to supplying content, the text is used to give directions and communicate information, text-based menus and buttons. These guide users through multimedia applications, electronic books, magazines and reference materials still rely on text to inform and educate. The text can have various types of fonts and sizes to suit the professional presentation of the multimedia application. Examples of fonts used to create words, sentences and paragraphs are shown in Figure 4.7 below.\nFigure 4.7 Multimedia text\n2. Graphics\nGraphics are visual elements often used to point readers and viewers to particular information. They are also used to supplement text to aid readers in their understanding of a particular concept or make the concept clearer and more interesting. Figure 4.8 shows multimedia graphics.\nFigure 4.8 Multimedia graphics"
        },
        {
            "page_number": 152,
            "text": "Grade 10 Information Technology Student’s Textbook \n  145Graphics that fit most needs are quite easy to find. Commercially prepared \ndrawings, called clipart, come packaged with many application programs. Charts, another type of graphics, can convey a great deal of information in a very limited space. Photographs can also be used to enhance multimedia applications.\nWhen a graphic or other multimedia object serves as a link to additional \ninformation about a topic, the link is called hypermedia.\n3. Audio\nA multimedia application may require the use of speech, music and sound effects. These are called audio or sound elements of multimedia. In multimedia applications, a sound that has been digitized is called audio. Audio can be obtained by capturing sound into a personal computer using a microphone or another input device. It can also be played from a synthesizer, keyboard, or another musical instrument that is connected to the computer using a MIDI (Musical Instrument Digital Interface) port.\n4. Video\nVideo can do a great deal to enhance a presentation, illustrate a proper technique or advertise a new product. Video files are photographic images played at speeds that make them appear as if the images are in full motion. Video files are incredibly large because a huge number of images are required to give appearance for the motion. \nFigure 4.9 Multimedia video\nInteractive multimedia allows users to respond directly to and control media elements. Users of interactive multimedia become active participants in an application instead of passive recipients of the information. Digital video is useful in multimedia applications for showing real-life objects.\n5. Animation\nAnimation refers to graphic images that change or move. Animation can convey information, add visual interest or draw attention to important information or"
        },
        {
            "page_number": 153,
            "text": "146Unit 4 : Image Processing and Multimedia\nlinks in a multimedia application. Animation is commonly used in advertising \nand marketing on the Web because the movement does grab visitor’s attention.\nFigure 4.10 Multimedia animation\nBy illustrating proper techniques or explaining complex procedures, animation can also serve as an excellent learning aid in computer-based training programs. Like clipart and stock photography, animated graphics are available for purchase on CD-ROM or they can be downloaded from the Internet. In addition, commercial software and shareware can be purchased or downloaded and used to create simple or complex animations. Figure 4.10 above shows multimedia animation.\nHardware and Software Requirements for Multimedia\nA multimedia computer system is a computer system capable of integrating two or more types of media (text, graphics, animation, audio and video) for the generation, storage, representation, manipulation and access of multimedia information.\nFigure 4.11 Typical multimedia computers"
        },
        {
            "page_number": 154,
            "text": "Grade 10 Information Technology Student’s Textbook \n  147To use multimedia on a computer system, one needs certain hardware components \nand software.\nHardware Requirements for Multimedia\nThe basic hardware requirements for multimedia are:\n1. Central Processing Unit (CPU) — Pentium Processor\n2. Random Access Memory (RAM) — 1 GB RAM3. Monitor — Super Virtual Graphics Arrays (SVGA)4. Video Card5. Sound Card6. CD-ROM Drive\nSoftware Requirements for Multimedia\nThe basic software requirements for multimedia are:\n1. Word processor for entering text.2. Image processing software such as Photoshop, CorelDraw, etc.3. Animation creators like 3D Max, Flash, etc.4. Sound can be created using a Sound forge and the like.5.Video can be used by using software like Video for Windows, Author Ware, \netc.\nActivity 4.2\nDiscuss the following activities in a group.\n1. Describe the components of multimedia.\n2.Explain the multimedia components that are applied on television (TV) or \nYouTube.\n3.Summarize some multimedia devices and their uses in your local environment.\n4. Describe the roles of animation in education. \n5. Describe the advantages of graphics over text."
        },
        {
            "page_number": 155,
            "text": "148Unit 4 : Image Processing and Multimedia\nKEY CONCEPTS\n2D animation is the art of creating movement in a two-dimensional space.\n3D describes animating objects that appear in a three-dimensional space. \nThey can be rotated and moved like real objects. \nVirtual reality (VR) is a special kind of graphical user interface that presents a computer-generated immersive, three-dimensional, interactive environment that is accessed and manipulated using, for instance, stereo headphones, head-mounted stereo television goggles and data gloves.\n4.3 Multimedia File Formats\n Brainstorming \n1. Can you define the term file format?\n2. Can you open different multimedia file formats on your computer?\nA file format is the structure in which information is stored or encoded in a \ncomputer file. The current multimedia file formats are used for the production and delivery of multimedia data including text, image, digital audio file and \ndigital video file formats. \nImages and photographs can be inserted inside the actual document or inked \nto the document. There are lots of different file formats for images, video and sound. The most common ones are given below.\nSound file formats\na. WAV (Windows Wave Format)\nb. MIDI (Musical Instrument Digital Interface)c. WMA (Windows Media Audio)\nImage file formats \na. TIFF (Tagged Interchange File Format) b. JPEG (Joint Photographic Experts Group)c. GIF (Graphics Interchange Format)"
        },
        {
            "page_number": 156,
            "text": "Grade 10 Information Technology Student’s Textbook \n  149d. PNG (Portable Network Graphics)\ne. BMP (Windows Bitmap Format)\nVideo file formats \na. AVI (Audio Video Interleave)b. MPEG (Moving Picture Experts Group)\nActivity 4.3\nAnswer the following activities individually.\n1. Explain each multimedia file format.\n2.Which type of multimedia file format is the most popular file format in \nyour school and local environment?\n3. Discuss the difference between digital audio and video file formats.\n4. Open a PDF file application and observe the basic layout.\n4.4 Multimedia Production\nIn basic terms, multimedia production is any sort of production that uses imagery \nand a combination of text, audio and graphics to tell a story.  This story might be \nthe sale of a product or the narration of an event. It can be educational, artistic or \nboth, or all of the above. \nMultimedia production is a complicated process which usually involves \nmany people. Typically, one or more of the following people may be involved in making a multimedia product:  production manager, content specialist, text editor, multimedia architect (or program authoring specialist), scriptwriter, computer graphic artist, audio/video specialist and computer programmer. Table 4.1 summarizes people involved in multimedia production. Brainstorming \n1.Can you explain the term multimedia production ?\n2. Why is multimedia production so important?"
        },
        {
            "page_number": 157,
            "text": "150Unit 4 : Image Processing and Multimedia\nTable 4.1 People involved in multimedia production\nPeople Involve in Multi-\nmedia ProductionRoles Played\nProduction managerdefines, coordinates and facilitates the production \nof multimedia production\nContent specialistresponsible for performing all necessary research concerning the content of the proposed application\nScriptwritervisualizes a three-dimensional environment and integration virtual reality into the product\nText editor revises all of the text-related elements\nMultimedia architect (Pro-gram authoring specialist)responsible for integrating all the multimedia elements (graphics, text, audio, music, video, photos and animation) using authoring programs\nComputer graphic artistresponsible for the graphic elements of the program - such as backgrounds, buttons and photo collages - and the manipulation and editing of pictures, 3-D objects, logos and animatic\nAudio-video specialist\tresponsible for recording and editing narration, selection, recording, sound effects and music \n\tresponsible for video capturing, editing and digitizing\nComputer programmerResponsible for programming of code lines or scripts in the authoring language\nActivity 4.4\nDiscuss the following activities in a group.\n1. Explain the influence of multimedia products in our daily lives.\n2. Describe different stages of multimedia production.3. Summarize people who involve in multimedia production."
        },
        {
            "page_number": 158,
            "text": "Grade 10 Information Technology Student’s Textbook \n  151KEY CONCEPTS\nMultimedia production is any sort of production that uses imagery and \na combination of text, audio and graphics to tell a story. This story might be the sale of a product or the narration of an event. It can be educational, artistic or both, or all of the above.\nMultimedia production begins with gathering content elements that fulfill the purpose of higher layer components, followed by integration of these \nelements to create a meaningful presentation. Content gathering refers to collecting appropriate multimedia content such as text, photo and video.\n4.5Multimedia Authoring and Authoring Tools\n4.5.1 Multimedia Authoring\nMultimedia authoring is the process of assembling different types of media contents like text, audio, image, animations and video as a single stream of information with the help of various software tools available in the market. The following are five fundamental stages of multimedia authoring:\n1. Analysis: Decide what you need to do and what you use to do it.\n2. Design:  Create storyboards to tell the story of the project.\n3. Development: Incorporate data and set it up as a prototype or model.4. Evaluation: When the prototype application works the way you want it to, \ntest it again, fine-tune it, make it attractive and then review your work.\n5. Distribution: When it is ready to go (after the evaluation phase), make it \nreal, pack and distribute it. Brainstorming \n1.What do you think is multimedia authoring ?\n2.Can you mention any tool that can be used to create interactive applications?\n3. What are multimedia authoring tools?"
        },
        {
            "page_number": 159,
            "text": "152Unit 4 : Image Processing and Multimedia\n4.5.2 Multimedia Authoring Tools\nMultimedia authoring tools are the tools that provide capability for creating a \ncomplete multimedia presentation including interactive user control, which are called authoring tools/programs.\nMultimedia authoring tools give an integrated environment for joining \ndifferent elements of multimedia production together. The authoring can be described as creating highly interactive applications in which the information can flow in both directions, i.e. from application to user and from user to application. \nMultimedia packages and authoring tools help us to create higher-quality \naudio and video applications with little expertise.Some multimedia authoring packages are:\na.Macromedia Authorware\nb. Adobe Premier\nc. Macromedia Flash d.Everest Authoring System\ne.Icon Author \nf. ImageQ\nSome multimedia authoring tools are:\na. Computer b. Scannerc. Digital camera d. Sound recorder\nActivity 4.5\nAnswer the following activities individually.\n1. Discuss the term multimedia authoring .\n2. Analyze the advantages of multimedia authoring and authoring tools."
        },
        {
            "page_number": 160,
            "text": "Grade 10 Information Technology Student’s Textbook \n  153Screen elements of multimedia application\nWe should open a multimedia application for having a look at the screen elements. \nHere, we are using Macromedia Flash.\nTo open Macromedia Flash,\nClick Start  All Programs  Macromedia  Macromedia Flash MX.\nFigure 4.12 shows the Macromedia Flash screen elements.\nFigure 4.12 Macromedia Flash screen elements\nSome Screen elements of Macromedia Flash MX are described in Table 4.2 below.\nTable 4.2 Macromedia Flash MX screen elements\nScreen Element Description\nMenu bar contains various menus for commands\nTimeline windowcontrols when things happen during the playback of the movie, for example playback. time, frame rate, etc.\nWork areaconsists of the Flash stage (white area in the middle of the Work area) and Workspace (grey area)\nLayer panelcontrols the layers (the transparent overlays on the stage where different object scans are placed). It is an integral part of the timeline\nToolboxcontains all the tools you need for drawing or selecting objects"
        },
        {
            "page_number": 161,
            "text": "154Unit 4 : Image Processing and Multimedia\nPanelsFlash makes extensive use of panels (different parts of \nthe screen), for example, options panel, action panel, properties panel, etc.\nCreating a new Project\nTo create a new project,\nClick File  New.\nIt will open a new project file.\nYour new project can be in the form of drawing, shape or even an animation.Let us start with a simple project, i.e. drawing a rectangle and filling it with colors.\nBuilding a basic piece\nYou can draw a basic drawing piece in the work area by using various drawing tools (Line Tool, Rectangular Tool, Oval Tool, etc.) from the toolbox.\nTo insert a rectangular box, perform the following steps:\n1. Click on Rectangle Tool.\n2. Draw a rectangle box in the work area.3.Click on the Paint Bucket Tool and select the desired color from Color \nSwatches.\n4. Click inside the rectangle box and fill in the color (See Figure 4.13).\nFigure 4.13 Building a basic piece"
        },
        {
            "page_number": 162,
            "text": "Grade 10 Information Technology Student’s Textbook \n  155Now save your basic piece with a suitable file name.\nTo save the file,\nClick File  Save or press Ctrl+S.\nAnother type of project which can be created using multimedia is animation. For \nthis, we can rotate the figure at different angles. When we run the project, we get the impression of animation.\nTo apply the animation to the basic piece, perform the following steps.\n1. Click the first frame in the layer you want to frame.\n2.Place the object you want to animate or just insert an image from the clipart.\n3. Click the next frame in the Timeline window.4.Add a key frame. Flash inserts a key frame that duplicates the previous \nframe’s contents.\n5. Change the object slightly; change it to 90° to the right.\n6. Repeat steps 4 and 5. This time the image will turn face down.7.Now again repeat the same steps, turning the figure to 270° so that it now \nfaces to the left. This way you can change the angle to a smaller degree and make frames if you want to have real fun.\n8.Click on the first key frame in the layer and press Enter key to see the animation.\nYour animation will be shown on the screen (See Figure 4.14).\nFigure 4.14 Showing an animation"
        },
        {
            "page_number": 163,
            "text": "156Unit 4 : Image Processing and Multimedia\nTo preview the animated test movie, click Control  Test Movie or \nCtrl + Enter.\nEditing an icon\nAn icon is an element (graphical, textual, audio or video) that we can see or listen \nto using Graphical User Interface (GUI). In other words, an icon is a broad term associated with multimedia elements.\nDuring the creation of multimedia projects, it is necessary to modify properties \nlike appearance, placement, size, time duration and other animation-related items. It is known as editing an icon.\nTo edit an icon, perform the following steps.\n1. Select the icon by clicking on it.\n2.Now you can see the properties of the selected icon at the bottom of the \nscreen in the properties panel.\n3.Change the displayed properties like contents, sound, color, etc. as per your need.\n4.After making the changes, you can run and pause the project to see the edited icon. If you are still not satisfied with the modifications, you can re-edit the icon.\nActivity 4.6\nAnswer the following activities in a group.\n1. Explain the term icon.\n2.Summarize the basic software that is available in the market for multimedia \nauthoring.\n3. Explains how much multimedia projects are interactive."
        },
        {
            "page_number": 164,
            "text": "Grade 10 Information Technology Student’s Textbook \n  157KEY CONCEPTS\nMultimedia authoring is the process of assembling different types of media \ncontents like text, audio, image, animations and video as a single stream of information with the help of various software tools available in the market.\nAuthoring is the process of creating multimedia applications. \nMultimedia authoring tools give an integrated environment for joining different elements of a multimedia production together. It gives the framework for organizing and editing the components of a multimedia \n4.6 Multimedia Editing\nMultimedia editing  is a broad term that covers the creation and manipulation of \ndigital audio-visual files such as image, audio and video files. It can also include elements such as animation and graphics.\n4.6.1 Inserting and Editing Text\nInserting display icons\nDisplay icons are those icons that display some images or graphics. These are available in the form of various items such as symbols, tools, figures and text. These are available individually or in combinations, so you can use them the way you want. The processes of inserting display and graphic icons are similar.\nInserting text into a text field\nTo insert a text, perform the following steps.\n1. Open a new project file.\n2. Click on the Text Tool button.3. Click and drag a text field in the work area. Brainstorming \n1. What do you think is multimedia editing?2. What is the role of a multimedia editor?"
        },
        {
            "page_number": 165,
            "text": "158Unit 4 : Image Processing and Multimedia\n4.Type the desired text and click anywhere in the work area to deactivate the \ntext field.\nFigure 4.15 shows a text inserted in the new project.\nFigure 4.15 Inserting text\nImporting and pasting text\nTo import a file, perform the following steps.\n1.  Open a new project.\n2. Click File  Import. The Import dialog box opens.\n3. Select the desired file and click Open.4. The selected file will be imported into the work area.\nTo paste the text, perform the following steps.\n1. Open a new project.2. Select and copy the desired text from the document you want.3. Now return to your project file and click Edit \n Paste or press Ctrl + V.\nThe selected text will be pasted into the project file."
        },
        {
            "page_number": 166,
            "text": "Grade 10 Information Technology Student’s Textbook \n  159Defining and applying text style\nTo define and apply text style, perform the following.\n1. Click on the Text Tool button.\n2.From the Properties tool panel (See figure 4.16) lying below the work area, \nset your desired Text type, character position, Character Spacing, etc.\nFigure 4.16 Properties tool panel\n3.Now, draw the text field by using click and drag, and enter your text. The \ntext style will be applied to the text.\nIf the Properties panel is not displayed, then select the Text Tool, right-click on the work area and click on Properties.\nEditing and formatting text as required\nTo edit and format a text, perform the following steps.\n1. Click on the text field and edit the text you want.\n2.Select the text entered in the text field and set the desired font, alignment, \ncolor, etc. from the Properties tool panel (See figure 4.17).\nFigure 4.17 Editing and formatting text"
        },
        {
            "page_number": 167,
            "text": "160Unit 4 : Image Processing and Multimedia\n4.6.2 Working with Images and Graphics\nIn this sub-unit, we will learn about working with images and graphics.\nImporting and pasting image or graphic\nTo import an image, perform the following steps.\n1. Click on File  Import.\n2. The Import dialog box opens.\n3.Select the image you want to import and click Open. The image file will be \nimported to your project (See figure 4.18)\nFigure 4.18 Importing an image\nTo paste an image, perform the following steps.\n1. Copy the desired image you want to paste.\n2. Click Edit   Paste or Press Ctrl+V to paste the image.\n3. The image will be pasted into your project."
        },
        {
            "page_number": 168,
            "text": "Grade 10 Information Technology Student’s Textbook \n  161Modifying an image or graphic\nTo modify the image or graphic, perform the following steps.\n1. Select the image by clicking on it.\n2.Click on Free Transform Tool button in the toolbox. A boundary box will be \napplied to the image or graphic.\n3.Now, in the options panel, select the operation (Rotate and Skew, Scale, Distort or Envelope). The desired operation will be applied to the image or graphic.\nPractical Exercise 4.1\nComplete the following exercises.\n1.Record any event in your local area and edit it using a relevant multimedia editing tool. Then save it on C drive with the name My Video.\n2.Write half page of your biography and edit it using a text editor. Save it on the desktop with the name Bio and observe its file extension.\n3.Capture your selfie image and edit it using an image editor and save it on your desktop with the name Selfie.\n4.6.3 Page Transitions, Positioning and Motion icon\nIn this sub-unit, we will discuss page transitions, positioning and motion icons. Here, we will use Adobe Premiere Elements 9. It is one of the premier software for working with sounds and digital movies.\nTo open Adobe Premiere Elements 9,\nClick Start  Programs  Adobe Premiere Elements 9\nFigure 4.19 shows the opening screen of Adobe Premiere Elements 9."
        },
        {
            "page_number": 169,
            "text": "162Unit 4 : Image Processing and Multimedia\nFigure 4.19 Opening screen of Adobe Premiere Elements 9\na. Transitions\nTransitions let you add effects to phase out one clip and phase in the next, and \nthen preview the transition before applying it. You can customize audio and video transitions as gradual fades or have one clip replace another.\nUsing transitions, you can phase out one clip while phasing in the next or you \ncan stylize the beginning or end of a single clip. A transition can be as subtle as a cross dissolve or emphatic such as a page turn or spinning pinwheel.\nYou generally place transitions on a cut between two clips, creating a double-\nsided transition. However, you can also apply a transition to just the beginning or end of a clip, creating a single-sided transition such as a fade to black. When a transition shifts from one clip to the next, it overlaps frames from both clips. The overlapped frames can either be frames previously trimmed from the clips (frames just past the In or Out point at the cut) or existing frames repeated on either side of the cut. It is important to remember that you do not delete frames when you trim a clip; instead, the resulting In and Out points frame a window over the original clip. A transition uses the trimmed frames to create the transition effect or the transition repeats frames if the clips do not have trimmed frames.\nTo see if a transition is single-sided or double-sided or  has repeated frames, select it and click Edit Transition in the Transition view of the Task panel to view it in the Properties view."
        },
        {
            "page_number": 170,
            "text": "Grade 10 Information Technology Student’s Textbook \n  163Selecting transitions\nThere are many transitions to choose from that come with Adobe Premiere \nElements 9. First-time filmmakers tend to overuse this feature. They only add a transition when it makes sense; otherwise, they tend to distract from the video. Add transitions after editing and before adding the soundtrack.\nFigure 4.20 Selecting transitions\nYou can select the desired transition effect by clicking Edit  Transitions. Figure \n4.20 shows various types of transitions effects.\nb. Positioning objects\nYou have full flexibility in adjusting an object’s position, rotation, scale and opacity - attributes collectively referred to as transform properties. To transform an object, you can drag it into the Monitor panel or choose a command from the title menu.\nTypes of position\nYou can choose among different types of positions of transition effect like Start, End, Centre, etc. from the Transition properties window. It can be opened by clicking on the Edit Transition button.\nTypes of motion\nWe can customize different types of motion by using different drawing tools such as Line Tool, Oval Tool, Rectangle Tool and Lasso Tool. Figure 4.21 shows zig-zag motion."
        },
        {
            "page_number": 171,
            "text": "164Unit 4 : Image Processing and Multimedia\nFigure 4.21 Zig-zag motion using Line Tool\nc. Using motion Icon\nMotion is a special layer effect that an object shows during its movement. Creating \na motion is quite simple in Macromedia Flash MX. We can generate the motion effect by creating a guide layer.To use the motion icon in Macromedia Flash MX, perform the following steps.\n1.Create a graphic symbol or drag a pre-existing graphic symbol from the library onto the stage. Name the layer as Graphic.\n2.Right-click on the Graphic label and select Add Motion Guide from the pop-up window (See Figure 4.22)."
        },
        {
            "page_number": 172,
            "text": "Grade 10 Information Technology Student’s Textbook \n  165\nFigure 4.22 Adding motion guide to the selected layer\nA new layer will appear on the top of the graphic layer with the label guide: \ngraphic along with the guide icon.\n3. Draw the path for your symbol in this new layer using a pencil or line tool.\nFor example, draw a circle.\n4.Select frame 60 of the guide layer and press F5 to insert the frames (See Figure 4.23).\nFigure 4.23 Inserting frames"
        },
        {
            "page_number": 173,
            "text": "166Unit 4 : Image Processing and Multimedia\n5.Now go to Frame 1 of the Graphic layer and drag your symbol to one end of \nyour path. \n6.While dragging, you will see a bubble on the symbol. That bubble should go right below the path.\n7.Now go to Frame 60 of the graphic layer and press F6 to insert a new key frame.\n8.Now drag your symbol to another end of your path. Again, the bubble should go right below the path.\n9.Select any frame between 1 and 60 of your graphic layers. Right-click and select Create Motion Twee from the pop-up menu (See Figure 4.24).\nFigure 4.24 Creating Motion Tween\n10.Press Ctrl + Enter to view your work.\n4.6.4 Libraries\nThe multimedia library contains visual and audio elements (icons) required for developing new multimedia contents. The contents are often in the form of audio and video files. To ensure full access, the users must have appropriate software to view the multimedia files."
        },
        {
            "page_number": 174,
            "text": "Grade 10 Information Technology Student’s Textbook \n  167Creating\nYou can use the sample libraries included with Flash to add symbols, buttons or \nsounds to your documents. You can also create your sample libraries, which you can then use with any documents that you create.To create a sample library for your Flash application, perform the following steps.\n1.Create a Flash file with a library containing the symbols that you want to include in the permanent library.\n2.Place the Flash file in the libraries folder located in the Flash application folder on your hard drive.\nSaving\nWe can save our information to the Flash application library so that it is available for future use.To save the information, perform the following steps.\n1. Click File \n Save As\nThe Save As dialog box opens (See Figure 4.25).\nFigure 4.25 Save As dialog box\n2. Identify the location where you want to save the file.\n3. Give a suitable file name and click Save."
        },
        {
            "page_number": 175,
            "text": "168Unit 4 : Image Processing and Multimedia\nOpening and closing\nOpening the Library\nTo open a library, perform the following steps.\n1.  Click File  Open as Library\nThe Open as Library dialog box appears (See Figure 4.26).\nFigure 4.26 Open as Library dialog box\n2. Browse the library file and click Open\nClosing the library\nTo close the library,\nClick File  Close or press Ctrl + W.\nAnother way of closing the library is to exit the application or opening another library file.\nSelecting a library\nWhen the Open as Library dialog box opens, you can select the desired library file."
        },
        {
            "page_number": 176,
            "text": "Grade 10 Information Technology Student’s Textbook \n  169Adding icons to the library\nTo add an icon to the library, perform the following steps.\n1. Open a library file.\n2. Click File  Import or press Ctrl + R.\n3. The Import dialog box will open.4. Choose the desired icon file and click Open.5. An icon for that file will be added to the library\nUsing an icon from a library\nTo use an icon from a library, perform the following steps.\n1. Open the library file.2. Select the desired icon from the library by double-clicking it.\n4.6.5 Working with Sound and Digital Movies\nSound icon\nThe sound icon is the graphical representation of inserted or available audio files \nin a project or library. Figure 4.27 shows a sound icon.\nFigure 4.27 Sound icon\nImporting sound\nYou can import various sounds into the project.To import a sound file, perform the following steps.\n1. Click Organize \n Get Media Files and Folders."
        },
        {
            "page_number": 177,
            "text": "170Unit 4 : Image Processing and Multimedia\nThe Add Media dialog box opens.\n2. Browse the audio file you want to import and click Open.\n3. The selected audio file will be imported into the project (See Figure 4.28).\nFigure 4.28 Imported sound\nChanging sound’s play speed\nTo change a sound’s play speed, perform the following steps.\n1. Drag the imported audio file to the Timeline (See Figure 4.29).\nFigure 4.29 Dragging sound to the Timeline\n2. Right-click on the imported sound waveform and click Time Stretch.3. The Time Stretch dialog box opens (See Figure 4.30)."
        },
        {
            "page_number": 178,
            "text": "Grade 10 Information Technology Student’s Textbook \n  171\nFigure 4.30 Time Stretch dialog box\n4. Set the playback speed and click OK.\nWorking with digital movies\nDigital video is a type of video recording system that works by using a digital \nrather than an analog video signal. We can work on digital movies using Adobe Premiere. It allows various operations such as trimming, motion audio enhancing and adding transition effect.\nFile formats\nAdobe Premiere supports several file formats for audio and video files such as MP3, MP4, AVI, MPG, WAV and WMV.\nImporting digital movie\nTo import a digital movie, perform the following steps.\n1.Import your digital media clip or movie by clicking Organize  Get Media \n Files and Folders.\n2. Browse the video file and click Open.\n3. The selected video file will be imported to your project (See Figure 4.31)."
        },
        {
            "page_number": 179,
            "text": "172Unit 4 : Image Processing and Multimedia\nFigure 4.31 Imported video\nSetting playback conditions\nWe can set various playback conditions from the audio properties such as Fade \nIn, Fade Out, Bypass, Balance, Time Duration, Toggle, Repeat and Clip Volume. To open an audio properties dialog box, right-click on the dragged audio file in Timeline and click Show Properties (See Figure 4.32).\nFigure 4.32 Setting playback conditions\nTurning sounds off\nTo turn a sound off, perform the following steps."
        },
        {
            "page_number": 180,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1731.Open the audio properties dialog box by right-clicking on the dragged audio \nfile in Timeline and clicking Show Properties.\n2. Toggle the Volume effect by clicking on the toggle button (See Figure 4.33).\nFigure 4.33 Turning the sound off\n4.6.6 Overview of Film Editing\nBasics of film editing\nThe process of editing clips includes previewing and trimming them to eliminate unnecessary material. It also includes revising clip properties such as speed, direction and duration. You can edit media clips generated by other programs in their original applications, within Adobe Premiere elements.\nTrimming video clips\nYou can create a refined good-quality video file by removing unwanted and low-quality sections. Adobe Premiere Elements 9 enables you to efficiently deal with blurred, shaky and unwanted low-quality and low-interest sections of your video file. You can easily and quickly edit and fine-tune the video files. \nFigure 4.34 Trimming a video clip"
        },
        {
            "page_number": 181,
            "text": "174Unit 4 : Image Processing and Multimedia\nSmart trimming enables you to trim the low-quality sections of a video file. \nSmart trim can be done manually and automatically. You can trim clips from the Timeline view or scene line view. However, you can trim only one clip at a time from the scene line view. Smart trimming is of two types: manual and automatic. \nManual smart trimming is the default mode. In this mode, you can specify the options that determine the trimmable sections. \nIn the automatic smart trim mode, the adobe premiere elements automatically determine the trimmable sections and you can choose to delete them or retain them. Figure 4.34 shows the trimming of a video clip.\nChanging clip speed and duration\nChanging clip speed \nTo create a fast- or slow-motion effect, we can change clip speed. Changing clip \nspeed changes, the clip’s duration. Speeding up a clip removes frames, thus shortening the clip duration. In the same way, slowing down a clip repeats frames and thus adds to the length of a clip. For audio clips, the change in speed also changes its pitch. The time-stretch command includes an option to maintain the original pitch of an audio-clip at any speed.You can change a clip’s speed using the Timeline only - not the Scene line.\nWhen you change the speed of a clip containing interlaced fields, you may need to adjust how adobe premiere elements process the fields, especially when the speed drops below 100% of the original speed.\nSetting clip duration \nThe duration of a video or audio clip is the length of time it plays from its first frame (in point) to its last frame (out point). The initial duration of a clip is the same as it was when the clip was imported or captured. Most often, you change a clip’s duration by trimming frames from either ends. But you can also trim the end of a clip by designating a specific duration.\nUnlike video, still, images are not limited to the length of the original clip. You \ncan set their duration to any length."
        },
        {
            "page_number": 182,
            "text": "Grade 10 Information Technology Student’s Textbook \n  175Freezing and holding frames\nExporting a video frame\nYou can grab a single frame from a video clip to use as a still image in your current \nmovie or save it as a still on your hard drive for use elsewhere. For example, you can use a still image in your movie to show a character starting an action, but then stopping mid-action, frozen on the screen.\nPlaying and holding a frame\nTo make the video started as a still image and then begin to play, you need to click the Freeze Frame button in the Monitor panel to create a still image from a frame, and then insert that still image at the location of the original frame. Figure 4.35 shows a freeze-frame.\nFigure 4.35 Freeze frame"
        },
        {
            "page_number": 183,
            "text": "176Unit 4 : Image Processing and Multimedia\nPractical Exercise 4.2\nPractice the following exercises in a group.\n1. Create any video clip you like.\n2. Trim your video clip.3. Set duration of a clip. 4. Freeze frame and demonstrate it to your class.\nMultimedia and hypermedia\nMultimedia is a much broader form of digital media defined as an integration \nof different forms of content such as text, pictures, graphics, audio, animations and video where the information is processed digitally. In simple terms, it is the representation of content using multiple forms of media through computer software and hardware. \nHypermedia, on the other hand, is a more diverse, non-linear form of digital \nmedia. It is an extension of the term hypertext in a non-linear way, meaning it is multimedia presentation of non-linear forms of media which are linked together by a hypertext program. The best example of hypermedia is World Wide Web.\nActivity 4.7\nAnswer the following activities accordingly in a group.\n1.Explain and demonstrate the difference between multimedia and hypermedia.\n2. Describe forms of computer animation.\n3. Explain some of the animation software.4.Draw any figure you like and animate it using an animation tool: then save \nit on your desktop with the name Animation.\n5. Discuss the advantages of computer animation."
        },
        {
            "page_number": 184,
            "text": "Grade 10 Information Technology Student’s Textbook \n  177KEY CONCEPTS\nMultimedia authoring involves collating, structuring and presenting \ninformation in the form of digital multimedia, which can incorporate text, audio, and still and moving images.\nMultimedia authoring tools are the tools that are used for creating various types of multimedia applications.\nDisplay icons are the ones that display some images or graphics.\nThe wait icon provides a way to pause or delay any onscreen action. Delay can be a set time interval or may require a mouse click to continue.\nThe multimedia library contains visual and audio elements (icons) required for developing a new multimedia content.\nThe process of editing clips includes previewing and trimming them to eliminate unnecessary material and revising clip properties such as speed, direction and duration.\n4.7 Unit Summary\nMultimedia is a representation of information attractively and interactively with the use of a combination of text, audio, video, graphics and animation. Multimedia is very useful in education, training, marketing, advertising, product demos, databases, catalogs, entertainment, and networked communications.\nMultimedia authoring involves collating, structuring and presenting \ninformation in the form of digital multimedia which can incorporate text, audio, and still and moving images. Multimedia authoring tool is a program that helps you write hypertext or multimedia applications. Authoring tools usually enable you to create a final application merely by linking together objects such as a paragraph of text, an illustration or a song. \nMost authoring systems support a scripting language for more sophisticated \napplications. Authoring tools require less technical knowledge to master and are used exclusively for applications that present a mixture of textual, graphical and audio data."
        },
        {
            "page_number": 185,
            "text": "178Unit 4 : Image Processing and Multimedia\nMultimedia files can be presented in several formats such as text, image, \nand digital audio and video. Multimedia editing is a broad term that covers the \ncreation and manipulation of digital audio-visual files such as image, audio and video files. It can also include elements such as animation and graphics.\nComputer animation is the art of creating moving images via the use of \ncomputers. It is a subfield of computer graphics and animation. Computer animation is essentially a digital successor to the art of stopping animation motion of 3D models and frame-by-frame animation of 2D illustrations.\n4.8 Unit Review Exercise\nPart I: Write whether the following statements are true or false.\n1.The text can have various types of fonts and sizes to suit the professional presentation of the multimedia software.\n2.A Multimedia application is an application that uses a collection of single and unique media sources.\n3.Multimedia authoring is the process of assembling different types of media contents, like text, audio, image, animation and video, as a single stream of information.\n4.In multimedia packages, using pre-stored libraries, creating libraries, and adding and using icons is not possible.\n5.Macromedia Author ware, Adobe Premier, and Macromedia Flash are multimedia packages.\nPart II: Choose the correct answer among the alternatives provided.\n1.________ is a computerized method of presenting information combining textual data, audio, visuals (video), graphics and animations.\nA. Multimedia\nB. MultiprocessorC. MultithreadingD. Word processor"
        },
        {
            "page_number": 186,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1792. Which one of the following is not feature of multimedia authoring tools?\nA. Editing\nB. OrganizingC. InteractivityD. Complex branching\n3. Which of the following is the common area of applications of multimedia?\nA. Marketing and advertisingB. EntertainmentC. HomeD. All of the above.\n4.TIFF stands for __________________.\nA. Transitional Image File Format B. Total Inclusion File FormatC. Tagged Interchange File Format D. Temporary Instruction File Format\n5. Which of the following hardware is used in the multimedia authoring tools?\nA. Computer B. Scanner C. Sound recorder D. All of the above.\n6.___________ is a broad term that covers the creation and manipulation of \ndigital audio-visual files such as image, audio and video.\nA. Multimedia authoring\nB. Multimedia productionC. Multimedia presentationD. All of the above."
        },
        {
            "page_number": 187,
            "text": "180Unit 4 : Image Processing and Multimedia\n7.__________ is the most popular format for storing and downloading music.\nA. AIFF (Audio Interchange File Format)\nB. MPEG Layer-3C. WMA (Windows Media Audio)D.RA (Real Audio)\n8._________ is the art of creating and moving images via the use of computers.\nA. Computer animationB. Computer image editionC. Computer graphicsD. Computer movie maker\n9.The best example of hypermedia is ________________. \nA. world wide webB.  hardware C. printout D. None of the above.\nPart III: Discuss the following questions.\n1. Define multimedia and explain its components.\n2. List and explain the stages of multimedia authoring.3. Explain the role of the multimedia editor.4. Discuss the benefits of multimedia edition.5.Identify screen elements of the multimedia application Macromedia Flash \nshown in Figure 4.36."
        },
        {
            "page_number": 188,
            "text": "Grade 10 Information Technology Student’s Textbook \n  181Figure 4.36 Macromedia flash\n6. Stretch the steps used to import sound files.\n7. Write a short note on the basics of film editing."
        },
        {
            "page_number": 189,
            "text": "182Unit 5 : Information and Computer Security\n5.1 Unit Overview\nIn grade 9, you learned basic concepts of information and computer security. \nYou know that computer viruses can corrupt and damage computers. Viruses can also open security breaches on a computer that allows yet another threat, hackers, into the computer system. It is known that simply by the fact of having our school or home computers connected to a network and on the Internet are exposed to several information and computer security risks. Figure 5.1 show that networking of computers exposes information and computer security.\nFigure 5.1 Networking of computers At the end of this unit, learners will be able to:\nExplain information security.\nApply steps to install antivirus software.\nCreate and change user account in their computers.\nExplain privacy and security.\nAnalyze cyber security. UNIT \nINFORMATION AND COMPUTER\nUNIT OUTCOMES5\nSECURITY"
        },
        {
            "page_number": 190,
            "text": "Grade 10 Information Technology Student’s Textbook \n  183In this unit you are going to learn advanced concepts on information security, \ncomputer security, impact of information and computer security on society, \nprivacy and security, threat prevention strategies and cyber security.\n5.2 Information and Computer Security\n Brainstorming \n1. What does it mean by information security?\n2. Why do you think we need to secure our data and computers?\nInformation Security\nInformation security is one of the most important and exciting career paths today \nall over the world. Information security is simply referred to as InfoSec, which is \nthe practice of defending information from unauthorized access, use, disclosure, disruption, modification, perusal, inspection, recording or destruction.\nComputer Security\nComputer security, also known as cyber security, is about information security as \napplied to computing devices such as computers and smartphones as well as computer networks such as private and public networks including the whole \nInternet.  It is a method for ensuring data that has been stored in computer systems \ncould not be read or compromised by any individuals without authorization. Traditionally, information technology (IT) facilities have been protected for three reasons:\nTo prevent theft of or damage to the hardware.\nTo prevent theft of or damage to the information.\nTo prevent disruption of service.\nActivity 5.1\nAnswer the following activities individually.\n1. Summarize the problems of unsecured information and computer.\n2.Explain how computer network relates to information and computer \nsecurity risks."
        },
        {
            "page_number": 191,
            "text": "184Unit 5 : Information and Computer Security\n5.3 Impact of Information and Computer Security on Society\n Brainstorming \n1. What does it mean by information or computer security?\n2. Where do information and security risks arise from?\nInformation and computer security risks arise from the intentional or unintentional \nmisuse of computers and network resources as well as the Internet. These risks may result in the loss of or damage to computer hardware, software, confidential information and data integrity as well as network and Internet availability.\nHackers can do several things from stealing your passwords to controlling \nyour computer through remote access. So, every student and another computer user must know about information and computer security. Remember that violation of information and computer security is punishable. \nFigure 5.2 Impacts of information and computer security on a society3. Describe what will happen if your school network lacks availability?\n4.Explain the advantages of protecting information technology (IT) resources \nin school."
        },
        {
            "page_number": 192,
            "text": "Grade 10 Information Technology Student’s Textbook \n  185All of us must make sure that we are aware of the security risks and develop \nthe ability to know what to do in different situations. Figure 5.2 shows the impact \nof information and computer security on society.\n5.4 Privacy and Security\n Brainstorming \n1. Can you state what is meant by privacy?\n2. Do you think that security and privacy are related to each other?Activity 5.2\nDiscuss the following activities in a group.\n1. Discuss how information and computer security influence community.2.Discuss the consequences of violation of information and computer security.\n3. Explain the importance of securing your computer.\nKEY CONCEPTS\nA Hacker is a person who uses computers to gain unauthorized access to \ndata.\nInformation security (referred to as InfoSec) is the practice of defending \ninformation from unauthorized access, use, disclosure, disruption, \nmodification, perusal, inspection, recording or destruction.  \nComputer security is concerned with information security as applied to computing devices such as computers, smart phones and computer networks such as private and public networks, including the whole Internet.\nInformation and computer security risks arise from intentional or unintentional misuse of computers, network resources and the Internet. These risks may result in the loss of or damage to computer hardware, software, confidential information and data integrity as well as network and Internet availability."
        },
        {
            "page_number": 193,
            "text": "186Unit 5 : Information and Computer Security\nPrivacy is concerned with safeguarding and respecting people’s rights to manage \ntheir data in a broader sense. Individuals should have the right to access – if they ask for it – as well as the opportunity to modify or erase erroneous information about themselves that firms maintain in databases according to privacy activists.\nPrivacy, like security, is crucial because it prevents data. Security is concerned \nwith information leaks caused by malware infections and data breaches whereas privacy is concerned with personal data rights in terms of how information is acquired, utilized and maintained as well as who has access to it.\n5.4.1 Data Privacy \nData privacy or information privacy is concerned with proper handling, \nprocessing, storage and usage of personal information .It is all about the rights of \nindividuals concerning their personal information.\nFigure 5.3 Data privacy\n5.4.2 Data Security \nData security is concerned with measures that an individual or organization is taking to prevent any third party from unauthorized access. \nFigure 5.4 Data security"
        },
        {
            "page_number": 194,
            "text": "Grade 10 Information Technology Student’s Textbook \n  187Activity 5.3\nAnswer the following activities accordingly in a group.\n1. Compare and contrast privacy and security.\n2.Visit computer laboratory or any computer in use in your school. Observe \nthe security mechanisms applied and report to your class.\n3. Explain types of computers and information privacy. \n4. Explain data privacy and security.5. Discuss the practice of data privacy or security in a Google Gmail account.\nKEY CONCEPTS\nPrivacy is concerned with safeguarding and respecting people’s rights to \nmanage their personal data in a broader sense.  \nSecurity is concerned with information leaks caused by malware infections and data breaches whereas privacy is concerned with personal data rights in terms of how information is acquired, utilized and maintained as well as who has access to it.\nData privacy or information privacy is concerned with proper handling, processing, storage and usage of personal information whereas data security\nis concerned with policies, methods and means to secure personal data.\n5.5 Computer Security Threats\nA security threat  is a malicious act that aims to corrupt or steal data or disrupt \nschool or organization systems. Security event refers to an occurrence during which school data or its network may have been exposed. An event that results in a data or a network breach is called a security threat. Some of the computer security threats are computer viruses, computer worms, Trojan horses, spyware, adware and ransomware. Brainstorming \n1. Can you describe the term security threat?\n2. Can you mention any computer threat you have heard of before?"
        },
        {
            "page_number": 195,
            "text": "188Unit 5 : Information and Computer Security\nActivity 5.4\nAnswer the following activities.\n1. Explain the term malware.\n2. Analyze types of computer security threats.3.Summarize how your school or personal computers are exposed to malware.\n4. Discuss the difference between computer viruses and computer worms.5. Explain mechanisms to protect the computer security threat. \nKEY CONCEPTS\nSecurity threat is a malicious act that aims to corrupt or steal data or disrupt \na school’s computer network or organization’s systems. It is an event that results in a data or a network breach.\nSecurity event refers to an occurrence during which school data or its network may have been exposed.\nComputer virus is a malicious program which replicates itself and infects \nthe files and programs of your PC and can make them non-functional.\nComputer worm is self-replicating computer program that spreads malicious \ncodes using computer networks.\n5.6 Threat Prevention Strategies\n Brainstorming \n1. Can you explain threat prevention?\n2.Do you think that taking a backup of data is related to threat prevention \nstrategies?\nSeveral defensive strategies and tools have been developed to assist in preventing threats. These include encryption, firewalls, anti-virus software, biometric security, user identification and passwords, security monitors and disaster recovery."
        },
        {
            "page_number": 196,
            "text": "Grade 10 Information Technology Student’s Textbook \n  189Hence, threat prevention strategies could be categorized into two: technical and \nnon-technical . Table 5.1 shows basic technical prevention strategies.\n5.6.1 Technical Prevention Strategies\nTable 5.1 Technical prevention strategies\nTechnical Prevention \nStrategyDescription\nTaking data backupCreating multiple copies of data to recover in case \nof any data loss using the external hard drive, CD, Flash memory or online data backup site, such as the cloud, in case of any data loss.\nInstalling protective electrical devicesInstalling devices such as Uninterruptible Power Supply (UPS) that can provide battery backup in case of a power outage.\nInstalling antivirus and antispyware programsWhen using the Internet, you might encounter spyware or virus, which causes great damage to your computer. It is important to install an antivirus and antispyware program that can prevent and remove the viruses.\nInstalling firewall A firewall system prevents unauthorized access to a private network from network traffic. A firewall system forms a barrier between trusted and untrusted websites from threats like hackers and worms.\nEncrypting dataPreventing lost, stolen or hacked documents and files from being seen.\nInstalling anti-virus \nsoftwareAntivirus software is a type of program designed \nand developed to protect computers from malware like viruses, computer worms and spyware. \nCreating and changing user accountA user account is a collection of settings and permissions specific to a user that determines what a user can and cannot do on the computer.\nMS Windows computer has come up with a backup system."
        },
        {
            "page_number": 197,
            "text": "190Unit 5 : Information and Computer Security\nIn Window, the path to locate the backup data option could be :  Right click \non the Start button  click on Control Panel  click on System and Security \nclick Backup and Restore  click Backup now\nActivity 5.5\nDiscuss the following activities in a group.\n1. Explain data backup mechanisms.\n2. Explain the advantages of data backup.3. Summarize online backup on the cloud.4.Discuss advantages of online backup over other physical or external \nstorages.\n5.Explain the mechanisms of backup used in MS Windows and any saved data on your school computer.\nKEY CONCEPTS\nCloud backup  is the service in which data and applications on a business’s \nservers are backed up and stored on a remote server.\nSpyware is any software that installs itself on your computer and starts covertly monitoring your online behavior without your knowledge or permission. Spyware is a kind of malware that secretly gathers information about a person or an organization and relays this data to other parties.\nMalware (short for malicious software) is a file or code, typically delivered over a network, that infects, explores, steals or conducts any behavior an attacker wants virtually. \nFirewall \nA firewall is a network security device that monitors incoming and outgoing network traffic and decides whether to allow or block specific traffic based on a defined set of security rules.\nA firewall program does not protect you from all viruses, so it is necessary \nto install an antivirus or antimalware application. Windows defender can help"
        },
        {
            "page_number": 198,
            "text": "Grade 10 Information Technology Student’s Textbook \n  191you protect against viruses that the firewall does not protect from. Practice the \nfollowing on your school or home computer.\n1. Turn the Microsoft defender firewall on or off.\n2.It is important to have Microsoft Defender Firewall on, even if you already \nhave another firewall on. It helps you protect yourself from unauthorized access.\n3.Select the Start Windows logo Start \n button Settings\n  Gear-shaped \nSettings icon Update & Security \n Circular arrows Sync icon Windows \nSecurity and then Firewall & network protection .Open Windows Security \nsettings.\n4. Select a network profile.\n5. Under Microsoft Defender Firewall, switch the setting to on. If your device \nis connected to network, network policy settings might prevent you from \ncompleting these steps. For more info, contact the computer’s administrator.\n6.To turn it off, switch the setting to off.Turning off Windows Defender Firewall \ncould make your device (and network, if you have one) more vulnerable to unauthorized access. If there is an application you need to use that is being blocked, you can allow it through the firewall, instead of turning the firewall off.\nNote: If you get errors or if the setting will not turn on, you can use the trouble-\nshooter and then try again.\nActivity 5.6\nBriefly discuss the following activities in a group.\n1. Discuss advantages of installing an antivirus program. \n2. Explain ways of protecting your computer from malware.3. Summarize the steps required to install firewalls on your computer.4. Discuss the term encryption of data. 5. Explain the mechanism to encrypt data.6. Mention stages to install antivirus software.7. Explain the types of accounts that can be organized on your computer."
        },
        {
            "page_number": 199,
            "text": "192Unit 5 : Information and Computer Security\nAntivirus Software\nAntivirus software is a type of program designed and developed to protect \ncomputers from malware like viruses, computer worms and spyware . Antivirus \nprograms function to scan, detect and remove viruses from your computer.\nFigure 5.5 Examples of antivirus software\nCreating and changing user account \nA user account is a collection of settings and permissions specific to a user that determines what a user can and cannot do on the computer. These settings are also used to protect the user’s files and folders from access by another non-authorized person. In particular, a user account will determine the files and folders a user can access and the changes a user can make to the computer.\nTypes of User Account\nThree types of user accounts that are available in Windows are described in Table 5.2 below.\nTable 5.2 Types of user account\nUser Accounts                                                        Description\nAdministrator Administrators have access to everything on the computer, and can make changes to anything, such as installing software and changing security settings. When you first install Windows 10, the initial user account will be an administrator account. The administrator account can also create new users and manage user accounts."
        },
        {
            "page_number": 200,
            "text": "Grade 10 Information Technology Student’s Textbook \n  193Standard Standard users will have limited ability to make changes to \nthe computer, except for personalizing the computer, such as applying a screen saver or changing a theme. Standard users will not have access to other users’ personal files and folders. Most computer users will be allocated a standard account.\nGuest Guest accounts exist for temporary users of a computer and only one guest account can exist on a computer. Guest accounts are similar to standard accounts, except there is no privacy, as anybody can log onto a guest account. The guest account provides access to installed programs but does not have permission to access data in other users’ personal folders. Guest accounts are often used in internet cafes.\nChecking User Account on Windows\nModification of user and administrator accounts can be done in Control Panel. Icons and language may differ slightly depending on the build version of Windows you are using.\nStep 1 : Click on the Windows icon and type Control Panel and click on the Control Panel application.\nStep 2 : Click User Accounts.\nFigure 5.6 User accounts"
        },
        {
            "page_number": 201,
            "text": "194Unit 5 : Information and Computer Security\nNote that you will need to be on or have access to an administrator account \nto make any of these changes. If you do not have access to this account or it is managed by a service provider, please contact the relevant local administrator or your service provider.\nStep 3 : Select Add or Remove User Accounts options\nFigure 5.7 Add or remove account type\nStep 4 : Check the existing accounts on your PC. You should only have one administrator account and your daily use account should not be the administrator account. All next steps start from here.\nFigure 5.8  Administrator account"
        },
        {
            "page_number": 202,
            "text": "Grade 10 Information Technology Student’s Textbook \n  195Create a New Account\nTo create a new account on your PC, follow the following steps.\nClick on Add a new user in PC setting, as shown in Figure 5.9.\nFigure 5.9 Add new user\nScroll down and click on Add someone else to this PC.\nFigure 5.10 Add someone else to this pc\nEnter the username, passphrase and security questions and answers.\nClick next; by default, this new user will not have administrator access. \nYou can also create a new user account using a Microsoft account; however, you must be connected to the Internet."
        },
        {
            "page_number": 203,
            "text": "196Unit 5 : Information and Computer Security\nFigure 5.11 Create an account\nClick on the Next button. This will create a new account.\nFigure 5.12 Created account\n5.6.2 Non-technical Prevention Strategies \nIt is impossible to prevent natural disasters, but it is possible to reduce the damage \nthey inflict through careful planning. Some measures can be taken to reduce their impact. The measures that you can take to protect your data and computer from natural threats could be keeping your computer in a secure location, storing data safely and protecting programs and data."
        },
        {
            "page_number": 204,
            "text": "Grade 10 Information Technology Student’s Textbook \n  197Activity 5.7\nAnswer the following activities in a group.\n1.Explain non-technical prevention strategies used for your computer and \ndata.\n2. Explain the mechanisms used to protect programs and data.\n3. Visit computers in your school and summarize antiviruses used in them. 4. Analyze how copied data or programs can be protected on computers.\nKEY CONCEPTS\nData backup involves creating multiple copies of your data. Making a backup \nhelps you recover your data using external hard drive, CD, Flash memory or \nonline data backup site such as cloud in case of any data loss.\nA firewall system prevents unauthorized access to a private network from network traffic by forming a barrier between trusted and untrusted websites to protect from threats like hackers and worms. \nAntivirus software is a type of program designed and developed to protect \ncomputers from malware like viruses, computer worms, spyware, botnets, rootkits and key loggers.\nA user account  is a collection of settings and permissions, specific to a user \nthat determines what a user can and cannot do on the computer.\n5.7 Cyber Security\n Brainstorming \n1. What does it mean by cyber security?\n2. Have you ever experienced cyber-attacks?\nCyber security is the application of technologies, processes and controls to protect \nsystems, networks, programs, devices and data from cyber-attacks. Cyber security aims to reduce the risk of cyber-attacks and protect against the unauthorized exploitation of systems, networks and technologies."
        },
        {
            "page_number": 205,
            "text": "198Unit 5 : Information and Computer Security\nFigure 5.14 Cyber-attack\nCyber-attacks can cause electrical shutdowns, failure of military equipment and \nbreaches of national security secrets. They can result in theft of valuable, sensitive data like medical records. They can disrupt phone and computer networks or paralyze systems, making data unavailable. Figure 5.14 shows an example of a cyber-attack.\nCyber security applies in a variety of contexts, from business to mobile \ncomputing, and can be divided into a few common categories. Such as network security applications, information security, operational security, disaster recovery and end-user education. Common ways of cyber-attack prevention can be outlined as the follows.\n1. Use strong passwords\n2. Secure your computer3. Be social-media savvy4. Secure your mobile devices5. Install the latest operating system updates6. Protect your data7. Secure your wireless network"
        },
        {
            "page_number": 206,
            "text": "Grade 10 Information Technology Student’s Textbook \n  1998. Protect your e-identity\n9. Avoid being scammed\nOn top of all these outlined, call the right person for help.  If you encounter \nillegal Internet content or suspect a computer crime, identity theft or a commercial \nscam, report to your local police. If you need help with maintenance or software installation on your computer, consult your service provider or certified computer technician.\n5.8 Unit Summary\nComputer Security is control put in place to provide confidentiality, integrity \nand availability for all components of computer systems. These components include data, software, hardware and firmware. Information security is \napplied to computing devices such as computers and smartphones as well \nas computer networks, such as private and public networks, including the whole Internet.\nPrivacy is concerned with safeguarding and respecting people’s rights \nto manage their data in a broader sense. Data privacy or information privacy is concerned with proper handling, processing, storage and usage of personal information. It is all about the rights of individuals concerning their personal information.\nLack of confidentiality is an unauthorized disclosure of data or unauthorized \naccess to a computer system or a program. A failure of integrity results from Activity 5.8\nBriefly discuss the following activities\n1. Explain the reason for cyber-attack.\n2. Analyze the impact of cyber-attack on society. 3. Compare and contrast cyber-attack and cyber-crime.4.Analyze cyber security threats across the globe in general and in Ethiopia \nin particular.\n5. Discus common categories of cyber security. \n6. Explain each of the cyber security prevention mechanisms."
        },
        {
            "page_number": 207,
            "text": "200Unit 5 : Information and Computer Security\nunauthorized modification of data or damage to a computer system or program. Lack \nofavailability of computing resources results in what is called denial of service. \nAn act or event that has potential to cause failure of a computer security is called a threat.\nA user account is a collection of settings and permissions specific to a user \nthat determines what a user can and cannot do on the computer. These settings protect the user’s files, programs and folders from being accessed by other non-authorized people.\nAntivirus software is computer software used to prevent, detect and remove \nmalware including computer viruses, worms and Trojan horses. Some examples of anti-virus software are Avast, McAfee, Norton and Kaspersky.\nCyber security is the practice of defending computers, servers, mobile devices, \nelectronic systems, networks and data from malicious attacks. It is also known as information technology security or electronic information security. The term applies in a variety of contexts, from business to mobile computing, and can be divided into a few common categories.\nCybercrime is any criminal activity that involves a computer, networked \ndevice or a network. While most cybercrimes are carried out to generate profit for the cybercriminals, some cybercrimes are carried out against computers or devices directly to damage or disable them.\n5.9 Unit Review Exercise\nPart I: Write whther the following statements are true or false.\n1.The term information security is used to describe the protection of computer and non-computer equipment, facilities, data and information from misuse by unauthorized parties. \n2.Information security threats can be internal as well as external and they can be accidental as well as intentional. \n3.The objective of confidentiality of information is to make data or information available to those who are authorized to use it.  \n4.An information security risk is a potential undesirable outcome of a breach of information security by an information security threat. \n5.Firewalls do not act as filters and barriers that restrict the flow of data to and"
        },
        {
            "page_number": 208,
            "text": "Grade 10 Information Technology Student’s Textbook \n  201from the firm and the World Wide Web. \n6.Cyber security is the application of technologies, processes and controls to \nprotect systems, networks, programs, devices and data from cyber-attacks.\n7.Cybercrime, also called non-computer crime,  is the use of a computer as an instrument to further illegal ends.\nPart II: Choose the correct answer among the alternatives provided.\n1.Firewalls are used to protect __________________ attacks.\nA. virus\nB. fireC. data-drivenD. unauthorized\n2.When changes are made to the firm’s information and software data, the type \nof information security risk it encounters is ______________.\nA. unauthorized disclosure and theft.\nB. unauthorized use C. unauthorized modification D. unauthorized restriction \n3.Antivirus software needs to be continuously updated because \n_________________.\nA. the list of potential threats grows and changes daily.\nB.the antivirus companies need to look at your computer to see what you \nare doing.\nC. the speed of your Internet connection needs to be regularly tested.\nD. the antivirus companies make money from you on each update."
        },
        {
            "page_number": 209,
            "text": "202Unit 5 : Information and Computer Security\n4.You should keep your machine updated with the latest operating system \npatches because:\nA.Hackers might write a virus to take advantage of a known weakness or bug.\nB. Your machine will not run without the latest software.\nC.If you do not have the latest software, your system may force you to \nreboot.\nD. Downloading the latest software will make your machine faster.\n5.A computer detects a virus by ______________.\nA. reporting \nB. duplicating C. scanning D. following \n6._______  is a type of software designed to help the user’s computer detect \nviruses and avoid them.\nA. Malware\nB. AdwareC. AntivirusD. Both B and C\n7.Data cannot be changed without proper authorization; this is an example of \n_______.\nA. confidentiality \nB. integrity C. availability D. None of the above.\n8.Backup and data encryption are components of ________________.\nA. data security \nB. data privacy C. securityD. None of the above."
        },
        {
            "page_number": 210,
            "text": "Grade 10 Information Technology Student’s Textbook \n  2039. Which one of the following is a key function of a firewall?\nA. Copying\nB. MovingC. DeletingD. Monitoring\n10.  Which of the following is not a type of cybercrime?\nA. Data theftB. ForgeryC. Damage to data and systemsD. Installing antivirus for protection\nPart III:  Discuss the following questions.\n1. Define computer security. \n2. Describe the three elements of computer security.3. List threats related to information security.4. Discuss the reasons for taking backup regularly. 5. Express the term firewall.6. Explain cyber-attacks."
        },
        {
            "page_number": 211,
            "text": "204Unit 6 : Fundamentals of Programming\n6.1 Unit Overview\nAs it was defined and discussed in grade 9, problem-solving steps are used to solve \nday-to-day problems and make strategies to handle different situations which keep arising in day-to-day life. One method of solving problems in computer science is using algorithms. In this unit, you are going to learn basics of algorithm, definition of algorithm, characteristics of algorithm, algorithm representation and introduction to Integrated Development Environment (IDE). \n6.2Basics of Algorithm\n Brainstorming \n1. What do you recall by the term algorithm?\n2. How do you verify problem solving concept?\nAlgorithm is a step-by-step process of solving a well-defined computational \nproblem. In practice, to solve any complex real-life problems, first we have to define the problem and then design an algorithm to solve it. Writing and executing a simple program may be easy; however, for executing a bigger one, each part of the program must be well organized. In short, algorithms are used to simplify the program implementation.At the end of this unit, learners will be able to:\nExplain concepts of algorithms.\nDescribe the representation of algorithms.\nDiscuss Integrated Development Environment (IDE).UNIT \nFUNDAMENTALS OF PROGRAMING\nUNIT OUTCOMES6"
        },
        {
            "page_number": 212,
            "text": "Grade 10 Information Technology Student’s Textbook \n  205Computers are dumb machines because they do only what they are asked \nto do. In computers, programs are developed to solve some problems. These \nprograms can be written using some computer programming languages like Basic, C, C++, Java and Python.\nIn this section, you will develop your understanding of problem-solving and \nits approaches. To solve the problem using computers, we must follow the steps described below.\na. The problem must be analyzed thoroughly.\nb. Solution method is broken down into a sequence of small tasks.c. Based on this analysis, an algorithm must be prepared to solve the \nproblem.\nd. The algorithm must be expressed in precise notation.\ne.In viewing algorithm, a computer program has to be designed in any \nhigh-level language.\nf. The computer program is fed into the computer.\ng.The instruction in the program executes one after another and outputs \nthe expected result.\nFor example, calculate the sum of two numbers, A and B, and store the sum in \nC; here A and B are the inputs, addition is the process and C is the output of the program, as shown in Figure 6.1.\nFigure 6.1 Sum of two numbers\nActivity 6.1\nAnswer the following activities accordingly.\n1.Write the steps you may follow to do an everyday activity. It could be riding a bike, making a sandwich or cooking “shiro wot”.\nii.Discuss the steps you have written with your friend.\niii. Can you provide the name for the steps you have written above?"
        },
        {
            "page_number": 213,
            "text": "206Unit 6 : Fundamentals of Programming\n2. Explain the relationship between problem solving and algorithms.\n3. Describe the steps for solving a problem in computers.\n6.3Definition of Algorithm\n Brainstorming \n1. Explain the term algorithm?2. Can you state the benefits of using algorithms?\nAn algorithm is a precise method of solving a problem. It consists of a sequence \nof unambiguous, step-by-step instructions. A program is an algorithm that has been converted into program code so that it can be executed by a computer. A \nwell-written algorithm should be free from logic errors and easy to code in any high-level language. Some of the most widely used definitions of an algorithm are described hereunder. \nAn algorithm is a set of rules for carrying out calculations either by hand or a machine.\nAn algorithm is a finite step-by-step procedure to achieve a required result.\nAn algorithm is a sequence of computational steps that transform the input into the output.\nLet us conceptualize the concept of an algorithm by taking the example of \ncooking “doro wot” for the first time as a new recipe. To cook a new recipe, \none reads the instructions and steps, and executes them one by one in the given sequence. The result, thus, obtained is that the new dish cooked perfectly. Similarly, algorithms help to do a task in programming to get the expected output. The algorithms designed are language-independent; that is, they are just plain instructions that can be implemented in any programming language and yet the output will be the same. The components of an algorithm are described in Figure 6.2 below."
        },
        {
            "page_number": 214,
            "text": "Grade 10 Information Technology Student’s Textbook \n  207Figure 6.2 Description of the algorithm\nBefore a computer can be put to any meaningful use, the user must be able to \ndefine a unit sequence of operations or activities which are logically ordered as \nan unambiguous method of solving a problem or finding a solution to it, which is termed as an algorithm. \nThe term algorithm means “a process or set of rules to be followed in \ncalculations or other problem-solving operations”. Therefore, algorithm refers to a set of rules/instructions that define step-by-step how a work is to be executed to get the expected results.\n6.4Characteristics of Algorithm\nFigure 6.3 Characteristics of algorithm"
        },
        {
            "page_number": 215,
            "text": "208Unit 6 : Fundamentals of Programming\nOne would not follow any written instructions to cook a recipe, but only the \nstandard one. Similarly, every written instruction for programming is not an algorithm. For some instructions to be an algorithm, they must have the following characteristics. It should be:\nClear and unambiguous : The algorithm should be unambiguous. Each \nof its steps should be clear in all aspects and must lead to only one meaning.\nWell-defined inputs : If an algorithm says to take inputs, they should be \nwell-defined.\nWell-defined outputs: The algorithm must clearly define what output \nwill be yielded and it should be well-defined as well.\nFiniteness: The algorithm must be finite, i.e. it should not end up in \ninfinite loops or similar.\nFeasible: The algorithm must be simple, generic and practical so that it \ncan be executed upon the available resources. It must not contain some future technology or anything.\nLanguage independent: The algorithm designed must be language-\nindependent, i.e. it must be just plain instructions that can be implemented in any language, and yet the output will be the same as expected.\nAdvantages of algorithm\nIt is easy to understand.\nAlgorithm is a stepwise representation of a solution to a given problem.Activity 6.2\nDo the following activities in a group.\n1.Establish a group of three and choose problems that can be solved stepwise.\n2. Relate the steps you have identified to the components of an algorithm.\n3. Discuss the characteristics of an algorithm."
        },
        {
            "page_number": 216,
            "text": "Grade 10 Information Technology Student’s Textbook \n  209In the algorithm the problem is broken down into smaller pieces or \nsteps; hence, it is easier for the programmer to convert it into an actual program.\nDisadvantages of algorithm\nWriting an algorithm takes a long time, so it is time-consuming.\nBranching and looping statements are difficult to show in algorithms.\nExamples of algorithm \nLet us consider a few examples of creating an algorithm for a given problem.Example 1: Algorithm for the sum of two numbers\nStep 1: Take the first number from the user (input).\nStep 2: Take the second number from the user (input).\nStep 3: Add the two numbers to get the sum (process).\nStep 4: Display the sum on the screen (output).\nExample 2: Write an algorithm to check whether the entered number is positive, negative or zero.\nStep 1: Take the number from the user.\nStep 2: If the number is less than 0, then display that the entered number is negative.\nStep 3: If the number is greater than 0, display that the entered number is positive.\nStep 4: Otherwise, display that the entered number is zero.\nExample 3: Calculate the sum of ten natural numbers.\nThe formula for the sum of ten natural numbers is  \n10\n1 = \nisum number i\n=∑   \nStep 1: Let the sum be initially set to 0.\nStep 2: Let i will be initially 1.\nStep 3: Take the ith number from the user."
        },
        {
            "page_number": 217,
            "text": "210Unit 6 : Fundamentals of Programming\nStep 4: Add the ith number to the sum.\nStep 5: Increase the value of i by 1.\nStep 6: Check if the value of i is less than 10; then go to step 4. Otherwise, \ngo to step 7.\nStep 7: Output the sum.\n  \nKEY CONCEPTS\nAn algorithm is a precise method of solving a problem. It consists of a \nsequence of unambiguous, step-by-step instructions.\nAn algorithm is described in terms of input, process and output activities.\nThe characteristics  of an algorithm include well defined input, well defined \noutput, clarity and unambiguity, fineness, language independence and fea-sibility.\nA program is a set of instruction written to carry out a particular task so that \ncomputer can follow them. \nUsing algorithms for solving problems has both advantages and disadvantages. \nSome of the advantages of using algorithm are easy to solve a prob -\nlem, practice step wise representation of problems and convert the al-gorithm into actual program or code the programmer. \nThe disadvantages of using algorithms are time consuming for design -\ning and difficulty to show branching and looping statements\n6.5 Algorithm Representation\n Brainstorming \n1. How do you think algorithms are represented?\n2. Discuss with your classmate what is meant by the flowchart. 3. State the benefits of using algorithms."
        },
        {
            "page_number": 218,
            "text": "Grade 10 Information Technology Student’s Textbook \n  211In computer programming, we wish to be able to create algorithms in a way that \nwill allow for easy translation to programming languages. Natural languages are too imprecise to be used in algorithms that are to be used in computer program -\nming.\nWe need a way to describe our algorithms in a precise manner with a well-\ndefined syntax and clear, unambiguous semantics. There are two main ways in which algorithms can be represented; they are  flowcharts and pseudo code.\n6.5.1 Flowchart Method\nAn algorithm can be described using many techniques and tools. One tool for designing an algorithm is by using a flowchart. A flowchart is a graphical or schematic representation of the major steps of work in a process. It displays the essential steps of the program in separate boxes and shows the directions of information flow using arrows. The boxes are most often referred to as illustrative symbols and may represent documents, machines or actions taken during the process. The area of concentration is on where or who does what, rather than on how it is done. A flowchart can also be said to be a graphical representation of an algorithm; that is, it is a visual picture that gives steps of an algorithm and flow of control between the various steps.\nBasic Flowchart Symbols \nFlowcharts are drawn with the help of symbols. The following are the most com -\nmonly used flowchart symbols and their functions as shown in Figures 6.4 below\n."
        },
        {
            "page_number": 219,
            "text": "212Unit 6 : Fundamentals of Programming\nFigure 6.4 Flowchart symbols\nExample 1: Consider a simple general flowcharting technique as shown in Figure \n6.5 below. Let us start drawing a flowchart for a given problem. \nFigure 6.5 Flowchart techniques\nHere different flowchart symbols are shown and are interconnected by the flow line; start, input, processing, decision, predefined process, output and terminator are interconnected."
        },
        {
            "page_number": 220,
            "text": "Grade 10 Information Technology Student’s Textbook \n  213Example 2: Draw a flow chart of an algorithm to add two numbers and display \ntheir result. Solution: \nAlgorithm description:\na. Read the rules of the two numbers (A and B). \nb. Add A and B.c. Assign the sum of A and B to C.d. Display the result (C).\nA flowchart is a picture of the separate steps of a process in sequential order. It is \na generic tool that can be adapted for a wide variety of purposes and can be used to describe various processes such as manufacturing, administrative or service and project plan.\nFigure 6.6 Flow chart of an algorithm to add two numbers and display their result"
        },
        {
            "page_number": 221,
            "text": "214Unit 6 : Fundamentals of Programming\nExample 3: Draw a flowchart to check if a given number is positive or negative. \nSolution: \n                                              Algorithm description\na. Read a number x.\nb.If x is less than zero, write a message negatively; otherwise write a \nmessage that is not negative.\nFlowchart\nFigure 6.7 Flowchart that checks whether a given number is positive or negative\nSometimes there are conditions in which it is necessary to execute a group of statements repeatedly until some condition is satisfied. This condition is called a loop. Loop is a sequence of instructions that is repeated until some specific condition occurs. A loop normally consists of four parts. These are: \nInitialization: Setting of variables of the computation to their initial values and setting the counter for determining to exit from the loop. \nComputation: Processing"
        },
        {
            "page_number": 222,
            "text": "Grade 10 Information Technology Student’s Textbook \n  215Test:  Every loop must have some way of exiting from it or else the \nprogram would endlessly remain in a loop. \nIncrement:  Re-initialization of the loop for the next loop. \nExample 3: Write the algorithmic description and draw a flowchart to find the \nsum of the first 50 natural numbers as stated:     Sum = 1+2+3+…. + 50 Solution: \nAlgorithmic description                                                           \n1. Initialize sum to zero (0) and counter to 1.\n1.1 If the counter is less than or equal to 50,\nAdd counter to sum. \nIncrease counter by 1. \nRepeat the above steps.\n1.2 Else Exit\n2. Write the sum \nFlowchart\nFigure 6.8 Flowchart showing the sum of the first 50 natural numbers"
        },
        {
            "page_number": 223,
            "text": "216Unit 6 : Fundamentals of Programming\nIn this example, we can draw a simple flowchart for the sum of the first 50 natural \nnumbers. Therefore, we need flowchart symbols for input, output, process, decision, start and end. The first and the last symbols are starting and end of the flowcharting respectively. An initial sum of numbers is assumed to be zero which is inputted in the input symbol. \nThe sum is added to the number, which is initialized as zero. The decision \nblock used in the flowchart takes the decision when the number is equal to 50 if not then the natural number is incremented by one and added to the sum. This process continues until the number counter goes up to 50. If the number is 50, then the final sum will be calculated and displayed using the output symbol.\n6.5.2 Pseudocode\nPseudocode is a program design aid that serves the function of a flowchart in expressing the detailed logic of a program. Sometimes a program’s flowchart might be inadequate for expressing the control flow and logic of the program. \nUsing pseudocode, the program’s algorithm can be expressed as English-\nlanguage statements. These statements can be used both as a guide when coding the program in a specific language and as documentation for review by others. Because there is no rigid rule for constructing pseudocodes, the logic of the program can be expressed in a manner without confronting any particular programming language. A series of structured words are used to express major program functions. Let us see examples of pseudocode.Activity 6.3\nAnswer the following activities in a group in a class.\n1. Discuss the use of a flowchart.\n2. List symbols used in the flowchart diagram with their description.3. Describe the flow chart symbol used to indicate the decision."
        },
        {
            "page_number": 224,
            "text": "Grade 10 Information Technology Student’s Textbook \n  217Example 1: Write the pseudocode to find the sum of two numbers.\nFigure 6.9 Pseudocode for finding the sum of two numbers\nActivity 6.4\nAnswer the following activities individually.\n1. Explain the benefits of using pseudocode in problem-solving.\n2. Describe the pseudocode for area and perimeter of a circle.3. Demonstrate how the pseudocode method relates to flowchart design.\nKEY CONCEPTS\nAn algorithm can be described using many techniques and tools. The two \nmain tools of designing algorithm are using flowchart and pseudocode .\nA flowchart is a graphical or a schematic representation of the major steps \nof work in a process. A flowchart symbols include start, input, process, \ndecision, terminators and flow line. \nPseudocode is a program design aid that serves the function of a flowchart in expressing the detailed logic of a program."
        },
        {
            "page_number": 225,
            "text": "218Unit 6 : Fundamentals of Programming\n6.6 Integrated Development Environment(IDE)\n Brainstorming \n1. Can you explain what an IDE is?\n2. Describe the benefits of using an IDE.\nSoftware is a large component of our lives these days. If you do not agree, just \nlook around. Software is in the computers that sit on our desks in schools. It is in our televisions and stereos. It is even in the mobile devices we carry around like phones and tablets. These items have computers in them and computers need software to run. In a technology-based world such as ours, it is inescapable. Therefore, it should not come as a surprise that we need some means to create this software. An introduction to Integrated Development Environment (IDE) is a means to do this that puts everything we need at our fingertips.\nAn IDE enables programmers to consolidate different aspects of writing \na computer program. IDEs increase programmer productivity by combining common activities of writing software into a single application: editing source code, building executable, and debugging. In the next section, you learn the formal definition of an IDE.\nFigure 6.10  IDE for Java and Python programming"
        },
        {
            "page_number": 226,
            "text": "Grade 10 Information Technology Student’s Textbook \n  2196.6.1 Definition of an IDE\nAn integrated development environment (IDE) is an application that facilitates \napplication development. IDEs are designed to encompass all programming tasks in one application. Therefore, IDEs offer a central interface featuring all the tools a software developer needs, including the following functionalities as shown in Figure 6.11.\nFigure 6.11 Functionalities of an IDE\nCommon Features of Integrated Development Environments\nAn IDE typically contains a code editor, a compiler or interpreter, and a debugger accessed through a single graphical user interface (GUI). The user writes and edits source code in the code editor. The compiler translates the source code into a readable language that is executable for a computer. The debugger tests the software to solve any issues or bugs. The fundamental features of IDE are discussed in the following.\nCode editor : This feature is a text editor designed for writing and \nediting source code. Source code editors are distinguished from text ed -\nitors because they enhance or simplify the writing and editing of code.\nFigure 6.12 Code editor"
        },
        {
            "page_number": 227,
            "text": "220Unit 6 : Fundamentals of Programming\nText editors : Virtually every IDE will have a text editor designed to \nwrite and manipulate source code.\nFigure 6.13 Text editors for IDE\nDebugger : This tool is used during testing to help debug application \nprograms.\nBuild automation tools : These tools automate common developer tasks. \nIn addition, some IDEs might also include the following:\nyClass browser: This tool is used to examine and reference the \nproperties of an object-oriented class hierarchy.\nyObject browser: This feature is used to examine the objects \ninstantiated in a running application program.\nClass hierarchy diagram: This tool allows the programmer to visualize \nthe structure of object-oriented programming code.\nNote that IDE may be a stand-alone application or may be included as part of one or more compatible applications.\nActivity 6.5\nDiscuss the following activities in a group.\n1. Describe the need for an IDE.\n2. Explain three names of code and text editors you have learned.3. Compare and contrast code and text editors."
        },
        {
            "page_number": 228,
            "text": "Grade 10 Information Technology Student’s Textbook \n  2216.6.2 Benefits of Using IDEs\nThe overall goal and main benefit of an integrated development environment \nare improved developer productivity. IDEs boost productivity by reducing setup time, increasing the speed of development tasks, keeping developers up to date and standardizing the development process.\nFaster setup : Without an IDE interface, developers would need to spend \ntime configuring multiple development tools. With the application integration of an IDE, developers have the same set of capabilities in one place, without the need for constantly switching tools.\nFaster development tasks: Tighter integration of all development tasks improves developer productivity. For Example, code can be parsed and syntax checked while being edited, providing instant feedback when syntax errors are introduced. Developers do not need to switch between applications to complete tasks. In addition, the IDE’s tools and features help developers organize resources, prevent mistakes and take shortcuts.\nFurther, IDEs streamline development by encouraging holistic thinking. They enforce developers to think of their actions in terms of the entire development lifecycle, rather than as a series of discrete tasks.\nContinual learning:   Staying up to date and educated is another benefit. \nFor instance, the IDEs topics are constantly being updated as well as new samples, project templates, etc. Programmers who are continually learning and with current best practices are more likely to contribute value to the team and the enterprise, and boost productivity.\nStandardization: The IDE interface standardizes the development process which helps developers work together more smoothly and helps new hires get up to speed more quickly.\n6.6.3 Different Types of IDE\nThere are a variety of different IDEs, catering to many different ways developers work and different types of code they produce. Some IDEs are designed to work with one specific language, cloud-based IDEs, IDEs customized for the development of mobile applications or HTML and IDEs meant specifically for Apple development or Microsoft development."
        },
        {
            "page_number": 229,
            "text": "222Unit 6 : Fundamentals of Programming\nMulti-language IDE\nMulti-language IDEs such as Eclipse, NetBeans and Komodo support multiple \nprogramming languages.\nFigure 6.14 IDE software\nEclipse: Supports C++, Python, PHP, Java and more. This free and open-\nsource editor is model for many development frameworks. The eclipse began as a Java development environment and has expanded through plugins. Eclipse is managed and directed by the Eclipse.org Consortium.\nNetBeans: Supports Java, JavaScript, PHP, Python, Ruby, C, C++ and \nmore. This option is also free and open source. All the functions of the IDE are provided by modules that each provide a well-defined function. Support for other programming languages can be added by installing additional modules.\n IDE for a specific application \nIDE for mobile development: There are IDEs specifically used for mobile development, for instance, Android Studio and Visual Studio.  \nHTML IDE: Some of the most popular IDEs are those for developing HTML applications. For Example, IDEs such as HomeSite, DreamWeaver or FrontPage automate many tasks involved in website development.\nCloud-based IDE: Cloud IDEs give developers access to their code \nfrom anywhere. For Example, Nitrous is a cloud-based development environment platform that supports more than 40 languages including PHP, Ruby, Python, JavaScript with Node.js and Go."
        },
        {
            "page_number": 230,
            "text": "Grade 10 Information Technology Student’s Textbook \n  223KEY CONCEPTS\nAn Integrated Development Environment (IDE) is an application that \nfacilitates application development. IDEs are designed to encompass all \nprogramming tasks in one application.\nAn IDE typically contains a code editor, a compiler or interpreter and a debugger which is accessed through a single graphical user interface (GUI) .\nCode editor: This feature is a text editor designed for writing and editing source code. \nText editors: Text editor in IDEs are designed to write and manipulate source code.\nSource code editors are distinguished from text editors because they enhance \nor simplify the writing and editing of code.\nCompiler: This is a tool that transforms source code written in a human readable or writable language into a form executable by a computer.\nThe benefits of using IDEs are faster setup, fast development tasks, continuous learning and standardization of the development process.\nMultiple IDEs such as Eclipse, NetBeans and Komodo support multiple programming languages whereas IDEs for specific applications are IDEs for mobile development, for instance Android Studio, Visual Studio, HTML IDEs such as HomeSite, DreamWeaver or FrontPage, and Cloud-based IDE such as PHP, Ruby, Python, JavaScript with Node.js and Go.\n6.7 Unit Summary\nFlowcharts, decision tables, pseudocodes and algorithms are essential ingredients to the writing of good programs. If they are done properly, they lead to a reduction of errors in programs. They help minimize the time spent in debugging. In \naddition, they make logic errors easier to trace and discover.\nA flowchart is a graphical representation of the major steps of work in the \nprocess. It displays the essential steps of the program in separate boxes and \nshows the directions of information flow using arrows. Pseudocode is a program design aid that serves the function of a flowchart in expressing the detailed logic of a program."
        },
        {
            "page_number": 231,
            "text": "224Unit 6 : Fundamentals of Programming\nAn algorithm is a precise method of solving a problem. It consists of a sequence \nof unambiguous, step-by-step instructions. A program is an algorithm that has \nbeen converted into program code so that it can be executed by a computer. A well-written algorithm should be free from logic errors and easy to code in any high-level language. \nAn IDE, or integrated development environment, enables programmers to \nconsolidate the different aspects of writing a computer program. It increases programmer productivity by combining common activities of writing software into a single application: editing source code, building executables and debugging. The overall goal and main benefit of an integrated development environment are improved developer productivity. IDEs boost productivity by reducing setup time, increasing the speed of development tasks, keeping developers up to date and standardizing the development process.\nEclipse supports C++, Python, PHP, Java and more. This free and open-\nsource editor is model for many development frameworks. The eclipse began as a Java development environment and has expanded through plugins. NetBeans \nsupports Java, JavaScript, PHP, Python, Ruby, C, C++, and more. This option is also free and open source. All the functions of the IDE are provided by modules that each provide a well-defined function. \n6.8 Unit Review Exercise\nPart I: Write whether the following statements are true or false.\n1. A sequence of instructions given to a computer is known as a program.\n2. Branching and looping structures are well described using an algorithm.3. An algorithm is a precise method of solving a problem.4. Flowchart method is a verbal description of an algorithm.5. NetBeans is a text editor.  \nPart II: Choose the correct answer among the alternatives provided.\n1. Which one is not a characteristic of an algorithm?\nA. Ambiguity \nB. SimplicityC. Correctness"
        },
        {
            "page_number": 232,
            "text": "Grade 10 Information Technology Student’s Textbook \n  225D.  Precision\n2.In the flowchart diagram, which one of the following symbols is used to \nindicate a decision step?\n3. Which one of the following is incorrect about an algorithm?\nA. It has well-defined steps.\nB. It has to be unambiguous.C. It should terminate after a few computational steps.D. It is dependent on a particular programming language.\n4.A step-by-step method for solving a problem using the English Language is \n_______.\nA. program \nB. flowchartC. statement D. algorithm\n5.A set of statements executed based upon conditional test is called _____________.\nA. looping B. selectiveC. sequence D.  None of the above.\n6.A set of statements is executed again and again based upon a conditional test.\nA. LoopingB. SelectiveC. Sequence D. Conditional"
        },
        {
            "page_number": 233,
            "text": "226Unit 6 : Fundamentals of Programming\n7.The graphical representation of algorithm is _________________.\nA. program \nB. flowchartC. statementD. algorithm\n8. All instructions are executed one after the other.\nA. Looping                  B. Selective C. Sequence D. None of the above\n9.The correct order of executing algorithms is ____________.\nA. input \n process  output \nB. input output  process\nC. output  process input\nD. process input output\n10.The part of a loop structure that describes processing is called ________.\nA. initializationB. computationC. testing D. increment \n11.An abbreviation IDE stands for ___________.\nA. individually determined environmentB. indented development entity C. integrated development environment D. integrated dynamic entity \nPart III: Discuss the following questions.\n1. Define the term algorithm.\n2. Discuss a flowchart.3. Explain pseudocode."
        },
        {
            "page_number": 234,
            "text": "Grade 10 Information Technology Student’s Textbook \n  2274. Summarize the symbols of the flowchart.\n5.Write an algorithm description and draw a flow chart for the sum of the first \nten natural numbers.\n6. Write an algorithm to find the greatest three numbers of given numbers. \n7. Write an algorithm to check whether the given integer value is prime or not. 8.Draw a flowchart to find the roots of the quadratic equation ax²+ bx + c = 0.\n9.Write an algorithm to read values for three variables u, v and w and find the \nvalue for the result from the formula: result= (u+v2)/ w. Draw also the flow-chart."
        }
    ]
}