{
    "textbook_id": "information_technology11",
    "chunks": [
        {
            "page_number": 1,
            "text": "STUDENT  TEXTBOOK\nGRADE 11"
        },
        {
            "page_number": 2,
            "text": "Take Good Care of\nThis Textbook \nThis textbook is the property of your school. \nTake good care not to damage or lose it. \n    Here are 10 ideas to help take care of the book:\n1.Cover the book with protective material, such as plastic, old \nnewspapers or magazines.\n2. Always keep the book in a clean dry place.3. Be sure your hands are clean when you use the book.4. Do not write on the cover or inside pages.5. Use a piece of paper or cardboard as a bookmark.6. Never tear or cut out any pictures or pages.7. Repair any torn pages with paste or tape.8. Pack the book carefully when you place it in your school bag.9. Handle the book with care when passing it to another person.10.When using a new book for the first time, lay it on its back. Open only a few pages at a time. Press lightly along the bound edge as you turn the pages. This will keep the cover in good condition"
        },
        {
            "page_number": 3,
            "text": "INFORMATION TECHNOLOGY\nSTUDENT TEXTBOOK\nGRADE 11\nWriters:\nTemtim Assefa Desta (PhD)\nMiftah Hassen Jemal (MSc)\nEditors:\nGezahagn Gebeyehu Gamu (MA) (Curriculum Editor)Berhane Woldegabriel Zeweldi (MSc) (Content Editor)\nTemesgen Debelo Ayana (MA)  (Language Editor)\nIllustrator:\nSelamneh Belete Tekle (MSc)\nDesigner: \nDagnachew Melesew Alemayehu (MSc)\nFEDERAL DEMOCRATIC REPUBLIC OF ETHIOPIA\nMINISTRY OF EDUCATIONHAWASSA UNIVERSITY"
        },
        {
            "page_number": 4,
            "text": "First Published August 2023 by the Federal Democratic Republic of Ethiopia, \nMinistry of Education, under the General Education Quality Improvement Program for Equity (GEQIP-E) supported by the World Bank, UK’s Department for International Development/DFID-now merged with the Foreign, Common wealth and Development Office/FCDO, Finland Ministry for Foreign Affairs, the Royal Norwegian Embassy, United Nations Children’s Fund/UNICEF), the Global Partnership for Education (GPE), and Danish Ministry of Foreign Affairs, through a Multi Donor Trust Fund.   \n© 2023 by the Federal Democratic Republic of Ethiopia, Ministry of Education. \nAll rights reserved. The moral rights of the author have been asserted. No part of this textbook reproduced, copied in a retrieval system or transmitted in any form or by any means including electronic, mechanical, magnetic, photocopying, recording or otherwise, without the prior written permission of the Ministry of Education or licensing in accordance with the Federal Democratic Republic of Ethiopia as expressed in the Federal Negarit Gazeta, Proclamation No. 410/2004 - Copyright and Neighboring Rights Protection.\nThe Ministry of Education wishes to thank the individuals, groups and other \nbodies involved – directly or indirectly – in publishing this Textbook. Special thanks are due to Hawassa University for their huge contribution in the development of this textbook in collaboration with Addis Ababa University, Bahir Dar University and Jimma University.\nCopyrighted materials used by permission of their owners. If you are the owner \nof copyrighted material not cited or improperly cited, please contact the Ministry of Education, Head Office, Arat Kilo, (P.O.Box 1367), Addis Ababa Ethiopia.\nPrinted by:\nGRAVITY GROUP IND LLC\n13th Industrial Area,\nSharjah, UNITED ARAB EMIRATES\nUnder Ministry of Education Contract no. MOE/GEQIP-E/LICB/G-01/23\nISBN:  978-99990-0-042-0"
        },
        {
            "page_number": 5,
            "text": "Table of Contents\nUNIT- 1\nInformation Systems and  Its Applications ................................. 1\n1.1. Data, Information, Knowledge, and Wisdom ............................................1\n1.2. Introduction to Information Systems .........................................................61.3. Applications of Information Systems.......................................................... 11\n1.4. IT for Entrepreneurship ..............................................................................22\nUNIT-2\nEmerging Technologies ................................................................. 28\n2.1. Artificial Intelligence ..................................................................................28\n2.2. Augmented Reality and Virtual Reality ......................................................38\n2.3. Data Science................................................................................................44\nUNIT-3\nDatabase Management ........................................................... 51\n3.1. Data Management Approaches ..................................................................513.2. Data Model..................................................................................................553.3. Creating Relational Database in Microsoft Access.....................................63\nUNIT-4\nWeb Development .................................................................... 76\n4.1. World Wide Web .........................................................................................76\n4.2. Website Design ...........................................................................................78\n4.3. HTML Basics .............................................................................................804.4. HTML Links ..............................................................................................874.5. HTML Tables .............................................................................................91\n4.6. HTML Lists ................................................................................................98\nⅠ"
        },
        {
            "page_number": 6,
            "text": "UNIT-5\nHardware Troubleshooting and Preventive Maintenance  ....... 109\n5.1. Hardware Troubleshooting .........................................................................109\n5.2. Basics of Preventive Maintenance..............................................................120\nUNIT-6Fundamentals of Programming  .................................................. 132\n6.1. Types of Programming Languages .............................................................132\n6.2. Basics of Python .........................................................................................1346.3. Variables and Data Types ............................................................................139\n6.4. Statements and Expressions........................................................................1486.5. Writing a Simple Program ..........................................................................151\nⅡ"
        },
        {
            "page_number": 7,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 1Learning Outcomes\nAt the end of this unit, students will be able to:\nDefine data, information, knowledge, and wisdom flow chain\nDifferentiate the concepts of data, information, knowledge, and \nwisdom\nExplain the concept of information systems\nIdentify the main components of an information system\nState the function of each component of an information system\nDescribe the different application areas of information systems\nRecognize the value of information system through its application to solve societal problems  \nExplain IT-based entrepreneurship\nUnit Overview\nThis unit discusses concepts of data, information, knowledge, and wisdom as well as their relationships and differences. It also discusses information system and its components, and the application of information systems in areas such as e-banking, e-government and e-learning. \n1.1. Data, Information, Knowledge, and Wisdom\nBrainstorming 1.1\nReflect on the value of information in our daily life.1UNITINFORMATION SYSTEMS \nAND  ITS APPLICATIONS"
        },
        {
            "page_number": 8,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 2UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\n1.1.1 Data\nData is raw facts that cannot give meaning on its own. It is a representation of what \nwe see and perceive using things like letters and numbers. Facts such as 100, 250, age, and Ethiopia are considered as data. Each of them does not give meaning on its own. For example, 100 can be the weight of a person or the measurement of a distance. Likewise, the word Ethiopia can be a country name or a person’s name. It does not tell us any meaning unless it is related to other data. \nData is recorded and stored using numbers, texts, and images. Some data can be \nrepresented better by numbers than texts. For example, age is better represented by numbers than texts. Likewise, words such as name are only represented by text. With the development of satellite technology, representation of data in the form of image has become very popular. Thus, one form of data representation is better than the other forms of representation, depending on the type of data and context. \nFigure 1.1: Different forms of data\nActivity 1.1\n1.\tList and explain the different forms of data representations.\n2.\tReflect on why you need to collect and store data.\n1.1.2 Information\nInformation is data processed in a meaningful way to the end users. Registering \ndaily sales data may not give meaning. But when we aggregate daily sales data"
        },
        {
            "page_number": 9,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 3UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nby weeks of the month, it becomes information as it shows whether the sales are \nincreasing or decreasing.   By asking relevant questions about ‘who’, ‘what’, ‘when’, ‘where’, etc., we can derive valuable information from the data and make it more useful for users. Therefore, information is a processed data that is used to \nanswer certain questions.  \nLike data, information can be also represented in different forms. It can be \nrepresented in the form of a table, line graph, bar graph or formulas (see Figure 1.2).\nFigure 1.2: Different forms of information representation\nNotes\nQuintal or Qts, shown in Figure 1.2, is weight measurement which is \nequivalent to 100 kilograms\nActivity 1.2\n1.\tExplain the use of information.\n2.\tDiscuss the different ways in which data is converted into information.\n1.1.3 Knowledge\nKnowledge is an understanding which is acquired by further processing and \nintegrating different sets of information. It includes both understanding and skill. For example, when you tell a child how to ride a bicycle, you are giving information. This helps the child to understand how to ride a bicycle. When a child applies the information in riding a bicycle, the child acquires the skills necessary to properly ride a bicycle (see Figure 1.3). Then the information becomes knowledge. Therefore, knowledge is acquired by integrating information from different sources such as reading books, engaging in different activities, discussing with other people, and"
        },
        {
            "page_number": 10,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 4UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nobserving when something happens. Knowledge is the capability to think and act \nto solve a problem or accomplish a given task. For example, the ability to read this textbook or maintain a computer is knowledge. Knowledge is more of a personal possession that you retrieve and apply when you need it. \nFigure 1.3: Example of knowledge acquisition\n1.1.4 Wisdom \nWisdom is the ability to make wise decisions and judgments using one’s knowledge. \nIt is the highest level of human understanding. It is associated with good judgment and actions that contribute to living well (see Figure 1.4).\nFigure 1.4: Wisdom\nWisdom is like love, intelligence, and politeness in that it is a good thing to have. The more we have it, the better we become."
        },
        {
            "page_number": 11,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 5UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\n1.1.5\t The Difference between Data, Information, Knowledge, andWisdom\nData, information, knowledge, and wisdom can be hierarchically arranged where \ndata is placed at the bottom and wisdom is placed at the top of the pyramid.  As you move up in the pyramid, the value you get increases. The more data is enriched with meaning and context, the more knowledge and insights we get from it. The top of the pyramid is where we have turned the knowledge and insights into wisdom which is the highest level of human intelligence (see Figure 1.5). \n Figure 1.5: Data, Information, Knowledge and Wisdom\nThe difference between data, information, knowledge, and wisdom can be further explained as follows:\nData is anything represented as numbers, texts, and images. For example, 010101 \nor +251********* are data.\nInformation may be viewed as data put into context. It is an organized form of \ndata to provide meaning. For example, when we say that +251********* is a \nperson’s phone number, the data becomes information. Information is a set of data that has already been processed, analysed, and structured in a meaningful way to become useful.\nKnowledge refers to understanding patterns, rules, or other mechanisms that serve \nas a guide for our future actions. It emerges from further processing and integration"
        },
        {
            "page_number": 12,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 6UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nof information. It is more complex than information. It is more of a personal \npossession. Knowledge shapes and guides our actions. \nWisdom is the ability to think and act using knowledge. It is the highest level in \nhuman intelligence. Wisdom includes intuitive thinking, logical thinking, creative thinking, and collective thinking. \nActivity 1.3\n•Give examples that illustrate the difference between data, information, knowledge, and wisdom. \n1.2. Introduction to Information Systems\n1.2.1 Information systems\nAn information system (IS) is a set of interrelated components working together \nto collect, process, store, and disseminate information to potential users (see Figure 1.6). An information system generates different types of information or reports that are used by employees in the organization to accomplish different organizational tasks. For example, managers use information to make decisions such as determining the selling price of a product. Information systems have now become an integral part of organizations. They are used to capture data and generate summarized reports for decision making. For example, a school information system captures student data about different types of assessments such as quizzes, assignments and final examinations. All these assessment data are summarized to show a student’s overall performance. Each subject’s mark is used to calculate the average mark of students and rank them accordingly. This information is important for schools to effectively organize their regular activities."
        },
        {
            "page_number": 13,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 7UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nFigure 1.6: Model of Information System\nActivity 1.4\n1. Discuss the data captured by your school’s information system.\n2.Discuss the information that is generated by your school’s information \nsystem and for what purpose it is used. \n1.2.2 Components of IS\nInformation systems can be viewed as having five major components: hardware, \nsoftware, data/information, people, and procedure. The functions of each component are explained below.\n•\tHardware\nHardware includes digital devices that are required to perform core information \nsystem functions such as data storage, data processing, and communication (see Figure 1.7)."
        },
        {
            "page_number": 14,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 8UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nFigure 1.7: Hardware components of Information Systems\nCommunication among disparate parts of an information systems is facilitated \nthrough telecommunication networks that include wired and wireless networks. \n•\tSoftware\nSoftware is a set of instructions that commands the computer hardware to do \nsomething. It includes the operating system, the Database Management System (DBMS), application software, anti-virus software, and others that are required to be in place for the information system to operate properly. \n•\tData and Information\nOrganizations generate different types of data when they interact with their customers and suppliers. For example, data is generated when a digital device selling company sells its products such as computers and printers. The company must keep track of its daily sales data. Without such data, the company cannot properly execute its tasks and monitor its performance.\nThe various types of data that organizations collect on a regular basis must be \nstored in a computer database for later use.  The data is used to prepare reports such as monthly sales reports that are used by managers for decision making. Therefore, data or information is a critical resource or asset that must be properly managed by the information system."
        },
        {
            "page_number": 15,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 9UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nLinks\nSee Section 1.1.1 of this unit for a more detailed explanation of data and \ninformation.\n•\tPeople\nInformation systems require qualified or trained people with knowledge to operate the technologies and identify new data that must be captured and stored by the information system. Therefore, the technical people who have specialized knowledge of the information system are integral parts of the information system of an organization. They are responsible to create and manage an information system that is supportive to the organization’s daily activities. \n•\tProcedure\nProcedure is another component of information systems. A procedure is a series of steps followed to achieve a desired outcome or goal. Procedures are the policies and methods to be followed in using, operating, and maintaining an information system. It is necessary for organizations to have clear procedures that clarify: what data should be captured by the information system; who should have access to the data; who should have the privilege to modify data; and many more. Procedures that are put in place to facilitate an effective use, operation, and maintenance of information systems will help organizations to get more benefits from their information systems.\nActivity 1.5\n• Explain the function of each component of an information system.\nIn the following section, we will discuss a human resource information system (HRIS) as an example of information system implementation in an organization. HRIS is a type of information system. HRIS has a database that stores data of employees. The kind of data kept in a database of typical HRIS include:\n•\tRecruitment data such as applicant’s Curriculum Vitae and the number of candidates."
        },
        {
            "page_number": 16,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 10UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\n•\tdemographic data like employee ID, name, date of birth, gender, position, \nresidence, cost center specifications, department, termination date, and so on.\n•\tperformance management data like performance records of employees. It refers to the feedback, ratings, and achievements of employees.\n•\tlearning management data like training and development.\n•\tCompensation and benefits data like employee’s salary structure and other benefits.\nHRIS uses different technologies to store and process data into useful information. Server computer, desktop computer, laptop, and networks to interconnect different departments and branches are among the infrastructural resources used in a HRIS. Employee use the available computers to access data and generate information from the database (see Figure 1.8). \nFigure 1.8: Human Resource Information System (HRIS)\nSome of the software components of the HRIS would include:\n•\tRecruitment software. This software is used to automate the posting of job offerings as well as the sorting of incoming applications. The software"
        },
        {
            "page_number": 17,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 11UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\ncan post an organization’s job needs on a variety of websites. Applicants \ncan also submit resumes without meeting with anyone in person.\n•\tTime and attendance software : It is used to track employee attendance. \nThis software helps the organization save money. Employees are paid based on the hours they work. \n•\tPerformance management software: It is used to manage performance appraisal data. It helps the organization to make evidence-based decisions to retain, promote, transfer, or terminate an employee.\n•\tTraining and development software: This software is used to manage training programs for employees. It is also used to automate training for online delivery.  \nNowadays, information systems are no more considered only as means of generating information for managerial decision makings. Their role for the competitive power of organizations has become so high that they are considered as strategic assets of organizations. \n1.3. Applications of Information System\nBrainstorming 1.2\nShare ideas on information systems that are used to provide services in \nthe business environment.\nInformation systems have now become the means through which different IT-\nenabled services are provided by organizations.  These IT-enabled services are usually known as e-services. E-services are defined as the provision of public services using technology as a mode of service delivery. For example, banks provide banking services through mobile phone without the need to go to a bank branch. The different types of e-services are discussed below."
        },
        {
            "page_number": 18,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 12UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\n1.3.1 E-Government\nElectronic government or e-Government is the use of information systems \nto provide electronic services to citizens with the purpose of increasing efficiency, transparency, and  citizen  participation. The appropriate application of e-Government allows for higher levels of effectiveness and efficiency in governmental tasks. It also improves efficiency of communication among different governmental offices. Different organizations establish an organizational portal to facilitate communication between the organizations and their customers. A portalis a web-based information system that collects information from different sources into a single user interface so that users can easily access the organization’s electronic services. Figure 1.9 shows the portal of the Ethiopian Ministry of Health. The portal provides different health related services to citizens. \nFigure 1.9 Portal of the Ministry of Health (https://www.moh.gov.et/ejcc/en)\nCitizens go to municipalities for business registrations, auto registry, payment of taxes, issuance of birth certificates, issuance and renewal of identification cards, etc.  All forms of municipal services require citizens to go to the municipalities in person. All these services can, however, be automated and made accessible for citizens over the municipality’s web portal. \nAdoption of e-government solution brings several benefits. Some of the benefits \nare:\n•\tEstablishing trust between governments and citizens"
        },
        {
            "page_number": 19,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 13UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\n•\tFacilitating sharing of information and ideas between government agencies \nand departments within an agency\n•\tAllowing citizens to easily get government decisions and policies through institutional web portals\n•\tReducing cost of running government services as the services are delivered \nonline\n•\tImproving convenience of service delivery. Citizens can easily access government services through their mobile phones. For example, customers can pay their monthly electric bill through their mobile phones.\nActivity 1.6\n1. Explain the concept of e-government.\n2.Discuss the benefits you get by using e-government services.\n1.3.2 E-banking\nIn the traditional banking service, customers must go to the nearby banks to \nwithdraw money, transfer money to families, and pay their utility bills. The traditional banking service is inconvenient and inefficient as it demands customers to go the bank in person and wait their turns to get a service. It also creates unnecessary burden on the bank.    \nElectronic banking is a form of technology-based banking service that avoids exchange of cash, checks, or other types of paper documents. In the banking sector, IT is mainly associated with services like Internet banking, Automated Teller Machine (ATM) and mobile banking. Like in other service sectors, IT has positively influenced the banking industry. Banks make their information systems accessible over the Internet so as to provide Internet banking services (see Figure 1.10).  This allows customers to make payments online, transfer money from their account to other accounts and get other banking services from wherever they are."
        },
        {
            "page_number": 20,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 14UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nFigure 1.10: E-Banking\nSome of the commonly known e-banking services include Automatic Teller \nMachine (ATM), Mobile Banking, Internet Banking, Credit cards, Debit Cards, Smart Cards, Electronic Funds Transfer (EFT) System, etc.\nE-banking provides many benefits to banks as well as to customers. Some of the \nbenefits include: \n•\tThe cost of operation per unit of services is lower for banks.\n•\tCustomers can withdraw cash any time using, for example, ATM service.\n•\tCustomers can make payments from wherever they are.\n•\tCustomers can easily check their account balance \n•\tCustomers can get immediate message about transactions related to their accounts. \nDespite all of the several benefits that e-banking has, there are some challenges to it such as: \n•\tDigital theft\n•\tExclusion of the digitally illiterate citizen from e-banking services\n•\tLack of access to IT infrastructure in remote areas\n•\tUnaffordable cost to acquire IT devices like smart phones for low-income \ncitizens"
        },
        {
            "page_number": 21,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 15UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nActivity 1.7\n1. Explain the concept of e-banking.\n2. Discuss e-banking services that you have used before or heard  from \nyour family members and list the benefits that you obtained from them.\n1.3.3 E-learning\nThe face-to-face form of education is the dominant form of educational delivery \nbut it has some limitations.  It does not allow students to learn in their own pace, and class schedules are not flexible. E-learning is introduced as an alternative form of educational delivery. \nE-learning is a form of learning delivered through the use of digital devices. A \nnumber of other terms are also used to describe e-learning. It is known by terms like online learning, virtual learning, distributed learning, computer-based \nlearning, etc. Despite their subtle differences, these terms in general refer to the use of information and communication technologies for facilitating the teaching learning process. If e-learning is provided over the Internet, it is referred to as online learning\nThe main components of e-learning are the Internet, computers or mobile phones, digital learning resources, content developers (such as teachers and graphic editors), and learners (see Figure 1.13). \nFigure 1.13: Components of E-Learning\nSome of the benefits that e-learning offers to learners are:\n•\tFlexibility in learning time: Learners can access and learn at any time, or \nany day."
        },
        {
            "page_number": 22,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 16UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\n•\tImplementation of student-centered learning: Learners can learn on their \nown pace. \n•\tAccess to a variety of educational resources from different schools or universities\n•\tRich multimedia learning resources: The multimedia e-learning content engages learners to be active learners. \n•\tReduced educational costs: there are no costs for travel and accommodation.\nThe main disadvantages of e-learning are:\n•\tPhysical isolation of students from teachers and other students \n•\tTeachers have little control to monitor the progress of students’ learning \n•\tTechnology related costs make access to e-leaning difficult for students of low-income families. \nActivity 1.8\n1. Explain the concept of e-learning.\n2. Discuss the e-learning system you might have used before or heard \nabout. What are the benefits of e-learning in facilitating your learning?\n1.3.4 E-commerce\nE-commerce (electronic commerce) is the buying and selling of goods and services \nover the Internet. E-commerce is fundamentally a website deployed over Internet to handle online transactions. Buyers go to the E-commerce website using their smartphones or computers when they make an order for a product or service over the Internet. Once the order is received by the merchant, the payment will be processed through the Bank. After the whole transaction is successfully completed, the order will be delivered to the buyer. In E-commerce transactions, many actors are involved including merchants, buyers or customers, banks and transporters. (See Figure 1.14)."
        },
        {
            "page_number": 23,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 17UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nFigure 1.14: Components of E-Commerce\nIn Ethiopia, small businesses which sell different types of products online have \nmushroomed recently. The flexibility with which customers browse products and compare prices and buy the cheapest offerings contributed to the growth of such types of businesses. On the business owner’s side, they do not need to have physical stores and hire salespersons. This allows them to attract more customers. It is, however, worth noting that e-commerce is at its infancy stage in Ethiopia. There is a need to develop the e-commerce infrastructure such as Internet access in all places, efficient transport system, appropriate regulations for E-commerce transactions, and many more.  Figure 1.15 shows a sample local online e-commerce site."
        },
        {
            "page_number": 24,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 18UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nFigure 1.15: E-commerce - online product selling\nSome of the advantages of e-commerce include:\n•\tAvoiding intermediaries: this mode of business allows customers to \nbuy products directly from manufacturers at a cheaper price avoiding wholesalers and retailers.\n•\tConvenience: customers can order products from where they are. \n•\tIncreased bargaining power for the customer: customers can easily browse the price of different merchants and choose the least price.\n•\tGlobal reach: the Internet made it possible for the merchants to expand their customers outside their local area. This, however, also creates more competition as merchants now compete not only with local competitors but also with global ones. \nActivity 1.9\n1. Explain the concept of e-commerce.\n2. Discuss your own experience of e-commerce, if you have any. What \nbenefits do you get?"
        },
        {
            "page_number": 25,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 19UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\n1.3.5 Telemedicine\nTelemedicine refers to the practice of caring for patients remotely without the \ncaregiver and the patient being in the same physical location. Telemedicine was originally introduced to treat patients who were in remote places, far away from local health facilities, or in areas with shortages of medical professionals. People who live in rural areas of Ethiopia do not have access to quality health services. In addition to creating access, telemedicine has now been used as an alternative mode of health service and as a tool for convenient medical care. \nThere are now different telemedicine companies that provide online treatment.  A \npatient can simply come online and request a visit with one of the telemedicine company’s doctors and get treatment. The patients pay the service fee online through their bank account (See Figure 1.16). This online medical consultation has already been implemented in Ethiopia. One can meet online doctors in Ethiopia by browsing the Internet.  \nFigure 1.16: Telemedicine - mobile based service\nThere are now new mobile-based medical services. Patients are starting to use their mobile to monitor and track their health conditions. Simple home-use medical devices allow patients to gather needed medical information for doctors (see Figureure 1.17). These devices are used to measure the patient’s body temperature, glucose levels, and blood pressure without the need to go to clinics. This encourages"
        },
        {
            "page_number": 26,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 20UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nmore and more patients to become proactive about using technology to manage \ntheir health.\nFigure 1.17: Telemedicine Mobile based Service\nSome of the advantages of telemedicine for patients include:\n•\tOvercoming geographical barriers to access health care services\n•\tReduced cost through avoidance of costs such as travel and hotel services. \n•\tAccess to specialized physicians by people who live in remote locations\nTelemedicine, however, has some limitations. Telemedicine requires technical trainings and equipment, which may not be readily available in the rural areas of developing countries. \nActivity 1.10\n1. Explain the concept of telemedicine.\n2.Reflect on the benefit of telemedicine in your daily life.\n1.3.6 Teleconference \nA teleconference is a meeting of two or more people who are separated by distance \nusing electronic communication. It is a generic term for connecting people from"
        },
        {
            "page_number": 27,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 21UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\ndifferent locations electronically. The two popular forms of teleconferencing are \naudio conferencing and video conferencing. \n•\tAudio conference :it is a voice-only communication, sometimes called \nconference call, which connects people from remote locations via telephone lines (See Figure 1.18). For example, meetings can be conducted via audio conference. \nFigure 1.18: Teleconference -Audio conference\nActivity 1.11\n1. Explain the concept of teleconferencing.\n2.Discuss the benefits of teleconferencing for students to do group assign -\nments or project works.\n•\tVideo conference: it combines both voice communications and video \nimages. It supports two-way video conferencing. Video conferencing creates a social presence that resembles face-to-face meetings. It enables participants to see the facial expressions and physical appearance of conference participants at remote sites (see Figure 1.19). Zoom, Google Meet, and Microsoft Teams are some examples of video conferencing software."
        },
        {
            "page_number": 28,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 22UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nFigure 1.19: Teleconference -Video conference\nTeleconference has many benefits for conference participants. It saves time and \ntravel costs. Conference participants can attend the meeting from home or office. It reduces conference hosting costs. In addition, it can accommodate more people as \nit does not cost that much for each additional participant. \n1.4. IT for Entrepreneurship \nEntrepreneurship is defined as the process of designing, launching, and running a new business. An entrepreneur is an individual who creates a new business, bearing most of the risks and enjoying most of the rewards. The entrepreneur is commonly seen as an innovator, a source of new ideas, goods, services, and businesses. \nInformation technology (IT) is transforming the world of work. IT provides new \nopportunities for business people. IT enabled business is a business that uses IT as a platform to run a business. It includes business like online training, providing data entry and processing services, Internet Café service and online product sells. These types of businesses are providing new opportunities for job creation that could help tackle global unemployment.  For instance, the development of the \nmobile-based applications has created new opportunities for small- and medium-sized enterprises (SMEs) in various parts of the world, especially in developing countries like India and Kenya.\nIn our country, IT has also created new employment opportunities. Youth \nunemployment is one of the global challenges we face today. IT can be exploited to solve such types of problems. Therefore, IT should be included in youth"
        },
        {
            "page_number": 29,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 23UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nemployment and entrepreneurship strategies for three key reasons:\n•\tMore jobs and businesses require IT skills\n•\tIT is transforming the way young digital entrepreneurs do business\n•\tThere is an explosion of online learning opportunities and resources for job \nseekers and digital entrepreneurs\nPeople who are competent in IT can create different types of IT-based businesses. They can have their own business as application developers, game developers, and service providers using various platforms including social network websites. In \nEthiopia, IT-based services are flourishing such as Internet cafes and online sales. Figure 1.20 shows a sample online mobile sales business.\nFigure 1.20 Online mobile sales\nIT-based businesses do not require large capital to start as do traditional businesses. An innovative and entrepreneurial mind with little resource like a laptop can create incredible business ideas. The story of the founder of RIDE, Samrawit Fikru, is a good example in Ethiopia. Starting as an SMS-based service, RIDE today is a popular Internet-based taxi-hailing service that is used by thousands of pepole (See Figure 1.21). RIDE has made great contributions to job creation in addition to providing an alternative service to taxi users."
        },
        {
            "page_number": 30,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 24UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nFig 1.21: Ride taxi-hailing system\nActivity 1.12\n1.What is IT based business?\n2.Discuss in a group to identify different types of IT-based businesses.\nUnit Summary\nIn this unit, you have learnt about:\n•basic concepts of data, information, knowledge and wisdom. \n•the relationship between data, information. Knowledge, and wisdom\n•concepts of information systems\n•components of information systems \n•application of information systems in the society such as E-government, \nE-banking, E-learning, E-commerce, Telemedicine, and Teleconference.\n•advantages and the potential downsides of applications of information systems in different social and economic activities of the society \n•the use of IT for entrepreneurship"
        },
        {
            "page_number": 31,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 25UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nKey Terms\nData is a collection of raw facts.\nDatabase is a collection of related files that stores organized dataE-commerce (electronic commerce) is the buying and selling of goods and \nservices over the Internet.E-learning is a form of education that is delivered through digital devices.E-banking is a form of banking in which funds are transferred through an \nexchange of electronic signals rather than through an exchange of cash, \nchecks, or other types of paper documents.\nEntrepreneurship is the process of designing, launching, and running a new \nbusiness.E-services are defined as the provision of public services using technology as \na mode of service delivery.Information is processed data in a meaningful way to potential users.Information system is a set of integrated components for collecting, storing, \nprocessing data, and providing information.Knowledge is an understanding which is acquired through the application of \ninformation into actions. Procedure is a series of steps followed to achieve a desired outcome or goal.\nTelemedicine is a practice of caring for patients remotely while the caregiver \nand the patient are in separate physical locations.Teleconference isthe meeting of three or more people who are separated by \ndistance using electronic communication.Wisdom is an ability to make wise decisions and judgments using one’s \nknowledge. It is the highest level of human understanding. \nData"
        },
        {
            "page_number": 32,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 26UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\nReview Questions\nPart I: Write True if the statment is correct and  False if  it is incorrect.\n1.Data is the foundation for generating information and knowledge. \n2.Information must be accurate and relevant to the purpose in order to be \nconsidered valuable.\n3.Knowledge is data put into context. \n4.As one goes from data to wisdom hierarchy, value increases.\n5.“Think many times before you act”. This statement refers to information. \n6.People are not important component of the information system.\n7.E-commerce is a form of e-service that provides banking services. \n8.E-learning is a form of education that is delivered through digital devices.\n9.Telemedicine is a form of medical services which is provided through digital devices. \n10.IT can be used to create IT-based businesses.\nPart II: Choose the correct answer from the given alternatives.\n1.A collection of facts without meaning to users is ___ .\nA. Knowledge B. Data\nC. Information D. Wisdom\n2.The wise use of knowledge is known as____. \nA. Knowledge B. Data\nC. Information D. Wisdom\n3.___ is  acquired by integrating information with experience.     \nA. Knowledge B. Data\nC. Facts D. Wisdom\n4.One of the following is not the component of information systems.\nA. Hardware B. People \nC. Procedures      D. None"
        },
        {
            "page_number": 33,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 27UNIT-1Information Systems and  Its Applications <Unit>-<No><Running Header>\n5.Application of digital technologies to provide government services to the \npublic is known as __________.   \nA.  e-banking B. e- government\nC. e-learning D. e-commerce\n6.________refers to the practice of caring for patients remotely through \nelectronic devices.   \nA.  e-banking B. e- government\nC. telemedicine D. e-commerce \n7.Which one of the following is the benefit of ICT entrepreneurship:\nA. Create employment opportunities\nB. Generate income for the country \nC. Diversify the country’s economic sector D. All\nPart III: Discussion Questions. \n1.How can e-government transform government services to the public?\n2.Why have information systems become very important for present-day \nsociety?\n3.How has e-learning changed the way we learn in school as well as in the office?"
        },
        {
            "page_number": 34,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 28Learning Outcomes\nAt the end of this unit, students will be able to:\nExplain Emerging Technologies \nDefine Artificial Intelligence and state its branches\nDescribe common Artificial Intelligence applications\nDifferentiate the concepts of Augmented Reality and Virtual Reality\nDescribe Data Science and its applications\nUnit Overview\nEmerging technology can be understood as a technology that is developing \nand evolving fast with a prominent socio-economic impact. There are several examples of emerging technologies that are covered in this unit such as artificial intelligence, virtual reality, augmented reality, and data science. The application areas of emerging technologies are also discussed in the unit.  \n2.1.Artificial Intelligence\nBrainstorming 2.1\nTo what extent emerging technologies can transform the work \nenvironment today?\nArtificial Intelligence (AI) is a branch of computer science that deals with the design of systems that mimic human intelligence. AI systems are designed to have features that only humans are capable of such as reasoning and generalization. An example of reasoning is, “My friend is either at home or in her workplace. My friend is not 2UNIT EMERGING TECHNOLOGIES"
        },
        {
            "page_number": 35,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 29UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nin her workplace. Therefore, my friend is at home”. Generalizing is about applying \npast experiences to current problems of similar nature. For example, “I know how to change a wheel on my bicycle and therefore I can use this knowledge to change the wheel on my friend’s bicycle.”\nEven though the history of AI goes back to the 1940s, it was in the 1950s that the \nterm was coined. AI has become so popular and a powerful tool today due mainly to significant growth in computer capacity and the availability of a large amount of data. AI algorithms are now extensively used in a wide range of areas including business, medicine, and entertainment.   \n2.1.1 Branches of AI\nThough there is no hard and fast way of identifying the subfields of AI, the following groups can be considered as branches of AI. \na. Machine Learning\nMachine Learning is the study of computer algorithms that enable the computer to learn from data and improve itself without being explicitly programmed. Machine learning algorithms learn from experience. Unlike conventional computer algorithms with explicit instructions that are followed by the computer to solve a problem, machine learning algorithms allow the computer to train on sample data inputs. A model that is built from the sample data will then be used to make predictions that are useful for decision-making. Fraud detection, recommendation systems, email spam detector, and speech recognition are some of the examples of applications of machine learning.  \nFigure 2.1 Fraud detection using machine learning"
        },
        {
            "page_number": 36,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 30UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nb. Robotics\nRobotics is the study of machines called robots that substitute tasks that are \ntraditionally done by human beings. Over the past few decades, robots have been used mainly in replacing human labor in routine and mundane activities such as those that are found in car manufacturing assembly lines (See Figure 2.2). Robots are also used in environments that are considered hazardous to human beings like handling radioactive wastes, underwater, and space explorations. \nFigure 2.2 Robots in car manufacturing assembly line\nSimilarly, the application of robots in the household is also becoming common. Nowadays, robots are used at home to do chores, assist the elderly, monitor young children, and more. A robot vacuum cleaner, shown in Figure 2.3, is a well-known example of the application of robots in homes. A robot vacuum cleaner is a machine that sweeps carpets and cleans floors without human intervention.\nFigure 2.3 Robot vacuum cleaner\nc. Natural Language Processing\nNatural Language Processing (NLP) is a branch of AI that deals with enabling computers to understand written and spoken human language in the same way human beings do. Computers’ understanding of natural language is what powers"
        },
        {
            "page_number": 37,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 31UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nthe services we get from a wide range of systems around us. Some of the major \napplication areas of NLP are listed below (See also Figure 2.4).\n•\tSpam Detection : Email service providers, like Yahoo, analyze a text in an \nemail to check if it is spam or not using NLP. \n•\tMachine Translation: translation of text from one language to another that \nsystems, like Google Translate, do is supported by NLP.\n•\tVirtual Assistant: voice-operated virtual assistants such as Amazon’s Alexa and Apple’s Siri use NLP.\n•\tSentiment Analysis: by extracting and analyzing users’ data on social media, it is possible to learn users’ opinions (which could be negative, positive, or neutral) about something using NLP.\n•\tFake News Identification: identifying whether or not news is trustworthy and checking the reliability of its source can be done using NLP.  \n•\tText Summarization: summary of a large piece of document like academic articles can be automatically done using NLP. \nFigure 2.4 Applications of natural language processing\nd. Expert Systems\nExpert systems are computer programs that emulate human experts. They are \ndesigned to solve problems that are normally solved by human experts. Expert systems are one of the earliest attempts to put the field of artificial intelligence to the test. Some of the fields that benefit from expert systems include medical diagnosis, petroleum engineering, and financial investing.\nAn expert system consists of three components: User Interface, Knowledge Base, \nand Inference Engine."
        },
        {
            "page_number": 38,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 32UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nUser Interface: this is part of the expert system that users use to interact \nwith the expert system. It accepts queries from the user and forwards them to the inference engine. It is also the means through which users see the recommendation that the expert system provides. \nKnowledge Base: this is the repository of knowledge of experts in the \ndomain area. The knowledge is organized in the form of if-then-else rules. The knowledge contained is of both factual and heuristic (experiential or common-sense rule) types. The completeness, accuracy, and precision of the knowledge captured in the knowledge base are central to the performance of expert systems.\nInference Engine: this is the brain of the expert system that produces the \nanswer by referencing the knowledge base.\nOne of the earliest and most well-known examples of expert systems is MYCIN. MYCIN is an expert system that emulates infectious disease experts. It identifies bacteria that cause infections and recommends antibiotics. \nFigure 2.5 Expert system\nActivity 2.1\n• List the areas where expert systems can be applied. \n2.1.2 Application of AI\nNowadays, the power of AI is being exploited to efficiently solve problems in a wide range of areas. The following are some examples of applications of AI."
        },
        {
            "page_number": 39,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 33UNIT-2Emerging Technologies <Unit>-<No><Running Header>\ni.Online Shopping\nAI algorithms are used to dive into and process the massive user data available in \nvarious systems to extract personalized data about shoppers. The data is then used to present users with items that they are more likely interested in, which makes the whole shopping experience efficient and enjoyable. \nFigure 2.6 Online shopping\nii. Autonomous Cars\nBy collecting data from sources such as GPS, vehicle radar, and cameras, autonomous cars can function without the help of a human agent. Although fully automated autonomous cars are not yet on the streets, autopilot features are already implemented in cars produced by companies like Tesla. The trend and development in the area indicate that the era of fully automated cars is not far away. Multiple reports indicate that autonomous cars have great potential for improving road safety. Autonomous cars are believed to significantly reduce the number of road accidents due to their features such as the ability to exchange safety-critical information with one another, the 360-degree view of the surrounding, the power to flag hazards on the road ahead, and many more."
        },
        {
            "page_number": 40,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 34UNIT-2Emerging Technologies <Unit>-<No><Running Header>\n   Figure 2.7 Autonomous car\niii. Social Media\nThe size of data available on social media makes it practically impossible to process \nthe data using human beings. This is why AI has become a fundamental part of how social networks operate today. Social media companies, like Facebook, apply AI in various areas such as advertising, delivery of personalized content, facial recognition, and many more. \n  Figure 2.8 Facial recognition using AI\niv. Surveillance\nSurveillance systems can benefit significantly from AI. For example, AI systems can automatically detect suspicious behavior in real-time. This can be implemented in places like supermarkets, military and security stations, or any place with restricted access."
        },
        {
            "page_number": 41,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 35UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nFigure 2.9 AI application in surveillance\nv. Agriculture\nGlobal phenomena like climate change, food security, and population growth are \nmaking the application of innovative approaches in the area of agriculture more important than ever. AI systems are at the core of such type of innovative approaches. Examples of applications of AI in agriculture include precision farming, detection of pests, monitoring the health of soils and crops, and the like. AI-based agricultural advisory systems can be built that farmers use to be climate-ready and adjust their farming activities accordingly. \nFigure 2.10 AI based agriculture Precision Farming\nvi. Customer Service\nDue to advancements in multiple areas of AI such as Natural Language Processing (NLP), chatbots are nowadays used to provide customer support. A chatbot is a system that simulates human conversation through text or voice commands. It is a fast and cheaper way for companies to provide support and assistance to their customers."
        },
        {
            "page_number": 42,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 36UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nFigure 2.11 Chatbot\nvii. Healthcare\nHealthcare is one of the areas with immense potential for the application of AI. \nDisease diagnosis, drug development, and hospital care are some of the examples of applications of AI in the healthcare sector. More examples of the assistance that AI offers in healthcare for complex activities like surgery are discussed in Section 2.2\nFigure 2.12 AI application in surgery\nviii. Space Exploration\nSpace exploration is characterized by the processing of a massive amount of data. AI and Machine Learning, which is one of the branches of AI, are used to process data that assists space exploration activities. Operations like space mission planning, data collection, navigation, and maneuvering are supported by AI. NASA, for example, uses a robot known as Robonaut to work on the International Space Station. Robonaut uses many of the tools that an astronaut uses and can perform tasks that are normally done by human beings."
        },
        {
            "page_number": 43,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 37UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nFigure 2.13 Robonaut and an astronaut\nix. Smart Homes\nAI systems are abundant in what is known as smart homes. The AI systems assist \nin home security, household chores, alerting of smokes, and many more.   \nFigure 2.14 Smart home\nx. Banks\nCredit cards and other forms of fraud prevalent in the banking industry can be prevented using fraud prevention AI. AI systems are used to trace the pattern in credit card transactions and detect frauds.\nFigure 2.15 Application of AI in banks"
        },
        {
            "page_number": 44,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 38UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nxi. Search Engine\nSearch engines use AI systems such as NLP to better understand user search queries. \nThey also use AI in ranking algorithms, which determine in what order responses are presented to users in reply to their search query.\nFigure 2.16 Google Rankbrain: Google’ s application of AI\nActivity 2.2\n1. Discuss how AI systems can help social networking companies improve \ntheir services. \n2. Search and discuss in group on more examples of the application of AI \noutside those covered in the textbook. Discuss the features and debate for or against AI systems. \n3. Join with a partner and let one of you take the role of supporting auton-\nomous cars, one against. Then discuss and debate whether they are a good idea, or not, and why.\n2.2. Augmented Reality and Virtual Reality\n2.2.1 Augmented Reality\nAugmented Reality (AR) is a technology that enhances the real world by overlaying computer-generated digital data on real-world objects. By blending the real world with computer-generated information, AR creates an engaging and dynamic user experience."
        },
        {
            "page_number": 45,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 39UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nThe hardware of AR includes a processor, sensors, input devices, and a display. \nMobile devices do have all four components to run AR applications. Depending on the application, however, the display could be tablets, smartphones, head-mounted displays (HMD), or smart glasses. Such displays are used to locate objects of focus as well as show the computer-generated overlaid information. \nFigure 2.17 Augmented reality devices\nAR works by first capturing the picture of the real-world object through a camera. Then relevant information about the image like measurement of the object, as well as other objects that are present in the image and their relative distance from the object in focus, will be processed by the software. Virtual information will be finally generated and overlaid on the object.\nFigure 2.18 Example of augmented reality\nActivity 2.3\n•\tShare examples of AR applications that you have used. Describe their features including potential areas of improvement. \n2.2.2 Virtual Reality\nVirtual reality (VR) is a technology that creates a three-dimensional computer-generated simulated environment. A person can interact with VR using electronic devices such as goggles, headsets, gloves, or bodysuits. VR attempts to create an illusory environment that can be presented to our senses with artificial information,"
        },
        {
            "page_number": 46,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 40UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nmaking our minds believe that it is (almost) a reality. Unlike AR, VR creates a \ncompletely immersive experience for the user. \nFigure 2.19 Virtual reality devices\nUsing sensors of various types, a VR environment responds to the user’s movements and adjusts views and perspectives in real-time. VR also enables users to touch and manipulate virtual objects by way of data gloves equipped with force-feedback devices. This is how a VR creates the illusion of being in a real environment.  \nFigure 2.20 Example of virtual reality\nActivity 2.4\n1.Give examples of how different types of training can be provided using VR. \n2.Prepare a presentation on how your school benefit from VR.\n2.2.3The Difference betweenVR andAR\nAR and VR are both known for their enriched and interactive experiences with rich 3-D visuals. However, there are some differences between the two. The following table summarizes the major differences between the two technologies."
        },
        {
            "page_number": 47,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 41UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nTable 2.1 The difference between Virtual Reality and Augmented Reality\nAugmented Reality Virtual Reality \nAR works in a real-world \nsetting. It is partially im-mersive.VR operates in a com -\npletely virtual world. It is fully immersive.\nAR users can control their presence in the real world.VR users are under the control of the system.\nAR can run on familiar de -\nvices such as smartphones.VR requires a headset de -\nvice to use it. \nAR works in an environ -\nment where the real and virtual worlds blend.  VR works only in a fic-tional/simulated reality. \n2.2.4 Application of VR and AR \nThe potential areas of application of AR and VR are very wide. The interactive \nnature of these technologies, however, makes them more attractive to areas such as education, healthcare, and entertainment. The following are examples of the application of AR and VR within the three areas. \n•\tEducation: AR and VR have a wide array of uses in education and enable to learn-on-the go using real-time instructions. They also make learning interactive and fun. Among the reasons why such technologies are very useful in education include:\noThey allow students to travel in time and space and see historical events in a very interactive manner. \noAR allows students to learn various things more concretely. For example, students can see the different organ systems visually and interactively. \noThe complexity of some concepts can be reduced when presented in a three-dimensional interactive manner. \noThey are a good alternative in an environment where resources are scarce such as laboratory equipment.\noLearning will be made possible from anywhere using relatively"
        },
        {
            "page_number": 48,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 42UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nmore accessible devices like smartphones. \noStudents can get connected interactively with students from different \nparts of the world. This helps to instill desirable values like empathy and collaboration in students. \nA\nB\nFigure 2.21 Example of augmented reality (A) and virtual reality (B) in education\n•\tHealthcare : there are numerous AR and VR applications implemented in the \nmedical industry. Some of the applications in use today include:\noPhysicians and medical students are trained and taught using AR/VR technologies. The technologies allow them to learn life-saving operations like surgery in a risk-free environment. \noAR improves disease diagnosis in a manner that is less invasive and pain-free for the patient.\noBy helping surgeons visualize the patient’s muscles, bones, and internal organs, AR supports a surgical procedure in a low-risk and much more accurate way.  \noTele-surgery, which is conducted with the patient and the surgeon being in different locations, is supported by VR. \noVR can be used to distract patients from stressful experiences caused by prolonged recuperation in hospitals. Such patients can use VR headsets to focus on entirely different things and make their medical treatment less stressful."
        },
        {
            "page_number": 49,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 43UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nA\n B\nFigure 2.22 Example of augmented reality (A) and virtual reality (B) in healthcare\n•\tEntertainment : this is another area where the use of AR and VR has become \nvery popular. The following are some examples of the application of AR and \nVR in entertainment:\noBy adding computer-generated data on artifacts in art galleries and museums, AR creates a very interactive and enjoyable experience for visitors.\noVR movie theatres equipped with individual armchairs that have extra gear, glasses, helmets, or tools for aroma injections can create a completely new and immersive experience for movie fans.  \noVR and AR components can be added to amusement parks to help visitors enjoy their visit more.  \noDifferent manufacturers are introducing numerous AR applications which present gamers with new ways to interact with the real world. The rise in the number of mobile gamers has also created a demand for augmented reality games."
        },
        {
            "page_number": 50,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 44UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nA\nB\nFigure 2.23 Example of augmented reality (A) and virtual reality (B) in \nentertainment\nActivity 2.5\n1.Describe the difference between Augmented Reality and Virtual Reality.\n2.Discuss among your class mates which technology, between AR and VR, \nis more practical in your particular context. Demonstrate or discuss the features and share what you like about them. Make also suggestions for improvements.\n2.3. Data Science\nThe amount of data that is being generated by organizations from different sources is growing exponentially. In order to properly utilize such an enormous amount of data in a manner that ensures competitiveness, an appropriate type of approach or method on how to use data is required. Data science provides the tools and techniques that are used by organizations to take advantage of the vast amount of data that they own.\nData Science is a blend of tools, algorithms, and machine learning (ML) principles \nused to discover and extract hidden patterns. It is an interdisciplinary field that"
        },
        {
            "page_number": 51,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 45UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nincludes areas such as statistics, mathematics, and computer science. Data science \nemploys various tools at different stages in finding valuable solutions. A professional who is charged with the responsibilities of the activities involved in data science is known as a data scientist. Data scientists use different types of algorithms to turn data into useful insights.\nFigure 2.24 Data science disciplines\nThe concept of big data is strongly associated with data science. Big data refers to a huge volume of data that cannot be processed using traditional methods, and it is characterized by volume, variety, and velocity. For example, in 2020 Facebook generated 4 petabytes of data every day — that is a million gigabytes. Data science \napplies mathematical and statistical approaches and computer tools for processing big data.\nFigure 2.25 Characteristics of big data\nThe insights generated through data science tools and techniques apply to almost all fields. In manufacturing, for example, data science can be used to forecast product demand that will be used to determine the precise amount of raw material"
        },
        {
            "page_number": 52,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 46UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nthat needs to be ordered. The personalization of information on social media is \nachieved through the use of data science tools on the massive amount of data that social media companies collect from their users. Weather predictions in the agricultural sector, preventive medicine in health care, and risk management in business are but a few examples to mention about the areas where data science has improved results to a great extent. \nThe application of data science in sites like social networking sites involves the \ncollection of large amounts of user data. But this sometimes creates tension with the issue of privacy, especially in countries where there are strong privacy regulations. Data anonymization and data generalization  are some of the ways suggested \nfor tackling issues of data protection and privacy. Data anonymization refers to removing personally identifiable information from data, while data generalization is about bunching data into broad categories such as age groups and geographical areas. As these approaches limit the level of insight that companies generate from data, privacy remains to be a contentious issue.    \nActivity 2.6\n1. Discuss among your class mates on the exponential growth of data in \ntoday’s business environment and its implications. \n2. How much of your personal data are you willing to allow social media \ncompanies to use?"
        },
        {
            "page_number": 53,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 47UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nUnit Summary\nIn this unit, you have learnt about:\n•what is meant by Emerging Technologies\n•what Artificial Intelligence (AI) is\n•the branches of AI\n•the wide range of application areas of AI\n•what Machine Learning is\n•what robots are and their applications in various areas\n•Natural Language Processing (NLP) and its applications\n•what expert systems are and the three components of expert systems \nnamely, user interface, knowledge base, and inference engine\n•what Augmented Reality is\n•what Virtual Reality is\n•the difference between Augmented Reality and Virtual Reality\n•the various application areas of Augmented Reality and Virtual Reality\n•what Data Science is and the areas of applications"
        },
        {
            "page_number": 54,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 48UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nKey Terms\nArtificial Intelligence  is a branch of computer science concerned with the \ndesign of systems that mimic human intelligence\nAugmented Reality (AR)  is a technology that enhances the real world by \noverlaying a computer-generated digital dataBig Data is a data characterized by large size (volume), diverse sets of \ninformation (variety), and exponential growth rate (velocity)\nData Science is an interdisciplinary field with a blend of tools and algorithms \nthat discovers and extracts hidden dataEmerging Technology is a fast-evolving and developing technology with a \nprominent socio-economic impact\nExpert system is a computer program that emulates human expertsInternet of Things (IoT) is an interrelated Internet-connected objects that \nexchange data without human interventionMachine Learning is a study of computer algorithms that enable the \ncomputer to learn from data and improve itself\nNatural Language Processing (NLP) is a branch of AI that deals with \nenabling computers with understanding human languageRobotics is a study of machines called robots that substitute tasks that are \ntraditionally done by human beingsSocial Media is a medium that facilitates socializing through virtual networksVirtual Reality (VR) is a technology that creates a three-dimensional \ncomputer-generated simulation environment\nArtificial"
        },
        {
            "page_number": 55,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 49UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nReview Questions\nPart I: Write True if the statment is correct and  False if  it is incorrect.\n1.Growth in computer power is one reason for the popularity of AI today.\n2.It is practical to process the entire data of social media without the help of \nAI.\n3.Virtual Reality is no different from Augmented Reality.\n4.Data science has no challenge regarding privacy.\n5.Big data is something that cannot be managed using traditional data processing approaches. \nPart II: Match the items given under column B with associated items in \ncolumn A\nA B\n1.Application of NLP \n2.Blend of virtual and real world \n3.Bunching data into broad categories \n4.MYCIN \n5.A fully immersive experience a. Virtual Reality \nb.Sentiment Analysis \nc. Augmented Reality d. Datata generalization e. Big dataf. Expert Systemsg. Data Science\nPart III: Fill in the blank spaces\n1.The process of de-identifying users from a data set is called _________.\n2.One example of application of AI that can be implemented in a \nsupermarket is ____________.\n3.One example of an AI system that is used in customer service is ______.\n4.A robot that NASA uses in the International Space Station is called ___.\n5.The device used to capture input of an Augmented Reality is __________."
        },
        {
            "page_number": 56,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 50UNIT-2Emerging Technologies <Unit>-<No><Running Header>\nPart IV: Discussion Questions. \n1.Explain some of the ways in which AI contributes to the healthcare sector.\n2.Discuss how AI can improve life in a smart home. \n3.Explain ways in which AR and VR can make learning an interactive and \nfun experience."
        },
        {
            "page_number": 57,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 51Learning Outcomes\nAt the end of this unit, students will be able to:\nDefine database\nExplain data models\nDescribe data management approaches\nRecognize database entities, attributes and relationships\nDevelop data models with Entity Relationship Diagram (ERD)\nCreate and manage databases using Microsoft Access \nUnit Overview\nDatabase management is a method used to organize data in a more effective way \nfor easy management and use of data. In this unit you will learn the basics of database modelling and management. The unit covers concept of database, file-based and database approaches, relational data models, relational database, and database management with Microsoft Access. \n3.1. Data Management Approaches \nBrainstorming 3.1\nDiscuss the types of data schools capture and how they manage it to run their day-to-day activities.\nData management is an integral part of our daily lives. Traditionally, data used to be managed manually using physical papers. As the size of data that organizations manage become larger and larger, computers have become instrumental for efficient 3UNIT DATABASE MANAGEMENT"
        },
        {
            "page_number": 58,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 52UNIT-3Database Management  <Unit>-<No><Running Header>\nmanagement of data (see Figure. 3.1).  The first computer-based data management \nis a file-based data management approach. The database approach was introduced later and addressed the inherent weaknesses of the file-based approach.\nFigure 3.1: Paper-based vs Computerized systems\n3.1.1 File based data management \nFile-based data management is an approach in which data is stored in separate files \nwithout explicit relationships (see Figure. 3.2). Data in different files is managed by different application programs. Any change to data requires modification of the program that uses the data. Changes made on the program may also require change in the file structure. In file-based data management approach, each department creates and processes its own files separately. For example, procurement and finance departments create and manage their own files. \nFigure 3.2: Architecture of the file-based data management\nThe file-based data management approach creates problems of data duplication and data inconsistency. For example, let us say employee data is stored both in human resource and finance departments. When human resource department modifies"
        },
        {
            "page_number": 59,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 53UNIT-3Database Management  <Unit>-<No><Running Header>\nthe employee records upon hiring new employees, it may not communicate the \ninformation to the finance department. As a result, different information about employees would be found in one organization. Such types of contradictions are caused by the fact that data in one file is not linked to data in other files of the same organization in the file-based approach. The isolation of data also makes retrieval of data of the entire organization a very difficult task. These problems led to the development of the database approach. \ndevelopment of the database approach. \nFigure 3.3: Data redundancy in different departments\nActivity 3.1\n1.Discuss the file-based data management approach.  \n2.Discuss the main limitations of the file-based approach to management of data in an organization\n3.1.2 Database approach to data management\nIn the database approach to data management, data is managed by a database using \na database management system (DBMS) software. A database is a collection of logically-related data. It stores all organization’s data in one repository. A database is created to address the data requirements of different user groups and application programs in an organization. \nDatabase is an essential resource to every organization. It is used to maintain internal \nrecords of organizations such as student records for schools, customer records and daily sales records for supermarkets, patient database for hospitals and the like (see Figure. 3.4). Data in the database are used to generate different information that are"
        },
        {
            "page_number": 60,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 54UNIT-3Database Management  <Unit>-<No><Running Header>\nused in the daily business activities. For example, the salesman in a supermarket \nuses database to generate daily or monthly sales reports. Hospitals may generate report that shows the most frequent disease types in the last year.  \nreport that shows the most frequent disease types in the last year.\nFigure 3.4: Databases for different organizations\nDBMS is software that manages databases. DBMS is used to add new data, modify data and delete data in the database. It is also used to retrieve data from the database. DBMS essentially serves as an interface between the database and end users or application programs. It ensures that data is easily accessed by potential users. \nThe database management process has three main components (see Figure 3.5). At \nthe bottom is the database which stores the actual data. In the middle is a DBMS \nwhich manages the database. At the top of the DBMS are application programs that use the database. The application programs submit database query to the DBMS. Then, the DBMS retrieves data that matches the queries and replies retrieved data to the application programs.  \nFigure 3.5: Database Architecture"
        },
        {
            "page_number": 61,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 55UNIT-3Database Management  <Unit>-<No><Running Header>\nThe database approach to data management provides many advantages to the \norganization. Some of the advantages are:\n•\tData independence: A database is created to store all organization data and support all users of the organization. Each user or department does not need to manage its own isolated data.\n•\tData sharing: all organization’s data is stored in one central database. DBMS allows this central database to be accessed by different users.\n•\tAvoiding data redundancy: Isolated departmental files are stored in one \ncentral database. The DBMS can retrieve data from multiple tables so as to meet the requirement of different database users or application programs.\n•\tImproved data security: Data in the database is accessed only by authorized users. Only users who are given data access right can access and modify data in the database. \nActivity 3.2\n1.What are the benefits of a database as compared to file-based data man -\nagement approach? \n2.Why do organizations need to store data in the database?\n3.What is the purpose of the DBMS?\n3.2. Data Model\nData model of a database is the blue print of the database. It is used as a guide to store data in a database.  It shows database entities, attributes and the relationships between the entities. It also specifies what data to store in the database. For example, a school database stores data about students and teachers. It does not need to store data about patients or traffic accidents. These data do not have relevance to the school’s day-to-day activities. Likewise, hospitals store data about patients and physicians."
        },
        {
            "page_number": 62,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 56UNIT-3Database Management  <Unit>-<No><Running Header>\n3.2.1 Basic Concepts in Data Modelling\nThe basic concepts of entity, relationship and attribute are discussed below: \n•\tEntities are basically people, places or events about which you want to store \ndata. For example, banks may keep data about customers and bank account \nentities. Similarly, a library may have entities like book, loan andborrower. \nEntities are equivalent to tables when implemented in the database.\n•\tAttributes are properties of an entity that are used to differentiate one entity \nfrom other entity. For example, customer entity may have customer id, \nname, sex and address as its attributes. On the other hand, book entity may have author name, book title and publication year as its attributes. The two entities have different attributes because they are different entities. \n•\tA relationship  is an association between entities. For example, customer \nhas account in a bank. The verb ‘has’ indicates the relationship between customer and bank account entities. \nThe relationship between entities can take different forms:\n•\tOne-to-one relationship: An instance of an entity has only one instance in the other entity with which it is associated (see Figure 3.8). For example, a country and a capital city. A country is associated with one capital city, and a capital city is associated with only one country. \nFigure 3.7: One-to-one relationship type\nNotes\nInstance of an entity refers to a single occurrence of an entity. For example, “Addis Ababa” is an instance of the entity “City”."
        },
        {
            "page_number": 63,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 57UNIT-3Database Management  <Unit>-<No><Running Header>\n•\tOne-to-many relation: An instance in one entity is associated with \nmany instances in the other related entity (see Figure 3.8). For example, a department called ‘Computer Science’ is associated with multiple students. \nFigure 3.8: One-to-many relationship type\n•\tMany-to-many relationship: Instances on both sides of the relationship are associated with multiple instances of the other entity (see Figure 3.9). For example, an employee may work in multiple projects. At the same time, a project may have multiple employees assigned to it. \nFigure 3.9: Many-to-many relationship type\nActivity 3.3\n•Explain the differences between entities, attributes, and relationships.\n3.2.2 Entity Relationship Diagram \nOne of the popular representation tools for data model is Entity Relationship \nDiagram (ERD). ERD is used to visually represent a data model. It has three main components discussed in Section 3.2.1, namely entity, attribute and relationship. \nEntities are represented as a rectangle and relationships as a line to show the \nassociation between entities. Attributes are represented as ellipses. The names of entities and attributes are placed inside the rectangle and the ellipse respectively. The names of relationships, on the other hand, are placed right on top of the line."
        },
        {
            "page_number": 64,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 58UNIT-3Database Management  <Unit>-<No><Running Header>\nFigure 3.10 shows an example of ERD that shows the association between a student \nand book entities and their respective attributes. \nFigure 3.10 Entity Relationship Diagram\nAs Figure 3.10 shows, student entity has student_id, name, age and address attributes. On the other hand, book entity has book_id, book_title, publication_year attributes. The two entities are related by ‘borrows’ relationship.\nActivity 3.4\n1.\tDescribe the purpose of ERD.\n2.\tAssume that teachers are assigned to a class schedule in your school. The Teacher entity has teacher_id, name, sex, and specialization attributes. The Schedule entity has schedule_id, room, period, and section attributes. Con -\nstruct an ERD based on the description given.\n3.2.3 Relational Data Model \nThe relational data model represents data in terms of two-dimensional tables \ncalled relations. A relation is nothing but a table of rows and columns. Each row, \nalso called a record ortuple, contains a unique instance of data. These rows in \nthe relation denote a real-world entity. The columns in a relation, also known as attributes or fields, are used to describe the properties of relations. Figure 3.11 shows an example of a student relation."
        },
        {
            "page_number": 65,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 59UNIT-3Database Management  <Unit>-<No><Running Header>\nStudent\nStudent \nIDName Sex Grade Address Attribute\nRecords        \n/tuples   \n   ST001 Brook Assefa M 12 Kebel 05\nST002 Chaltu Bayissa F 11 Kebele 01\nST003 Ali Mohammed M 10 Kebel 03\nST004 Tsion Gabissa F 10 Kebele 01\nFigure 3.11 Student relation\nTherelational data model provides conceptual tools to represent a data model of a \nrelational database. A relational data model captures a collection of relations, their \nattributes, and their relationships. See Figure 3.12. \nFigure 3.12 Relational data model\nNotes\nFigure 3.12 shows that student relation has student_id, sex, grade and address attributes. On the other hand, Book_Loan relation has book_id, student_id and loan_date attributes. Student and Book_Loan relations are related via the student_id attribute that is paced in the Book_Loan_relation. In the same way, Book relation is related with Book_Loan_ relation via the book_id attribute placed in the Book_Loan_ relation."
        },
        {
            "page_number": 66,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 60UNIT-3Database Management  <Unit>-<No><Running Header>\n3.2.4 Relational Database \nRelational database is a type of database that contains logically related set of tables. \nThe rows in a table are called records, and the columns are called fields or attributes. Relational database is implemented using relational database management system (RDMS) software. The following three tables are used to show implementation of a relational database (see Figure 3.13).\nStudent\nPrimary key\n\nStudent ID Name Sex Grade Address\nST001 Brook Assefa M 12 Kebele 05\nST002 Chaltu Bayissa F 11 Kebel 13\nST003 Ali Mohammed M 10 Kebele 05\nST004 Tsion Gabissa F 10 Kebele 08\nBook loan \nPrimary key\nForeign key\n   \nBook_Loan_No Book ID Student \nIDLoan date\nBL0001 B001 ST001 12/5/2021 \nBL0002 B002 ST002 10/6/2021\nBL0003 B003 ST001 3/12/2021\nBook \nPrimary key\n\nBook ID Author Title of book Year\nB001 Hana Bekle Introduction to Physics 2004\nB002 Dania Kedir  Organic Chemistry 2015\nB003 Kebede Yohannes Java Programming 2020\nFigure 3.13 Relational database"
        },
        {
            "page_number": 67,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 61UNIT-3Database Management  <Unit>-<No><Running Header>\nNotes\nThe above three tables in Figure 3.13 have a primary key.  A Primary \nKey is a field which has a unique value for each record. For example, \nstudent_ID serves as a primary key for the Student table because no two students can have the same id. \nThe relational database uses Foreign Keys as a navigational link to \nretrieve data from related tables. A foreign key is an attribute in a table that matches the primary key of another related table. Student_ID and Book_ID in Book_Loan_Table are foreign key. They are used to link Student table and Book table respectively to the Book_Loan table."
        },
        {
            "page_number": 68,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 62UNIT-3Database Management  <Unit>-<No><Running Header>\nActivity 3.5\nCode Country PopulationArea\n(Km²)\n ET  Ethiopia 114,963,588 1,000,000\n EG  Egypt 102,334,404 995,450\n TN  Tanzania 59,734,218 885,800\n KY  Kenya 53,771,296 569,140\n UG  Uganda 45,741,007 199,810\n SD  Sudan 43,849,260 1,765,048\nSource: https://www.worldometers.info\nCity Population Code\n  Addis Ababa 2,757,729 ET\nOmdurman 1,200,000 SD\nCairo  7,734,614 EG\nGondar  153,914 ET\nJimma  128,306 ET\nKisumu 216,479  KY\nKhartum 1,974,647  SD\nMombasa 799,668  KY\nNairobi 2,750,547  KY\nSource: https://worldpopulationreview.com/continents/africa/cities\nAnswer the following questions based on the tables given above.\n1.What are the entities in the above tables? Give a name for each table \nthat represents the content of the data. \n2.What is the attribute that is used to link the two tables?  \n3.How many fields does the first table have?\n4. List the cities that are found in Kenya.\n5. Create a new table that contains country name, city name and city popu-\nlation attributes. \n6. Create an ERD diagram with the relationship type."
        },
        {
            "page_number": 69,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 63UNIT-3Database Management  <Unit>-<No><Running Header>\n3.3. Creating Relational Database in Microsoft Access\nThis section explains how to create and manage a database on Microsoft (MS) \nAccess. Relations or entities are represented as database tables. Attributes are represented as table fields. Figure 3.14 shows the required transformation between relations in the relational data model and MS Access database tables. \nStudent entity\nAttribute name\nstudent_idstudent_nameSexGradeAddress\nStudent table \nField name Data type student_id Textstudent_name Textsex Text\ngrade Number\naddress Text\nFigure 3.14 Transformation of entity into Microsoft Access database table \nThe data type column indicates the type of data to be stored for the respective field. \nFor example, student name field, as shown in Figure 314, has Text data type while grade is assigned Number as its data type. \n3.3.1 Creating Microsoft Access Database \nWhen you work on Microsoft Access, creating a database is the first step. In \nMS Access, a database is a container of database objects such as tables, forms, \nqueries and reports. There are different versions of MS Access software to create and manage databases. In this textbook, you will learn how to create and manage database objects using MS Access 2010. \nIn order to create a database, follow the following steps:\n1.Open MS Access Software \n2. In the main Window, click on Blank database\n3.Enter the database name in the File Name input box. (When giving a name to \nthe database, it is highly recommended to use names that properly describe the data stored in the database.)\n4. Click on the Create button."
        },
        {
            "page_number": 70,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 64UNIT-3Database Management  <Unit>-<No><Running Header>\nAfter the database is created, another MS Access window is opened where database \nobjects can be created. Before other database objects are created, a table object must be created. A table is a set of fields that store data about a certain entity.\nWe use the following tables in Figure 3.15 for the following practical activities in \nMS Access. \n Student\nStudent_ID Sname Sex Age Grade_level\nST0001 Brook Assefa M 17 11\nST0002 Chaltu Bayissa F 18 12\nST0003 Giday Hagos M 15 9\nST0004 Nejat Mohammed F 17 11\nST0005 Hailu Mekonnen M 16 9\nST0006 Kedir Ali M 18 12\n Teacher \nTeacher_ID tname  sex age specialization \nT0001 Oljira Kuma M 42 Biology  \nT0002 Hagos Kiros F 35 Chemistry \nT0003 Rediet Assefa F 28 Mathematics\nT0004 Ahmed Yusuf M 27 Physics\nT0005 Delebo Nurye M 26 IT\nGrade \nStudent ID Teacher_ID subject grade\nST0001 T0001 Biology   75\nST0001 T0002 Chemistry 86\nST0002 T0002 Chemistry 70\nST0001 T0003 Mathematics 95\nST0001 T0004 Physics 65\nST0003 T0002 Chemistry 82\nST0002 T0003 Mathematics 78\nST0001 T0005 IT 90\nST0002 T0001 Biology  67\nFigure 3.15 Sample Tables"
        },
        {
            "page_number": 71,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 65UNIT-3Database Management  <Unit>-<No><Running Header>\n3.3.2 Creating Table in Microsoft Access\nWhen you create a new table, Microsoft Access asks you to define table fields. \nTable fields are entity attributes. One or more tables can be created in one database. Each table name must be unique. The tables must also have two or more fields. Field names must be unique in a table.\nFollow the following steps to create a table in MS Access:\n1.Open a database file. \n2. Click on Table Design button from the Create menu. \n3.Enter field names for the new table such as Student ID, Sname, Sex, Age \nand Grade_level (see Figure 3.15). \n4.Specify the data type of the field. The data type can be text, number, date/\ntime, currency, etc. depending on the type of data that the field is used to store.\n5.When you finish, click on the Save button. \n6.In the popup that is displayed, enter the table name and click on the Ok \nbutton.\nNotes\nWhen you want to create a new table or add data into or modify an existing table, you must first open the database in which you want to store your database objects. This is important because there can be more than one database in a single computer. \nWhen you define a field to a table, you must specify the appropriate data type for a Field name. The data type could be text, number, date and currency. Data types are one form of validation mechanisms that ensure the correctness of data in the database. If you set the data type as Text, it will not accept its data as Number or any other type. Only text is a valid value to it. \nTo set the field as primary key, go to the table design view, select the field and click on Primary Key (\n) button in the toolbar."
        },
        {
            "page_number": 72,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 66UNIT-3Database Management  <Unit>-<No><Running Header>\nFollow the following steps in order to enter data into a database table:\n1.Open a database if it is not already opened \n2.Click on the table name and select Datasheet View from View in the \ntoolbar. For example, open student table. \n3.Enter appropriate values for each field. \n4.Enter all the records of the Student table shown in Figure 3.15. (See Figure 3.16)\nFigure 3.16 Adding records to a table\nActivity 3.6\n1. Create a database by your school’s name. \n2. Create the three tables shown in Figure 3.15 in the new database you \ncreated.\n3.3.3 Creating Query in Microsoft Access\nQuery is a database object that provides a custom view of data from one or more \ntables. It is a way of searching for and compiling data from one or more tables. In MS Access, data is retrieved through query by creating graphical query or \nwriting Structured Query Language (SQL) statements. In this section, you will learn how to retrieve data using graphical query. A query is used to define specific search conditions to find exactly the data you want."
        },
        {
            "page_number": 73,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 67UNIT-3Database Management  <Unit>-<No><Running Header>\nFollow the following steps in order to create a query in Microsoft Access:\n1.Open a database where your database tables are stored\n2. Click on Create menu button. Then, you get the following MS Access toolbar  \nFigure 3.17 MS Access toolbar\nYou can create query using Query Wizard  or Query Design. Let us see how to \ncreate a query using Query Design option. \n3. Click on Query Design button from Microsoft Access toolbar.\n4.Select a table or tables from Show Table box from which you want to select \nrecords for your query (See Figure 3.18), and click on OK bottom. You then get the following window.\nField row\nFigure 3.18 Query Design Window\n5.Select the fields in the Field  row. For example, if you want to select only sname \nand sex field, select sname in the first column and sex in the second column of \nthe Field row.\n6.Select Datasheet View from the toolbar to see your query results (see Figure 3.19).If you do it correctly, you get the following results."
        },
        {
            "page_number": 74,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 68UNIT-3Database Management  <Unit>-<No><Running Header>\nFigure 3.19 Query Results\nActivity 3.7\n1. Create a query that displays teacher name and specialization from the \nteacher table (Figure 3.15). Save your query as Teacher_Specialization. \n2. Create a query that displays student name and grade level from student \ntable (Figure 3.15). Save your query by a appropriate name.  \n3.3.4 Adding Criteria to Query Design \nBy adding additional criteria to a query design, it is possible to retrieve specific \ndata from a table. \nFollow the following steps in order to add criteria to a query.\n1.Open the Query Design Window.\n2. Add a table to query design window.3.Select fields to be displayed in Query Result Window.\n4.In the Criteria row, enter query selection criteria. For example, if you want \nto display only Male students, under Sex column, enter M as your query \nselection criteria (See Figure 3.20)."
        },
        {
            "page_number": 75,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 69UNIT-3Database Management  <Unit>-<No><Running Header>\nFigure 3.20 Query Design with a Criteria\nNotes\nThe criteria you enter in the criteria row must be exactly the same with \nthe data stored in the table. For example, if sex data is kept in the table using a single character (for example m), you cannot get the required result if you enter ‘Male’.\n3.3.5 Selecting Data from Multiple Tables \nThe power of a relational database is that it allows you to retrieve data from two \nor more tables.  \nFollow the following steps in order to select data from multiple tables:\n1.Open the Query Design window.\n2.Add a table to the Query Design window. If Show Table window is not \ndisplayed, click on Show Table button from the Toolbar. You will have a list of tables in the Show Table Box.\n3.Select a table and click on Add button  to add the table into Query Design \nWindow.\n4. Repeat step 3 to add more tables.\n5.Establish a relationship between the tables by dragging the primarykeyfield\nin the Parent table to the Child Table (See Figure 3.21)."
        },
        {
            "page_number": 76,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 70UNIT-3Database Management  <Unit>-<No><Running Header>\nFigure 3.21 Query Design with Multiple Tables\n6.Select the fields to be displayed in Query Datasheet View. For example, we \nwant to select student name (fname) from student table, subject and grade from grade table, and teacher name (tname) from teacher table.\n7. Choose the Save button from the File menu to save your query.\n8.Enter a file name for the new Query, and click on the OK button.\n9.Click on the View button in the Toolbar to see the query results (see Figure \n3.22).\nFigure 3.22 Query Results from Multiple Tables"
        },
        {
            "page_number": 77,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 71UNIT-3Database Management  <Unit>-<No><Running Header>\nActivity 3.8\n1. Create a query in the student database that lists female students. Save the \nquery as Female_Students. \n2. Create a query that selects data from student and grade table. Display \nonly student name from student table, and subject and grade from grade \ntable. Save the query as Student-Grade. \n3. Create a query that lists students who scored above 85 in all subjects. \nUnit Summary\nIn this unit, you have learnt about:\n•what is meant by Emerging Technologies\n•what is meant by a database\n•file based data management \n•database approach for data management \n•what is meant by database management system (DBMS) software\n•the different benefits of the database approach for data management \n•what is meant by data models\n•the structure of relational data model \n•ERD as a data model representation tool\n•what is meant by entity, attribute, and relationship \n•the different types of relationships between entities\n•implementation of relational database on Microsoft Access\n•creation of Tables in Microsoft Access\n•creation of Query in Microsoft Access\n•selection of data from two or more tables using Microsoft Access Query"
        },
        {
            "page_number": 78,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 72UNIT-3Database Management  <Unit>-<No><Running Header>\nKey Terms\nAttributes are properties of entities that are used to describe the entities.\nData model is a blueprint of the database.\nDatabase is a shared collection of logically related data.DBMS which stands for database management system is a software which is \nused to create and manage databases.Entities arepeople, places, or things about which you want to keep information \nin a database. Entity Relationship Diagram (ERD)  is a visual representation tool for data \nmodels. Field refers to a column of a table in the database table. It is similar to an \nattribute in the logical data model. File based data management is a system of data management based on a \nsingle file. Foreign key is an attribute in a table that matches the primary key of another \nrelated table.\nMicrosoft Access is relational DBMS software. It is used to manage databases.Primary Key is a field which has a unique value for each record in a table.Record is a row in a database table. It stores data about one real-world object \nrepresented in a table. Relational data model is a type of data model that represents data in terms \nof two-dimensional tables called relations.\nRelational database is a type of database that contains a logically related set \nof tables.\nRelationship is an association between entities. \nAttributes"
        },
        {
            "page_number": 79,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 73UNIT-3Database Management  <Unit>-<No><Running Header>\nReview Questions\nPart I: Write True if the statment is correct and  False if  it is incorrect.\n1.A database is a collection of related data. \n2.A database approach improves data sharing. \n3.ERD is a visual representation of data model. \n4.There is only one type of relationship between entities in the ER model. \n5.Attributes are used to describe the characteristics of an entity. \n6.Relational database stores data in one file. \n7.A Primary key is an attribute that has duplicate values for different \nrecords in a table. \n8.Tables are used to store data in Microsoft Access.\nPart II: Choose the correct answer from the given alternatives.\n1._____  is used to store a logically related data.\nA.file B. database\nC. data model D. DBMS \n2.The element of ERD that represents real-world things such as people, places, or events about which we want to store data is called:\nA. attributes B. database\nC. relationship  D. entities \n3.The properties of entities that are used to differentiate one entity from the other entity is called: \nA. attributes B. database\nC. relationship D. entity\n4._____________ is considered as a blueprint of a database. \nA. attributes  B. database \nC. data model      D. entities"
        },
        {
            "page_number": 80,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 74UNIT-3Database Management  <Unit>-<No><Running Header>\n5.In a relational data model, entities are represented as:\nA. attributes B. relations \nC. data models D. databases \n6.____ is a container of database objects in Microsoft Access.  \nA.field B. database \nC. table  D. form  \n7.A field which has a unique value for each record of a table is called:\nA. foreign key B. attribute \nC. data type   D. primary key \n8.One of the following is not a valid data type name for a field ___.\nA. text or string B. number \nC. entity D. date\n9.A Query in Microsoft Access is used to:\nA. store data for future use\nB. select records from the underlying table that meet some search \ncriteria \nC. create a form to facilitate data entry \nD. None\n10.In order to retrieve data from two or  more tables through query, we must \nestablish a _____ between tables\nA. field B. primary key\nC. relationship D. criteria\nPart III: Write short answers to the following questions .\n1.What is a database?\n2.What are the basic elements of ERD? \n3.What is a relational data model?\n4.What is a one-to-many relationship? Give examples. \n5.What is the use of table object in Microsoft Access\n6.What is the use of query in Microsoft Access?"
        },
        {
            "page_number": 81,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 75UNIT-3Database Management  <Unit>-<No><Running Header>\nPart IV: Discussion questions \nAnswer the following case study questions in groups. \n1.XY manufacturing company produces different types of products. The \nproducts are described by: product ID, product name, quantity, and price. The products are sold to different customers. The company also keeps track of its customers’ information as customer ID, customer name, customer address. The customer makes orders to buy products from the company at different times. It is also necessary to keep order information, which includes order ID, product ID, customer ID, order quantity, and order date. Identify the entities, attributes, and relationships for the XY manufacturing company database and construct an ERD for the data model of XY manufacturing company."
        },
        {
            "page_number": 82,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 76Learning Outcomes\nAt the end of this unit, students will be able to:\nDefine the Web\nExplain a website and its benefits\nElaborate the purpose of web design\nDescribe basic concepts of HTML and web development\nCreate webpages with images, videos, links, tables, lists, and links\nUnit Overview\nWeb development is the process of creating websites for various purposes such \nas information sharing and facilitating online businesses. In this unit, the World Wide Web (WWW) and its foundations as well as the concept and uses of websites are discussed. In addition, different types of HTML (Hypertext Markup Language) elements are presented with examples of how they work. \n4.1. World Wide Web\nBrainstorming 4.1\nWhat are the ways of communicating about a product or a service to a target audience?  \nWorld Wide Web (www), commonly known as the Web, is one of the most important services of the Internet. The Internet is a network of networks that the Web runs on. The Web is just one of the services of the Internet, and the most popular one. There are also many other services that are provided over the Internet such as email, file transfer and communication services.4UNIT WEB DEVELOPMENT"
        },
        {
            "page_number": 83,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 77UNIT-4Web Development  <Unit>-<No><Running Header>\nThe Web is a collection of websites or webpages that are accessed over the Internet \nusing a web browser. Tim Berners-Lee invented the Web in 1989 in the famous laboratory found in Switzerland known as CERN. When the Web was invented, it was formed out of four essential foundations: HTML, HTTP, a web server, and a web browser.\nHTML, which stands for HyperText Markup Language, is the language that is used \nto create webpages. A web browser is a software used by users to view webpages. A web server, on the other hand, is a software that stores webpages and responds to user requests that come through web browsers. HTTP, which stands for HyperText Transfer Protocol, is the set of rules that web browsers and web servers use to communicate with each other.  \nLinks\nThe basics of HTML are discussed in detail in Section 4.3\nA website is a publicly accessible collection of interrelated webpages. Hypertext is \nused to link a webpage with other resources like another webpage, videos, images, and the like. \nNowadays, websites are the most efficient and effective ways for organizations or \nindividuals to present themselves to their target audiences. As a globally accessible platform, the web makes it possible for an organization to expand its reach to the entire world. A website that is physically placed in one part of the world can be accessed from any other part of the world. It is also how online transactions are conducted by e-commerce companies. Today, shoppers use websites to make orders of different types of products from their homes or workplaces. This avoids the need to physically go to shops, which reduces the cost of transportation and increases the efficient use of our limited time. Similarly, various government e-services are accessed through websites. For example, citizens do not need to go to the Immigration Nationality & Vital Events Agency office in person to make applications for passports. They can simply go to the website and make their requests online. Education is another example where websites are used to facilitate a lot of activities. For example, the Ethiopian Ministry of Education established a website to make educational resources accessible to students. Online learning has also become widespread in many parts of the world, especially following the \noutbreak of COVID-19."
        },
        {
            "page_number": 84,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 78UNIT-4Web Development  <Unit>-<No><Running Header>\nActivity 4.1\n1. Explain what the Web is and how it is related to the Internet.\n2. List and explain the foundations of the Web.3.Describe some of the benefits of websites. \n4.Discuss among your class mates on how you can benefit from using the \nWeb for educational purposes. \n4.2. Website Design\nWebsite design is concerned with the plan and design of various aspects of a website, \nsuch as layout, navigation, appearance, and graphics.  The goal of a website design is to create a website that is appealing to its target audience. The design should also make the search for information easy by providing a well-organized presentation. \nThe following are some important guidelines to consider when a website is \ndesigned. \nTarget AudienceA website should be designed with the target audience in mind. The look and feel, \npresentation, and all other aspects of the website should take the target audience of the website into consideration. For example, a website that is intended for children in educational settings should have a presentation different from one that is designed for adults in the business environment. \nNavigationWebpages should be logically organized to allow easy navigation. A well-organized \nwebsite with easy navigation helps users find what they seek fast. A website with poor navigation, on the other hand, confuses and drives away visitors."
        },
        {
            "page_number": 85,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 79UNIT-4Web Development  <Unit>-<No><Running Header>\nFigure 4.1 Navigation (Screenshot of part of the website of WHO)\nAs you can see from the way contents are organized on the website of WHO, \nit is easier for visitors to find what they are looking for because of the logical arrangement. \nConsistencyThe feel and look of webpages on a website should be similar. Better user \nexperience is achieved with consistent use of backgrounds, colors, typefaces, and the like throughout the website.  \nSimplicitySimplicity in website design applies to various elements of a website, such as the \nuse of colors, graphics, typefaces, and the like. For example, it is recommended not to overcrowd a page with too many graphics. It is rather more helpful to use graphics when required. It is also recommended to use a maximum of five different colors (plus or minus two) to ensure a better user experience.  \nAccessibilityDesigning a website with everyone in mind including people with disabilities is \nhighly advised to make sure that no one is excluded."
        },
        {
            "page_number": 86,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 80UNIT-4Web Development  <Unit>-<No><Running Header>\nWeb development is the actual creation or building of websites while website \ndesign deals with defining the layout and overall look of the website. Websites can be developed using a WYSIWYG (What you see is what you get) software like Adobe Dreamweaver. Simple text editors such as Notepad are the other alternative software to develop websites. Though developing webpages using simple text editors is a little more difficult than WYSIWYG software, it is more effective in enabling the learner to master the language. \nActivity 4.2\n1. Describe the purpose of website design.\n2. Discuss with your classmates the guidelines for website design.3. Take the website of UN Women (https://www.unwomen.org/ ) and eval-\nuate the website in a group using the guidelines discussed above. Then, \npresent the result of your evaluation including suggestions for areas of improvement for the website. \n4. Design a website layout on paper for your school taking the guidelines \ngiven above into consideration.\n4.3. HTML Basics \nHTML is a markup language that is used to create webpages. The different elements \nof a webpage such as headings, tables, paragraphs, images, and others are defined using the predefined set of markup tags of HTML.  \nHTML has gone through multiple revisions since its invention in 1989. The current \nversion of HTML is HTML5. \nHTML documents can be prepared using simple text editor software such as \nNotepad. The documents are saved with a “.html” extension. For example, home.\nhtml is a valid file name for an HTML document or a webpage. \n4.3.1 HTML Tags and ElementsHTML tags are a set of predefined names enclosed in angle brackets. Each HTML \ntag has its specific meaning, and web browsers are designed to interpret or render HTML tags according to their intended purposes. Sample HTML tags and their meanings are shown in Table 4.1."
        },
        {
            "page_number": 87,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 81UNIT-4Web Development  <Unit>-<No><Running Header>\nTable 4.1 Sample HTML tags\nTag Name Meaning\n<b> Bold\n<p> Paragraph\n<i> Italic\n<h1> Heading\nLinks\nVisit the following webpage for the list of all html tags:\nhttps://www.w3schools.com/tags/default.asp\nHTML elements are components of an HTML document and normally have \na <start tag> followed by content and an </ end tag>. HTML elements are the \nbuilding blocks of a webpage. Figure 4.3 shows some examples of HTML elements and their outputs on the browser.\nHTML Code\n<h1>This is a heading</h1>\n<p>This is a paragraph</p><b>This is a bold text</b><i>This is an italic text</i>\nOutput on the Web Browser\nThis is a heading\nThis is a paragraph\nThis is a bold text This is an italic text\nFigure 4.2 HTML elements\nNotes\nIn Figure 4.3 that while the heading and the paragraph elements are \ndisplayed on a separate line each, the bold and italic texts are displayed next to each other. This is because the browser inserts a new line every time it finds HTML elements like <h1> and <p>, but it doesn’t insert new lines for <b> and <i> HTML elements."
        },
        {
            "page_number": 88,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 82UNIT-4Web Development  <Unit>-<No><Running Header>\nActivity 4.3\n• Write an HTML document that has two paragraphs.\nThough a significant majority of HTML elements conform to the <start tag> \ncontent </end tag> format, there are some HTML elements that have a different \nformat. These HTML elements are known as void elements . The following table \nshows the format of void elements and their meanings. V oid elements do not have an end tag. \nTable 4.2 V oid elements\nHTML element Meaning\n<br> Inserts a new line\n<img> Inserts an image\n<hr> Inserts a horizontal line\nNotes\nNote that the <img> element needs an attribute that indicates the \naddress of the image for the browser to insert the image into the webpage. An example of how to insert an image is given in Section 4.3.3"
        },
        {
            "page_number": 89,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 83UNIT-4Web Development  <Unit>-<No><Running Header>\nHTML Code\n<hr >\n<p>This is a <br> paragraph </p><hr >\nOutput on the Web Browser\nFigure 4.3 Inserting horizontal and new lines\nNotes\nNote that the two horizontal lines placed above and below the \nparagraph are the result of the two <hr > elements. Also, note that the text “paragraph” is shown in a new line because the <br > element is inserted right before it, inside the <p> element. \nActivity 4.4\n• Create a webpage that has three paragraphs enclosed by horizontal lines. \n4.3.2 Structure of HTML Documents\nAll HTML documents or webpages have a common structure. What changes from \none webpage to another is what goes inside the <body> and the <head> sections of HTML documents. Figure 4.2 shows what the structure of HTML documents looks like in HTML5."
        },
        {
            "page_number": 90,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 84UNIT-4Web Development  <Unit>-<No><Running Header>\nFigure 4.4 Structure of an HTML document\nNotes\n<!DOCTYPE html>: this element indicates the type of the document.\n<html> …</html> : represents the entire document, and it is divided \ninto two major sections: the head (<head>..</head>) and the body \n(<body>…</body>) sections.\n<head>..</head>:  this part of the HTML document is used to keep all \nthe information about the webpage such as the page title. \n<body>…</body>: is the part of the HTML document where the content of the webpage is kept. Everything that is shown in the web browser, when the webpage is displayed, is what is contained in this part of the HTML document.\nActivity 4.5\n•Open a webpage from the Internet. Right-click on any area of the webpage \nand click on the “View page source” option. Then, after the complete HTML code is displayed, identify those tags that you are familiar with, and explore more about those that you do not recognize.\n4.3.3 HTML Attributes\nHTML attributes are used to define more properties to HTML elements. HTML paragraphs, for example, are left-aligned by default. However, if a paragraph is"
        },
        {
            "page_number": 91,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 85UNIT-4Web Development  <Unit>-<No><Running Header>\nneeded to be presented with the texts aligned to the right, the “align” attribute \nshould be used. Attributes are written inside the start tag with attribute-value pairs (attribute=value). Figure 4.4 shows how the text of a paragraph is aligned to the right using the “align” attribute. \nHTML Code\n<h1>This is a heading</h1>\n<p align= ”right” > This is a paragraph </p\nOutput on the Web Browser\nThis is a heading\nThis is a paragraph\nFigure 4.5 HTML “align” attribute\nAttributes are normally optional to many of the HTML tags. However, there are \nsome HTML elements that cannot function as intended without the use of some attributes. The <img> HTML element is one such example. The <img> element should have the “src” attribute, which refers to the name and location of the actual \nimage that is required to be inserted into the webpage. See the following example. \nHTML Code\n<img src= ”derartu tulu.jpg ” >\nOutput on the Web Browser\nFigure 4.6 <img> HTML element"
        },
        {
            "page_number": 92,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 86UNIT-4Web Development  <Unit>-<No><Running Header>\nNotes\nNote that the example in Figure 4.6 assumes that the image file and the \nHTML file are located in the same folder.\nActivity 4.6\n1. Write an HTML element that displays a heading with the text right-\naligned. \n2. Write an HTML document that has three images each placed in a \nseparate line.  \nThe other HTML element that uses the “src” attribute is the <video> element. \n<video> element is used to add a video to a webpage as shown in the following example. \nHTML Code\n<video width= ”320” height= ”200” controls    \nsrc=”Country Landscape.mp4 ” >\n</video>\nOutput on the Web Browser\n Figure 4.7 <video> HTML element"
        },
        {
            "page_number": 93,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 87UNIT-4Web Development  <Unit>-<No><Running Header>\nNotes\nThe meaning of the attributes in the <video> element is given as follows:\nThe controls attribute adds controls like play, pause, and volume. Note \nthat no value is assigned to the controls attribute. \nThe width and height  attributes control the width and height of the \nvideo on the webpage depending on the value given.\nThe src  attribute is used to refer to the file name of the video.\nActivity 4.7\n1. Get a short MP4 video and put it inside a folder.\n2. Create an HTML document in the same folder and add a <video> ele-\nment in the HTML document to display the video that you just added to \nthe folder.  \n3.Open the HMTL document and see if the video opens. \n4. Change the values of the height and width attributes and observe the \ndifferences on the webpage. Observe also the change on the video when the controls attribute is removed.   \n4.4. HTML Links \nHTML links are used to navigate from one webpage to another or from one part of a webpage to another. The links could come in the form of text or images and are normally known as hyperlinks. Hyperlinks can easily be distinguished by the \nhand symbol that the mouse cursor is turned to when the mouse is hovering over the hyperlinks.\n4.4.1 Links to other PagesThe anchor tag (<a>) is used to create hyperlinks. An HTML element that is formed \nfrom an anchor tag has the following format:"
        },
        {
            "page_number": 94,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 88UNIT-4Web Development  <Unit>-<No><Running Header>\n<a  href =”URL”> clickable  text </a>\nThis is the anchor tag. \n<a  href =\n<a  href =\n<a  href =\nhref is the attribute \nthat the URL of the \ndestination web-page is assigned to.\nURL\n > clickable  text </a>\nURL stands for Uniform Resource Locator. It is used to reference the address of the linked web-page. \n> clickable  text </a>\n> clickable  text </a>\nThis is the part of the hyperlink that will be visible to the user when the webpage is displayed on the web browser. When this is clicked, the user will be redirected to the given URL.\nFigure 4.8 Format of HTML links \nThe example in Figure 4.9 shows how a link to Google is created and what the \nhyperlink looks like when it is displayed on the web browser. \nHTML Code Output on the\n Web Browser\n<a href= ”http://www.google.com ”>Google</a>   Google\nFigure 4.9 Defining a link to Google \nNotes\nNote that it is only the clickable link that is displayed when the webpage is displayed on the browser. If the user clicks on Google, the user is \nmoved to Google’s webpage. That is because the URL of Google is given as a value to the href attribute. \nAnother important attribute of the anchor tag is the “target” attribute. The value of the “target” attribute determines where the linked document is displayed. See the following table for the meaning of each value of the “target” attribute.  \nTable 4.3 The “target” attribute and its values\nValue Meaning\n_self The webpage is displayed in the same window/tab. (Default)\n_blank The webpage is displayed on a separate window/tab.<a href=”URL”>clickable text</a>\nhref is the attribute that the URL of the destination webpage is assigned to."
        },
        {
            "page_number": 95,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 89UNIT-4Web Development  <Unit>-<No><Running Header>\nActivity 4.8\n1. Using Notepad, create an HTML document that has links to Ethiopian \nAirlines, ethio telecom, and Commercial Bank of Ethiopia using the \nfollowing URLs:\nhttps://www.ethiopianairlines.com\nhttps://www.ethiotelecom.ethttps://www.combanketh.et   \n2. Modify the HTML code you just created above so that the pages are \ndisplayed in a new tab.   \nIn addition to texts, images also can be used as links that users can click on to go \nto a specified webpage. To use images as a link, simply embed the image element inside the anchor tag as shown in Figure 4.10.\nHTML Code Output on the \nWeb Browser\n<a href= ”http://www.google.com ”\ntarget= ”_parent ”>\n    <img src= ”google.png ”>\n</a>\nFigure 4.10 Image HTML link \nNotes\nNote that the image element is placed between <a> and </a>. Also \nnote that a relative URL, as opposed to an absolute URL, is used to reference the “google.png” image. The assumption in the way the URL is given is that the image and the current webpage are found under the same folder.\nAbsolute URL : is a URL that includes every element of a URL such \nas the protocol, the hostname, as well as path of the webpage. In other words, it will have a form such as this:\nhttp://www.somewebsite.com/somefile.html\nRelative URL: is a path given relative to the location of the current webpage. Example: somedirectory/somefile.html"
        },
        {
            "page_number": 96,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 90UNIT-4Web Development  <Unit>-<No><Running Header>\nActivity 4.9\n•Redo the first question of Activity 4.8 using three images as hyperlinks.    \n4.4.2 Links to Page Sections\nHyperlinks can be created not only to establish links to other pages, but also to \ndifferent parts, or sections of the same page. This is especially useful in a webpage that has a large size content. Readers can easily go to different sections of the page without having to scroll up and down. \nTo create such types of links, the <a> tag is used in two different ways: in \ndesignating names to specific locations and in creating links to the locations from other places on the same page. While the “name” attribute is used to designate a name to a location, the “href” attribute is used to create links to the locations. See the following example. \n<h3>Section One\n      <a name= ”section_one ”></a>\n</h3>....<a href=”#section_one ”>Go to section one</a>\nThe HTML element you see at the bottom of the above code creates the Go to \nsection one link. If this link is clicked, the user is moved back to the top of the \nwebpage. (Note that in order to see this effect the webpage should be long enough that the link and the top of the document cannot be seen on one screen.) \nNotes\nNote also that the way the value to the href attribute is given. The value is given as the # symbol followed by the name of the section."
        },
        {
            "page_number": 97,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 91UNIT-4Web Development  <Unit>-<No><Running Header>\nActivity 4.10\n1. Create three HTML documents in the same folder. Then create a link in \neach of the HTML documents to all the others so that one can access all \nthe pages by simply opening only one of them. \n2.Create a webpage that has a content that is grouped into at least three sections and then create:\na. a link at the end of each section to the top of the document.\nb.a link at the beginning of each section to the beginning of all the \nother sections. (Note that the top of the document will be the same as the beginning of section one)   \n4.5. HTML Tables \nAn HTML table is used to organize data in terms of rows and columns. Tables are \none way of organizing contents or defining a layout for contents in a webpage. The major HTML tags used for creating tables and their meanings are presented in the following table. \nTable 4.4 HTML tags used for creating tables\nHTML Tags Meaning\n<table> Used to define the tables\n<th> Used to define table headers\n<tr> Used to define table rows\n<td> Used to define data cells \nThe number of rows of a table is determined by the number of <tr> elements that \nthe <table> has while the number of columns is determined by the number of <td> elements that are found in each <tr>. The example in Figure 4.5 creates a table with 3 columns and 3 rows."
        },
        {
            "page_number": 98,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 92UNIT-4Web Development  <Unit>-<No><Running Header>\nHTML Code\n<table border=1>\n    <tr>         <th>Mountain Name</th>         <th >Elevation</th>    </tr>    <tr>         <td>Ras Dashen</td>         <td>4,620 m</td>    </tr>    <tr>         <td>Tullu Dimtu</td>         <td>4,377 m</td>    </tr>    <tr>         <td>Guge</td>         <td>4,200 m</td>    </tr>    <tr>         <td>Amba Alagi</td>         <td>3,949 m</td>    </tr></table>\nOutput on the Web Browser\nMountain Name Elevation\nRas Dashen 4,620 m\nTullu Dimtu 4,377 mGuge 4,200 m\nAmba Alagi 3,949 m\nFigure 4.11 HTML table"
        },
        {
            "page_number": 99,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 93UNIT-4Web Development  <Unit>-<No><Running Header>\nNotes\nNote the following points from Figure 4.11:\n•\tThe table has a “border” attribute, which is assigned the value 1. \nThis adds a border to the table when displayed on the web browser as shown in the example. If the border attribute is not used, the data will be displayed in the same way but without a border.\n• The information in the table is about some of the mountains found \nin Ethiopia. \nActivity 4.11\n1. Design a table that should look like the following when displayed on the \nweb browser.\ncolumn 1 column 2 column 3 column \n4\n1 2 3 4\n2 4 6 8\n3 6 9 12\n4 8 12 16\n  \n2. Modify the table you designed in the first activity so that the output on \nthe browser will look something like the one shown below. \ncolumn 1 column 2 column 3 column \n4\nrow 1 1 2 3 4\nrow 2 2 4 6 8\nrow 3 3 6 9 12\nrow 4 4 8 12 16\nWhen the layout of the table needs the merging of multiple columns or rows, \n“colspan” and “rowspan” attributes can be used respectively. For example, the HTML code in Figure 4.12 shows how two columns are merged both for the “Cases” and “Deaths” data cells of the table."
        },
        {
            "page_number": 100,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 94UNIT-4Web Development  <Unit>-<No><Running Header>\nHTML Code\n<table border=1>\n  <tr>    <th></th>    <th colspan=2>Cases</th>    <th colspan=2>Deaths</th>  </tr>  <tr>    <th>Date</th>    <th >Total</th>    <th >New</th>    <th >Total</th>    <th >New</th>  </tr>  <tr>    <td>07/29/21</td>    <td>279,629</td>    <td>3,592</td>    <td>4,381</td>    <td>61</td>  </tr></table>\nOutput on the Web Browser\nCases Deaths\nDate Total New Total New\n07/29/21 279,629 3,592 4,381 61\nFigure 4.12 Merging columns in HTML tables"
        },
        {
            "page_number": 101,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 95UNIT-4Web Development  <Unit>-<No><Running Header>\nNotes\nNote the following points from Figure 4.12:\n•\tThe first <th> of the first <tr> does not have data as shown in the \noutput.\n•\tAs the value given to the “colspan” attribute of the second and third <th> of the first <tr> is 2, the “Cases” and “Deaths” columns span the two columns under them.\n•\tThe data shown in the table is adopted from World Health Organization and is about the spread of COVID-19 in Ethiopia.\nThe “colspan” and “rowspan” attributes can also be used to define the layout of an entire page. The following HTML code generates a typical page layout with Header, Sidebar, Content area, as well as Footer using an HTML table as shown in the output of Figure 4.13."
        },
        {
            "page_number": 102,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 96UNIT-4Web Development  <Unit>-<No><Running Header>\nHTML Code\n<!DOCTYPE html>\n<html><head></head><body><table width= ”100%”>\n  <tr>\n<td colspan= ”2” height=”100px” bgcolor= ”#666666 ”>\n  <h1>Website Logo</h1>\n</td>\n  </tr>  <tr>\n<td width= ”20%” bgcolor= ”#cccccc ” height=”300px”>\n  <h3>Sidebar</h3>\n</td><td width= ”80%” bgcolor= ”#eeeeee ”>\n  <h3>Content</h3>\n</td>\n  </tr>  <tr>\n<td colspan= ”2”   bgcolor= ”#777777 ”>\n  Footer\n</td>\n  </tr></table></body></html>\nFigure 4.13(a) HTML code for Page layout using tables"
        },
        {
            "page_number": 103,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 97UNIT-4Web Development  <Unit>-<No><Running Header>\nOutput on the Web Browser\nFigure 4.13(b) Page layout using tables\nNotes\nNote the following points from Figure 4.13(a) and Figure 4.13(b):\n•\tThe “width” attribute is given the value 100% so that the table \noccupies the entire width of the page. \n•\t“px” stands for pixel. \n•\tThe “width” of the first <td> of the second <tr> is assigned 20% so that the “Sidebar” occupies 20% of the width of the table. 80% of the width of the table is occupied by the second <td> of the second <tr>.\n•\t“colspan” attribute is used to merge the top and bottom rows of the table. \nActivity 4.12\n• Create a table that has the following layout:\n•\tThe table should occupy the entire width of the page.\n•\tThe width of each of the first and third data cells of the second row occupies 20% of the width of the table."
        },
        {
            "page_number": 104,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 98UNIT-4Web Development  <Unit>-<No><Running Header>\n4.6. HTML Lists \nHTML lists are used to present different types of lists. The types of lists are known \nas ordered lists, unordered lists, and description lists. \n4.6.1 Ordered List<ol> is the tag that is used to create ordered/numbered lists. The <li> tag, on \nthe other hand, is used to insert individual items into the list. By default, Arabic numerals are used for ordering purposes in ordered lists. However, using the “type” attribute the ordering type can be changed to some other form such as the English alphabet. See Table 4.4 for the list of values that the “type” attribute can be assigned to and their meanings. \nTable 4.5 The “type” attribute and its values for the Ordered List\nValue Meaning\n1 Arabic numeral (Default)\nI Upper-case Roman number\ni Lower-case Roman numeral\nA Upper-case English alphabet\na Lower-case English alphabet\nThe HTML code in Figure 4.15 shows an example of an ordered list, and what the \noutput on the web browser looks like. (The data refers to the top 10 causes of death in Ethiopia. Source: World Health Organization 2018)"
        },
        {
            "page_number": 105,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 99UNIT-4Web Development  <Unit>-<No><Running Header>\nHTML Cod e Output on the Web Browser\n<ol>\n<li>Coronary heart disease</li><li>Influenza and pneumonia</li><li>Diarrheal diseases</li><li>Stroke</li><li>Tuberculosis</li><li>Road traffic accidents</li><li>Liver disease</li><li>Diabetes mellitus</li><li>HIV/AIDS</li><li>Breast cancer</li></ol>1. Coronary heart disease\n2.Influenza and pneumo -\nnia\n3. Diarrheal diseases4. Stroke5. Tuberculosis6.Road traffic accidents\n7. Liver disease8. Diabetes mellitus9. HIV/AIDS10.Breast cancer\nFigure 4.15 HTML Ordered List\nActivity 4.13\n1.Create an ordered list of the full names of your friends. \n4.6.2 Unordered List\n<ul> is the tag that is used to create unordered/bulleted lists. The <li> tag and the \n“type” attribute are used similarly as they are used in ordered lists. The default bullet type is “disc”. The “type” attribute is, therefore, used to change the default type to any of the other types. See Table 4.5 for the list of values that the “type” attribute can be assigned to and their meanings in unordered lists."
        },
        {
            "page_number": 106,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 100UNIT-4Web Development  <Unit>-<No><Running Header>\nTable 4.6 The “type” attribute and its values for Unordered List\nValue Meaning\nDisc  (Default)\nsquare \ncircle \nNotes\nAs stated in Table 4.6, the default bullet type for unordered lists is \n“disc”. In the example shown in Figure 4.9, however, the output shows the list using the “circle” bullet type. That is because the type is explicitly changed in the list as shown in the code.  \nHTML Code Output on the Web \nBrowser\n<ul type= ”circle”>\n   <li>Save energy</li>\n   <li>Plant trees</li>   <li>Reduce water waste</li>   <li>Avoid plastic wherever \npossible</li>\n</ul>oSave energy\noPlant trees\noReduce water \nwaste\noAvoid plastic wherever possible\nFigure 4.16 The “type” attribute in Unordered Lists\nActivity 4.14\n•By changing the value of the “type” attribute, design different types of ordered and unordered lists."
        },
        {
            "page_number": 107,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 101UNIT-4Web Development  <Unit>-<No><Running Header>\nLists can be nested. Any type of list can be placed under any other type of list. The \nfollowing example in Figure 4.17 shows how an ordered list can be nested inside an unordered list. \nHTML Code Output on the Web \nBrowser\n<ul>\n   <li>Actions one can do to stop \nclimate change\n       <ol>                    <li>Save energy</li>          <li>Plant trees</li>          <li>Reduce water              waste</li>          <li>Avoid plastic              wherever possible</li>      </ol>   </li></ul>•\tActions one can \ndo to stop climate change\n1. Save energy\n2. Plant trees3. Reduce water \nwaste\n4. Avoid plastic \nwherever pos-\nsible\nFigure 4.17 Nested lists\nNotes\nIn the HTML code of Figure 4.17, observe where the <li> of the <ul>  \nbegins and ends. As you can see, the <ol> is embedded inside the <li> of the outer <ul>."
        },
        {
            "page_number": 108,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 102UNIT-4Web Development  <Unit>-<No><Running Header>\nActivity 4.15\n• Create the following list. \n•\tFruits:\noOrange\noBanana\noPineapple\n•\tVegetables:\noCarrot\noCabbage\noOnion\n4.6.3 Description List\nIn a description list, the <dl> tag is used to define the whole description. The <dt> \ntag, on the other hand, is used to add the item that is to be described or defined. The description or definition is added using the <dd> tag. See the example given in Figure 4.18 to learn how the three tags are used together. \nHTML Code Output on the Web Browser\n<dl>\n  <dt>ol</dt>  <dd>-Ordered list</dd>  <dt>ul</dt>  <dd>-Unordered list</dd>  <dt>dl</dt>  <dd>-Description list</dd></dl>Ol\n-Ordered list\nul\n-Unordered list\ndl\n-Description list\nFigure 4.18 HTML Description List\nActivity 4.16\n•Create a description list for the dictionary definition of three of your \nfavorite English words."
        },
        {
            "page_number": 109,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 103UNIT-4Web Development  <Unit>-<No><Running Header>\nUnit Summary\nIn this unit, you have learnt about:\n•what the Web is and its relationship with the Internet\n•foundations of the Web, such as HTTP, HTML, web browser, and web \nserver\n•what is meant by a website and its uses\n•what is meant by website design\n•some guidelines for website design\n•the difference between website design and website development\n•what HTML is and the structure of an HTML document\n•HTML tags and HTML elements and their differences\n•how to insert basic elements like images, videos, paragraphs, headings, and the like on webpages\n•HTML attributes and how they are used to control the properties of HTML elements\n•how hyperlinks are created using the anchor tag (<a>)\n•how to use images as a hyperlink\n•the difference between absolute and relative URL \n•how links are created to different parts of the same page using the anchor tag (<a>)\n•how HTML tables are created to define the structure of data as well as the layout of webpages\n•the three types of lists namely, ordered lists (<ol>), unordered lists (<ul>), and description lists (<dl>)\n•how lists can be nested and how one type of list is embedded under another type"
        },
        {
            "page_number": 110,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 104UNIT-4Web Development  <Unit>-<No><Running Header>\nKey Terms\nAbsolute URL is a URL that includes every element of a URL such as the \nprotocol, the hostname, as well as path of the webpage\nDescription lists <dl> are used to create description/definition listsHTML attributes are used to define more properties to HTML elementsHTML elements are components of HTML documents that normally begin \nwith a start tag and end with an end tag\nHTML tags are a set of predefined names enclosed in angle bracketsHTML is a language that is used to develop webpagesHTTP is a protocol that browser software and web server software used to \ncommunicate with each otherHypertext is a link that connects webpagesOrdered Lists <ol> are used to create ordered/numbered listsRelative URL is a path given relative to the location of the current webpageThe Web is one of the popular services of the Internet\nUniform Resource Locator (URL) refers to the address of web resourcesUnordered Lists <ul> are used to create bulleted listsVoid elements are HTML elements that do not have end tagsWeb Browser is a software that is used to view webpages\nWeb Server is a software that is used to manage websites\nWebpage is a web document that can store text, images, videos, and the like\nWebsite is a collection of interrelated webpages\nAbsolute"
        },
        {
            "page_number": 111,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 105UNIT-4Web Development  <Unit>-<No><Running Header>\nReview Questions\nPart I: Write True if the statment is correct and  False if  it is incorrect.\n1.The Web and the Internet are the same things. \n2.The <head> and the <body> sections are the two major sections of HTML \ndocuments. \n3.“rowspan” is the attribute that is used to merge rows of a table.\n4.“circle” is a valid value to the “type” attribute in ordered lists. \n5.It is only texts that can be used as hyperlinks.\nPart II: Match the items given under column B with associated items in \ncolumn A\nA B\n1.Internet service \n2.Section of an HTML document where \nactual content goes\n3.User or Client-side web software \n4.An HTML element used to create headings\n5.Address of webpagesa. Web Browser \nb.The Web \nc. <body> d. <h1> e. <dd> f. URL g. HTTPh. .html i. Internet\nPart III: Choose the correct answer from the given alternatives.\n1.Which of the following is the language used to develop webpages?\nA. HTML B. HTTP\nC. Web server D. Web browser \n2.The building blocks of webpages are ____________.\nA. HTML tags B. HTML elements\nC. Images  D. Headings"
        },
        {
            "page_number": 112,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 106UNIT-4Web Development  <Unit>-<No><Running Header>\n3.Which of the following is an example of void HTML elements?\nA. <h1> B. <p>\nC. <img> D. <b>\n4.Which of the following is used to define additional properties to HTML\nelements?\nA. HTML tags.  B. HTML attributes. \nC. HTML documents.   D. URL  \n5.Which of the following is used to define a header for HTML tables?\nA. <tr> B. <td> \nC. <th> D. “colspan” attribute \n  \nPart IV: Fill in the blank spaces\n1.A protocol that a web server and a web browser use to communicate with each other is __________.\n2.The extension used for file names in HTML documents is ________.\n3.A type of URL that doesn’t contain information such as web protocol is called ______________.\n4.The attribute of <a> that is used to give names to sections of a webpage is __________________.\n5.A tag that is used to create horizontal line is __________________"
        },
        {
            "page_number": 113,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 107UNIT-4Web Development  <Unit>-<No><Running Header>\nPart V: Code Writing \n1.The following data is about life expectancy in Ethiopia between 1960 and \n2016. (Source: World Health Organization). Create an HTML table that displays the data as shown below. \nYear Male Female All\n1960 37.3 40.2 38.7\n1970 41.5 44.5 43.0\n1980 43.3 46.3 44.8\n1990 46.1 49.1 47.5\n2000 49.3 53.1 51.2\n2010 60.1 63.6 61.8\n2016 63.7 67.3 65.5\n2.Create an Ordered List of the subjects you are currently taking in the order of your preference.\n3.Create the following list:\n1. Famous Ethiopian female athletes:\n\tDerartu Tulu\n\tTirunesh Dibaba\n\tMeseret Defar\n2. Famous Ethiopian male athletes:\n\tAbebe Bikila\n\tHaile Gebrselassie\n\tKenenisa Bekele"
        },
        {
            "page_number": 114,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 108UNIT-4Web Development  <Unit>-<No><Running Header>\n4.Create the layout of a page using an HTML table according to the \nexample shown below. The table has the following features:\n•\tThe “width” attribute of the table is assigned to the value \n”100%”so that the table occupies the entire width of the page. \n•\tThe “bgcolor” attribute of the data cell of the first row has the value ”#999999”.  \n•\tThe “bgcolor” attribute of the first data cell of the second row has the value ”#dddddd”, and its “width” attribute is assigned to the value ”25%”. This data cell also has hyperlinks to the three organizations shown in the example. Moreover, the content should be aligned to the top using the “valign” attribute. \n•\tThe “bgcolor” attribute of the second data cell of the second row has the value ”#eeeeee ”, and its “height” attribute has the \nvalue ”200”. The content should be aligned to the top using the \n“valign” attribute using the value ”top”.\n•\tThe data cell of the last row has the same background as the first one and, its text is center-aligned.\nThis is My Page Title\nLinks\nEthiopian Air LinesEthio telecomCBEMy Contents \nCopyright © 2021 Yourname.com"
        },
        {
            "page_number": 115,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 109Learning Outcomes\nAt the end of this unit, students will be able to:\nExplain maintenance procedures and troubleshooting\nState hardware problems\nDescribe hardware preventive maintenance\nPerform basic hardware troubleshooting & preventive maintenance\nRecognize the value of hardware troubleshooting to keep computer \nsafety  \nUnit Overview\nComputers must be protected from any kind of threat that causes the computer to malfunction. Computer users should have some basic knowledge of troubleshooting and solving hardware-related problems. This unit covers hardware troubleshooting and preventive maintenance.  \n5.1. Hardware Troubleshooting \nBrainstorming 5.1\nWhat do you know about computer hardware troubleshooting and maintenance?\nHardware troubleshooting is a systematic approach to locating the cause of a fault in a computer system and solving technical problems. It starts with general issues and then gets more specific.5UNITHARDWARE \nTROUBLESHOOTING \nAND PREVENTIVE \nMAINTENANCE"
        },
        {
            "page_number": 116,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 110UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\n5.1.1 Hardware Troubleshooting Procedures \nHardware troubleshooting is the process of reviewing, diagnosing, and identifying \noperational or technical problems within a hardware device or equipment. It aims to resolve physical and/or logical problems and issues within computing hardware. On the other hand, software troubleshooting  is the process of scanning, identifying, \ndiagnosing, and resolving problems, errors, and bugs in software. \nComputers can malfunction and get damaged if computer users are not aware of \nsome of the basic procedures for checking hardware problems. Many computer \nproblems can be solved by checking the following simple hardware problems: \n•\tCheck that your computer is plugged into a working power outlet.\n•\tCheck that everything is turned on.\n•\tIf the computer is on but the screen is blank, there may be an issue with the \nconnection between the computer and the screen. First, check to see if the monitor is plugged into a power outlet and if the connection between the monitor and computer system unit is connected securely. \n•\tCheck that the keyboard, mouse, monitor, speakers, etc. are properly plugged into the computer system. Try a different port to check if it is a port issue, or change the device if the device is damaged. \nNotes\nIt is necessary to switch off the computer before undertaking any \nhardware maintenance such as removing or replacing computer parts. \n5.1.2 Check POST\nPOST stands for Power On Self-Test . This is part of a computer’s startup program \nthat is used to diagnose the keyboard, the Random Access Memory (RAM), disk \ndrives, and other hardware to make sure they are working properly. If the POST detects any errors in the hardware, it either displays a text error message on the screen or emits a series of short and long beeps.\nIf an error message appears as you boot your computer, type the exact error message \nand then search on the Internet to find more information about the error."
        },
        {
            "page_number": 117,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 111UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nActivity 5.1\n1.If your computer cannot start, what are the preliminary hardware diag -\nnoses you do to identify and fix the problems? \n5.1.3 Beep Codes\nBeep codes are sounds emitted by the computer during Power on Self-Test (POST). \nEach BIOS manufacturer has a unique beep sequence, a combination of long and short beeps, for hardware failures. If there is a problem with the computer, listen for the beep codes when the computer starts. As the system proceeds through the \nPower on Self-Test (POST), most computers emit one beep to indicate that the system is booting properly. If there is an error, you might hear multiple beeps. You need to document the beep code sequence and search on the Internet to determine the specific problem. Some of the beep codes and the respective problems are as follows: \n•\tNo beep but the system turns on and runs fine - Under  normal \ncircumstances, most computer systems will beep one short beep when turned on. If your computer doesn’t produce a beep sound, your “beeper” may have died out.\n•\tNo beep - The power supply is not plugged in or turned on. If not, the power \nsupply is completely dead.\n•\tSteady, short beeps - The power supply may be bad or the voltages might \nbe wrong. A replacement would usually be necessary.\n•\tSteady, long beeps - The power supply has gone bad.\n•\tLong, continuous beep - Your Random Access Memory (RAM) sticks may \nhave gone bad. If there is more than one stick installed, try taking one out to see if the computer boots. If it does not, try the same thing with the other stick. This will tell you which stick has gone bad, and you can replace or upgrade accordingly. If there is only one stick installed, you will need to replace or upgrade it to fix the problem."
        },
        {
            "page_number": 118,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 112UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\n•\tOne long, two short beeps - There has been a video card failure. Your first \naction is to try reseating the video card. This often solves the problem when \nthe computer system is connected to projectors because the VGA/DVI or Video cable gets moved so often that the card can be slowly unplugged. If reseating doesn’t work, replace the video card.\n5.1.4 BIOS Information\nBIOS stands for basic input/output system. BIOS is a program used by a computer \nto start the computer system after it is powered on. It also manages data flow \nbetween the computer’s operating system (OS) and attached devices, such as the hard disk, video adapter, keyboard, mouse, and printer. If the computer boots and stops after the POST, your computer has a BIOS setting problem. Fixing BIOS problems requires a good knowledge of computer hardware. Therefore, when you face a BIOS setting problem, you are advised to contact a computer hardware technician to solve the problem. \n5.1.5 CMOS ErrorTheCMOS (Complementary Metal-Oxide Semiconductor) is an onboard chip that \nstores information ranging from the time and date to system hardware settings; \nits primary function is to handle and store the BIOS configuration settings. If a \ncomputer shows a CMOS alert message on the screen, it indicates that the CMOS battery needs to be replaced. Upon receiving such type of error message, remove \nthe CMOS battery carefully, and insert a new battery that is exactly the same as the old one. \nNotes\nReplacing a CMOS battery may be more difficult in laptop computers \nthan in desktop computers. If the user of the computer does not have sufficient computer hardware troubleshooting experience, leaving the task to a professional computer technician is advised. \n5.1.6 Event Viewer\nWhen system or application errors occur on a computer running Windows, the \nEvent Viewer is updated with information about the errors. The Event Viewer, \nshown in Figure 5.1, records the following information about the problem:"
        },
        {
            "page_number": 119,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 113UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\n•\tThe problem that occurred\n•\tThe date and time of the problem\n•\tThe severity of the problem\n•\tThe source of the problem\n•\tThe event ID number\n•\tWhich user was logged in when the problem occurred\nThe following steps can be followed to launch the Event Viewer:\n1.On the Windows Search box, write event viewer \n2. A pop-up menu appears which looks like the one shown in Figure 5.1\n3. Click on Event Viewer  \nFigure. 5.1 Launching Event Viewer\nEvents are placed in different categories as shown on the left side of Figure 5.2. \nExpand each category to get more information. Each category is related to a log that Windows keeps on events regarding that particular category. While there are a lot of categories, the vast amount of troubleshooting you might want to do is related to the Windows Log category, which contains the following items:\n•\tApplication: The Application log records events related to Windows system \ncomponents, such as drivers and built-in interface elements.\n•\tSystem: The System log records events related to programs installed on the \nsystem."
        },
        {
            "page_number": 120,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 114UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\n•\tSecurity: When security logging is enabled (it is off by default in Windows), \nthis log records events related to security, such as logon attempts and resource \naccess.\nFigure 5.2 Event Viewer\nWhen you click on Application under Windows log, you get a list of Application \nlog records events.\nIf you want to get detailed information about the error, double-click on the error, \nand then you get detailed information in the pop-up window. Although the Event Viewer lists details about an error, you might need to do further searching on the Internet about the problem to identify an appropriate solution . \n5.1.7 Hardware Problems \nMany computer problems are caused by hardware failures or problems with \nhardware drivers. Windows usually displays notifications about devices that have a problem. Device Manager is used to check the status of different hardware devices. The following steps can be followed to identify hardware problems in Windows-based systems:\n1. Click on the Windows search box in the lower-left corner.\n2. Type Control Panel.\n3. Double-click the Control Panel on the Windows pop-up menu."
        },
        {
            "page_number": 121,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 115UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\n4. Click Hardware and Sound .\n5. Under Device and Printers, Click on Device Manager (see Figure 5.3)\nFigure 5.3 Windows Control Panel\nThe Device Manager has the following four benefits. \n1.It works as a centralized utility from which all the hardware on a system \ncan be configured.\n2.It provides a central and organized view of all hardware- Microsoft Windows-recognized hardware- installed on a system.\n3.It helps to manage all the hardware devices installed on a system. This includes keyboards, hard disk drives, USB devices, etc.\n4.It helps to change hardware configuration options, manage drivers, enable or disable hardware, identify conflicts between hardware devices, etc.\nWhen you click on the Device Manager on the Control Panel as shown in Figure \n5.3, the Device Manager window is displayed (see Figure 5.4). The devices that have a problem would have an error icon displayed right next to the name of the device. The operating system flags the devices with an error icon. \n•\tA yellow triangle with an exclamation mark indicates that the device has \na problem. \n•\tA red X means that the device is disabled or removed or Windows can’t \nlocate the device. \n•\tA downward-pointing arrow means the device has been disabled."
        },
        {
            "page_number": 122,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 116UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\n•\tA yellow question mark indicates that the system does not know which \ndriver to install for the hardware. This problem will be solved by installing \nthe appropriate driver software for the device \nFigure 5.4 Device Manager\nActivity 5.2\n1.Open the Device Manager and check if there is any problem on your DVD/CD-ROM drives.\n2.If you find a yellow triangle with an exclamation mark on one of your \nhardware devices, what will you do to solve the problem? \n5.1.8 Diagnostic Tools\nDiagnostic Tools are software tools that are used to help troubleshoot, diagnose \nand solve hardware problems. Manufacturers of system hardware usually provide diagnostic tools of their own. For instance, a hard drive manufacturer might provide a tool to boot the computer and diagnose why the hard drive does not start the operating system.\nThe top two diagnostic tools are Windows Performance Monitor and Windows \nResource Monitor. \na) Windows Performance Monitor \nThe performance monitor gives a quick view of vital information about computer \nhardware. The computer’s CPU, Memory, Disk, and Ethernet information can be checked from there. Performance Monitor is used to examine the effects of running applications in both real-time and by collecting data to check out for later analysis (See Figure 5.5)."
        },
        {
            "page_number": 123,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 117UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nFor example, to view the Performance Monitor, the following steps can be followed: \n1. Press CTRL + ALT + Delete button at the same time. \n2. Choose Task Manager, and the window shows that appears in Figure 5.5.r3.Then click on the Performance tab to see the performance of the CPU and \nother devices in the computer.\nFigure 5.5 Task Manager\nNotes\nOne quick way of reducing the load from the CPU in Windows is \nto restart the computer to remove any unwanted temporary files. Make sure that all files are saved before proceeding with this step.\nThe other option is to look for the applications that are using maximum \nCPU resources on the Task Manager. If any application shows CPU \nusage of almost 100%, disable the application and then start it again.\nActivity 5.3\n•Open Task Manager and see if any applications are using excessively large amounts of the computer’s CPU or memory, and if there are any, disable them."
        },
        {
            "page_number": 124,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 118UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nb) Windows Resource Monitor\nWindows Resource Monitor is better suited for tracking CPU, Network, Memory, \nand Disk usage. This tool allows to take an in-depth look into which processes are affecting the CPU, how much memory is being used, the disk activities, and the network information such as current TCP (Transport Control Protocol) connections, and which processes are listening on which port.\nThe following steps can be followed to open the Windows Resource Monitor: \n1.On the Windows search box, write Resource Monitor \n2.Click on the Resource Monitor, and then the window shows what appears \nin Figure 5.6. \nFigure 5.6 Windows Resource Monitor \nClicking on the CPU tab in the Windows Resource Monitor lists the four sections \nnamely, Processes, Services, Associated Handles, and Associated Modules. The processes that are running are shown in black color under the Processes section, and those that are suspended are shown in blue color while the processes that are not responding are shown in red color. Upon selection of a specific running process from the Processes section the related data under the Services, Associated Handles, and Associated Modules get populated."
        },
        {
            "page_number": 125,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 119UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nIf you find your computer slowing down unexpectedly, take a look at the CPU \ncolumn. If an application is taking up a lot of CPU resources, shut down the \napplication and restart it. \nTo stop the application \n1.Open resource monitor window \n2. Right-click on the application \n3. Click on End process \nIf you want to know more about an application, you can follow the following steps \nin the Resource Monitor window:\n1. Right-click on the name of the application \n2. Choose Search online\nThis opens your default browser displaying the search result of the application on \nthe default search engine of your browser. Click on the application links and learn more about the application. \nActivity 5.4\n1.What do you understand by hardware troubleshooting?\n2. If your computer is slow, what will be the possible problem and what \ncourse of action can you take to solve it?"
        },
        {
            "page_number": 126,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 120UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\n5.2. Basics of Preventive Maintenance\nBrainstorming 5.2\nReflect on any preventive maintenance methods you are aware of.\nPreventive maintenance is the practice of routinely taking measures in hardware \nadministration that reduces the risk of hardware failures. It also improves the likelihood of quick recovery in the event that a failure does occur. Maintenance activities include performing diagnoses on different hardware components such \nas circuit boards and memory and replacing any components that show signs of excess wear. It also includes keeping hardware components clean from dust to reduce the likelihood of overheating and hardware failures. \n5.2.1 Preventive maintenance for Dust \nThere are various ways of cleaning dust off the computer. Some examples of \npreventive maintenance against dust such as Cloth, chemical cleaners, and vacuum cleaners are presented below. \n1) Cloth\nThe outside of the computer case can be cleaned using a soft cotton cloth. Special cleaning cloth like microfiber cloth is effective in removing dust without damaging screens (See Figure 5.7). M icrofiber cloth is made from a high-quality material that \nabsorbs and removes all fingerprints, smudges, oils, and dust from the screen. Use of this material as a first step before applying any liquid sanitizing wipe or screen cleaner is recommended.   \nFigure. 5.7 Microfiber Cleaning Cloth"
        },
        {
            "page_number": 127,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 121UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\n2) Chemical cleaner\nThere are different chemical cleaners in the market which can be used to clean \ncomputer screens. Alcohol-Free Sprays such as Koala Cleaner are safe for all kinds of screens. It can be used on all screens from tablets to laptops. \n3) Vacuum Cleaner\nDust on the outside of a computer can travel through cooling fans to the inside part of the computer. Accumulated dust prevents the flow of air and reduces the cooling of components. Hot computer components are more likely to break down. Using a combination of compressed air, a low-air-flow vacuum cleaner, and a small lint-free cloth, dust can be removed from the inside of a computer. It is good to make it a regular habit like monthly to clean computers’ air ventilators, connection ports, and keyboards with a vacuum cleaner. \n5.2.2 Run antivirus\nAcomputer virus is a type of computer program that(when executed) replicates \nitself by modifying other computer programs and inserting its own code. Computers \nmay be infected with viruses when they are connected to the Internet or when \nsomeone else’s flash disk is inserted into a computer system. Virus infection is not detected until it creates a problem on the computer. \nAntivirus, which is also known as anti-malware, is a computer program used to \nprevent, detect and remove malware . There are freeware and commercial antivirus \nsoftware. The freeware antivirus software can be freely downloaded and used. Some \nexamples of free antivirus software are A V AST, A VG, A VIRA, and Bitdefender. \nIn order to install antivirus software: \n1. Search the antivirus software, for example, on Google  \n2.Then click on the search result on the name of the Antivirus software you \nwant to download (see Figure 5.8)\n3.You can directly install from the Internet or save the antivirus software on your hard disk"
        },
        {
            "page_number": 128,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 122UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\n4.If it is saved on the hard disk, install the antivirus software in the same way \nyou install other types of application software by starting the setup file. \nFigure 5.8 Installing Antivirus Software \nIt is important to run the antivirus program on a regular basis to make sure any \nchanges made, or files that are downloaded have not compromised the system. Additionally, running the antivirus program because some malicious programs embed into systems without warning and require specific actions to trigger. Scanning computer systems regularly with antivirus software help prevent the computer system from virus infection.\nActivity 5.5\n1. Discuss the problems you will face if you do not have installed antivirus \nsoftware on your computer.  \n2.Reflect on computer problems that will be caused by dust. \n5.2.3 Backups\nBackup is a process of transferring data or files from a computer system to external \nstorage devices. The backup file is used to recover data loss during computer failure. Computer users should have at least one method for backing up users data, whether it is on a cloud storage server or an external hard drive (see Figure 5.9). It is necessary to take time to update the backups as frequently as needed. If up-to-date backups are available, computer users will not have to worry about losing a day’s work in the event a PC is unexpectedly crashed."
        },
        {
            "page_number": 129,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 123UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nFigure 5.9 Data backup\nNotes\nBackup is the first step before any troubleshooting on a computer \nsystem is done. If a backup has not been taken, do not take any troubleshooting activity. Before undertaking any troubleshooting,  it is recommended to check with the computer user about the date of the last backup, contents of the backup, data integrity of the backup, and availability of all backup media for data restore.\nThe following steps can be followed to take a backup on a Windows-based computer: \n1.Open the Control Panel\n2. Choose Backup and Restore\n3. Choose Set up back-up4. The window will be displayed as shown in Figure 5.10. \nFigure 5.10 Disk Backup Window\n5. Click on Create a system image,"
        },
        {
            "page_number": 130,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 124UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\n6.Select the storage drive either a hard disk, DVD disk, or a Network drive \nwhere you intend to store your backup. \n7. Then click on the next button, and \n8. Finally click on the start backup button \nNotes\nYou can alternatively write backup on the Windows search box at the \nlower left corner, and then select backup settings to open the backup \nwindow.\n5.2.4 Scan Hard Disk  \nWhen old files are deleted from the hard disk and new files are saved, the files \nbecome fragmented. Fragmentation is the scattering of portions of files in the disk \nin nonadjacent areas, thus greatly slowing access to the files.\nWhen a hard disk is new, the operating system puts files on the disk contiguously \n(next to one another). However, when a file is updated over time, new data for that file is distributed to unused spaces. These spaces may not be contiguous to the \nolder data in that file. It, therefore, takes the operating system longer to read these fragmented files. \nA defragmenter utility program, commonly called a “defragger,” finds all the \nscattered files on the hard disk and reorganizes  them into the smallest number of \nadjoining regions (See Figure. 5.11). In other words, defragmentation is a process \nthat reduces the degree of fragmentation. This increases the computer’s speed.                            \nFigure 5.11 Disk Defragmentation"
        },
        {
            "page_number": 131,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 125UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nThe following steps can be followed to undertake disk defragmentation: \n1. Type Windows Administrative Tools on the Windows search box and click \non Windows Administrative Tools. \n2.Double-click on Defragment and Optimize Drives.\n3. Then the window shown in Figure 5.12 will be displayed.\n4.Select the drive, and then click on the Optimize button. \nFigure 5.12 Disk Optimization Window   \nNotes\nAs shown in Figure 5.12, if the drive’ s current status says (0% \nfragmented), there is no need to do defragmentation. \n5.2.5 Power Protection Devices\nElectric power causes many problems on computer hardware components. The \nfollowing tools are used as a means to prevent potential damages that can be caused \nby electric powers. \n1)Use a surge protector to protect against too much electricity : Plug \nall your hardware into a surge protector (suppressor), which will prevent damage to your equipment if there is a power surge (See Figure 5.13). \n2)Use a stabilizer to ensure the level of voltage being supplied at a desired level: Plug your computer into a stabilizer (See Figure 5.13) to adjust"
        },
        {
            "page_number": 132,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 126UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nfor power variations, which will deliver a consistent voltage level to the \nequipment. Power fluctuations can cause damage to electrical motors and components. This damage could be severe and immediate. It may result in a shorter operating lifespan.\nFigure 5.13 Power surge protectors\n3)Use a voltage regulator to protect against too little electricity : Plug your \ncomputer into a voltage regulator (also called a line conditioner) to adjust for power sags or brownouts (see Figure 5.14).\nFigure 5.14 Power voltage regulator\n4)Consider using a UPS to protect against the complete absence of electricity : Consider plugging your computer into a UPS (Uninterruptible \nPower Supply). The UPS is kind of a short-term battery that (when the power fails) will keep your computer running long enough (5–30 minutes) for you to save your data before you turn off the computer (See Figure 5.15). It also acts as a surge protector."
        },
        {
            "page_number": 133,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 127UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nFigure 5.15 UPS power surge \n5.2.6 Shut Down Properly\nAt the end, make sure you save your work before closing all your programs and \nshutting down your PC. Leaving your PC turned on when it is not used prevents it from cooling, and can impact the machine’s performance. If shutting down interferes  with your daily routine or business requirements, put your computer into \na low-power or hibernation mode instead.\nActivity 5.6\n1.Discuss the purpose of taking backups of your computer files.\n2.Reflect on the effect of disk fragmentation on your computer."
        },
        {
            "page_number": 134,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 128UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nUnit Summary\nIn this unit, you have learnt about:\n•what is meant by hardware troubleshooting and preventive maintenance \n•messages of POST, which stands for Power On Self-Test\n•beep code sounds as alert message for hardware failures \n•what is meant by CMOS alert message\n•how to identify system or application errors through event viewer \nwindow \n•how to identify and troubleshoot hardware problems through device manager \n•how to use Diagnostic Tools to diagnose and troubleshoot hardware problems\n•how to use Windows Resource Monitor to track CPU, Network, Memory and Disk usage\n•the different hardware prevention mechanisms \n•how to clean a computer from dust. \n•what is meant by Virus and Antivirus software\n•how to protect a computer from virus.\n•how to undertake system data backup. \n•what is meant by disk fragmentation and defragmentation\n•mechanisms for protecting computers from power problems"
        },
        {
            "page_number": 135,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 129UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nKey Terms\nAntivirus is computer software that is used to clean viruses from a computer \nsystem. \nBackup is a process of transferring data or files from a computer system to \nexternal storage devices so as to recover data lost during a computer failure. Beep  codes are sounds emitted by the computer during Power on Self-Test \n(POST).BIOS is a program used by a computer to start the computer system after it \nis powered on.The CMOS (Complementary Metal-Oxide Semiconductor) is an onboard \nchip that stores information ranging from time and date to system hardware \nsettings.\nDiagnostic Tools are software tools that are used to help diagnose and solve \nhardware problems.Power On Self-Test (POST) is part of a computer’s startup program that is \nused to diagnose the keyboard, the Random Access Memory (RAM), disk \ndrives, and other hardware to make sure they are working properly.\nPreventive maintenance is a regular and systematic inspection, cleaning, \nand replacement of worn parts, materials, and systems that ensure computer hardware have long and productive life. \nTroubleshooting is a systematic approach to locating the cause of a fault in a \ncomputer system and solving technical problems. It starts with general issues \nand then gets more specific.\nVirus is a type of computer program that (when executed) replicates itself by \nmodifying other computer programs and inserting its own code.\nAntivirus"
        },
        {
            "page_number": 136,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 130UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nReview Questions\nPart I: Write True if the statment is correct and  False if  it is incorrect.\n1.Preventive maintenance is a regular and systematic inspection, cleaning, \nand replacement of worn parts of the computer to ensure smooth operation of the organization \n2.Troubleshooting is a systematic approach to identify and solve hardware problems. \n3.Cleaning dusts off from the inside and outside parts of a computer system may lead to hardware problems.\n4.Beep codes are used to identify software problems on a computer system.  \n5.Diagnostic Tools are software tools that are used to diagnose hardware failures.\n6.Antivirus is software that is used to prevent, detect and remove malware.\n7.Backup is used to clear viruses from a computer system. \n8.Disk fragmentation reduces the speed of a computer. \n9.A surge protector is used to protect a computer against too little electricity. \n10.When a computer is not used, shutting down computers is useful for a longer life of hardware components.\nPart II: Fill the blank spaces\n1.________ sounds indicate a hardware problem on a computer system. \n2.________ are software tools that are used to help troubleshoot, diagnose and solve hardware problems.\n3.A data protection mechanism through copying data from a computer system to external storage devices is known as ___________________. \n4.A type of software that is used to clean virus from a computer system is called ________________.\n5.A regular and systematic inspection, cleaning, and replacement of worn hardware components is called _______________."
        },
        {
            "page_number": 137,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 131UNIT-5Hardware Troubleshooting and Preventive Maintenance  <Unit>-<No><Running Header>\nPart III: Give short answers to the following questions \n1.What is hardware troubleshooting?\n2.What is a software tool that is used to check the status of different \nhardware devices?\n3.What are the different hardware preventive maintenance methods?\n4.What are the software tools used to monitor the performance of a computer system?\n5.How do you solve the problem of slow CPU performance while it is in operation?\nPart IV: Discussion Questions \n1.Discuss in groups the problems organizations face if they do not take timely backup?\n2.Form a group and maintain a computer that does not work entirely. Write down the procedures you followed to identify the problem and fix the problem. Share your experience with the class."
        },
        {
            "page_number": 138,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 132Learning Outcomes\nAt the end of this unit, students will be able to:\nDefine computer programs \nState and describe types of programming languages\nExplain syntax and semantics of programming languages\nExplain variables and data types\nDifferentiate the concept of statements and expressions in Python\nAnalyze simple programs written in Python\nWrite simple programs with input and output \nUnit Overview\nA computer program is a set of instructions that commands a computer what to do. \nComputers do whatever task they do by simply following the instructions stated in programs. This unit covers topics related to computer programs including programming languages, syntax, and semantics. The high-level programming language known as Python is used to demonstrate the basic concepts of programming. \n6.1. Types of Programming Languages\nBrainstorming 6.1\nHow do computers do the types of tasks we observe them doing?\nProgramming languages are computer languages that are used to write different types of computer programs. They are generally grouped into machine language, assembly language, and high-level language.6UNITFUNDAMENTALS OF \nPROGRAMMING"
        },
        {
            "page_number": 139,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 133UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\n6.1.1 Types of Programming Languages\nMachine LanguageMachine language is a low-level computer language. It is a language in which \neverything including instructions, numbers, and memory locations are represented in 1s and 0s – binary system. Machine language is the language that computers understand directly without any need for translation. That is why it is very fast and uses memory efficiently. However, writing programs in machine language is very difficult.\nAssembly LanguageAssembly language is also a low-level computer language but, instead of 1s and \n0s, it uses symbols known as mnemonics. Though it is easier than using a binary system, assembly language is still difficult. \nSince computers do not directly understand any program outside the machine \nlanguage, programs that are written in assembly language require a special type of software. This software is known as Assembler, and it is used to translate assembly \nlanguage instructions into machine language. \nHigh-Level LanguageHigh-level languages are closer to human languages compared to both assembly \nand machine languages. This type of language allows programmers to focus more on the problem they want to solve than on the programming language. Examples of high-level programming languages include C, C++, Java, C#, Python, Perl, and Ruby.\nJust like assembly language programs, high-level language programs also cannot \nbe directly executed by the computer. The programs have to be first translated into a machine language using translator software. Depending on the programming language, the translator software can be either a Compiler or an Interpreter.\nCompilers translate high-level language written programs all at once into machine language. The machine language is then executed by the computer. Examples of programming languages that use compilers are C, C++, Java, and C#."
        },
        {
            "page_number": 140,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 134UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nInterpreters, on the other hand, translate and execute programs a statement at a \ntime. They don’t translate the whole program together as do compilers. Examples of programming languages that use interpreters include Python, Perl, and Ruby. \n6.1.2 Syntax and SemanticsLike any human language, all programming languages have syntax and semantics. \nSyntax refers to the rules of the programming language. It defines the structure or \ngrammar of the language that programs should strictly follow. The semantics of a programming language, on the other hand, is related to the meaning of elements of a program and what they do.\nA program must be written with the correct syntax dictated by the programming \nlanguage for the program to be executed by the computer. If a program violates any of the syntax rules of a language, the compiler or the interpreter produces an error message. Such type of error is known as a syntax error. \nA program can have no syntax error and get executed properly but can still behave in a way different from what it is intended to. This kind of error is known as logic \nerror and is associated with the semantics of a language. Since compilers or interpreters do not catch logic errors, they are far more difficult to identify and fix than syntax errors.\nLinks\nSee Section 6.2 for practical examples of syntax and logic errors. \nActivity 6.1\n1.Compare and contrast the three types of programming languages.\n2.Why are logic errors more difficult to fix than syntax errors?\n6.2. Basics of Python\nPython is one of the popular high-level programming languages in use today. It is widely considered a much easier language to learn. This is one of the main reasons why it is a widely chosen language for teaching programming to those who are new to programming."
        },
        {
            "page_number": 141,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 135UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nPython has a free integrated development environment known as IDLE. IDLE stands \nfor Integrated Development and Learning Environment. To write Python codes, the interactive interpreter or the text editor of the IDLE can be used. The interactive \ninterpreter is used to write one line of Python code at a time and is less convenient to write and execute a large number of codes. Using the text editor, however, any number of codes can be written and get executed with a single command.   \n6.2.1 Using the Interactive InterpreterThe Interactive Interpreter contains a Python shell, which is a textual user interface \nused to work with the Python language. The Interactive Interpreter is displayed when the IDLE is opened. Figure 6.1 shows the Interactive Interpreter.\nFigure 6.1 IDLE Interactive Interpreter\nLinks\nSee Section 6.4 to learn about expressions in Python. \nNotes\nThe >>> is where codes are written and is called the prompt. After \na user writes a code and presses the enter key, the prompt (>>>) reappears for the user to write the next code. \nThe following example demonstrates what the Interactive Interpreter does when the enter key is pressed after a simple expression is written."
        },
        {
            "page_number": 142,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 136UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nNotes\n5+6 is a syntactically valid expression that evaluates to 11. Therefore, \nthe Python interpreter evaluated the expression and displayed 11. If, for example, a syntactically invalid expression like 5+ is given, the interpreter generates the following syntax error:\nTo display something on the screen, the print() function is used in Python. The following example shows how a string is displayed using the print() function. \nNotes\nNote that the IDLE uses different types of colors for the different elements of a Python code to make them easily distinguishable. By default, outputs are displayed in blue color; functions are displayed in purple color, and strings are displayed in green color. A string is a sequence of characters placed under quotation marks such as ”Hello World” as can be seen in the above example. See Table 6.1 for more on strings and operators in Python.\nLinks\nSee Section 6.5 for more on the print() function.  \nActivity 6.2\n•\tUse the print() function and display your full name on the screen using the \ninteractive interpreter. \n6.2.2 Using the Text Editor\nPython codes can be written in a file using the text editor of Python’s IDLE. The \ncode that is kept in such files is known as a script. A file that keeps Python scripts is saved with the .py extension and is called a script file."
        },
        {
            "page_number": 143,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 137UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nFigure 6.2 Opening a Text Editor\nA script file can be easily created by selecting “New File” from the “File” menu \nin the IDLE’s interactive interpreter as shown in Figure 6.2. Then the text editor is opened in a separate window, and it looks something like what is shown in Figure 6.3.\nFigure 6.3 Python IDLE’ s Text Editor\nNotes\nNote that the prompt (>>>) is not shown in the text editor. The >>> appears only when code is written in the interactive interpreter, not in the text editor. While only one line of code is written and executed in the interactive interpreter, as many lines of code as required can be written in the text editor. \nThe example shown in figure 6.4 is a script that calculates and displays the area of a circle for a given radius value of 3. Before the script is run/executed, the script has to be saved with the .py extension by selecting the “save” option from the “file” menu in the text editor. To execute the script, the “Run Module” option from the “Run” Menu should be selected. After the script is executed, the output is displayed in the IDLE shell/interactive interpreter in a format as shown in the figure below."
        },
        {
            "page_number": 144,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 138UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nPython Script Output on the IDLE Shell\nFigure 6.4 Running a script file  \nNotes\nNote the following points from the script shown above:\nThere are four statements in the script. However, the script is executed \nwith a single command.\nThere is no prompt (>>>) in the script. The prompt is shown only in the interactive interpreter. \nThough there are four statements in the script, only one output is shown in the IDLE shell. This is because it is only the last statement that produces an output.\nThe output of a script written in the text editor is shown in the IDLE shell or the interactive interpreter. \nLinks\nThe * is multiplication operator in Python and ** is exponentiation operator. Operators are discussed in section 6.3\nLinks \nSee section 6.4 to learn about statements in Python. \nThe example in Figure 6.5 demonstrates a logic error that is related to the semantics of programming languages. \nPython Script Output on the IDLE Shell\nFigure 6.5 Logic error"
        },
        {
            "page_number": 145,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 139UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nNotes\nNote that the area of a circle in the above example in Figure 6.5 is \nincorrectly calculated as “area=PI*radius*2”. The correct formula for the area of a circle is “area=PI*radius**2”. However, the interpreter did not generate any error and simply displayed the incorrect output. This is a logic error : even though the program does not have any \nsyntax error, it does not produce the intended correct output.  \nThe * symbol serves as a multiplication operator in Python. Table 6.1 of this chapter has a list of operators in Python and examples of how they are used.\nActivity 6.3\n1.What is the difference between Python’s interactive interpreter and text editor?\n2.Use the print() function to display your full name on the screen using the text \neditor. \n6.3. Variables and Data Types\n6.3.1 Variables\nVariables are computer memory locations. They are the means to store data in \ncomputer memory. A variable is used every time user data or intermediary data is needed to be kept. \nIn Python, a variable is created along with its value. Values are assigned to variables \nusing the assignment (=) operator, which has two operands. The operand to the left of the operator is always a variable while the operand to the right of the operator is either a literal value or any other type of expression. The following example \ndemonstrates how a variable named “x” is created with the value 5 in the interactive interpreter."
        },
        {
            "page_number": 146,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 140UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nThe example that follows shows how a variable named “y” is created and assigned to \nthe result of an expression. The value of “y” would be the sum of 5 and 9, which is 14. \nLinks\nSee section 6.4 to learn about expressions in Python. \nTo see the current value of a variable, you can simply type the name of the variable and press the enter key in the interactive interpreter. The value will then be displayed as shown in the following example. \nThe value 25 that is shown in blue color is the value of the variable y. Moreover, a variable can be assigned to another value than the one it was previously assigned to. The following example shows how the value of y is changed from 25 to 30.\n6.3.2\t Identifier\nThe name that is given to variables is called an identifier . Identifiers are a string \nof one or more characters and have to conform to some rules in Python to be \nconsidered valid. The rules of identifiers are:\n•\tThe first character should be either a letter or an underscore ( _ ).\n•\tIf the identifier is made up of more than one character, the characters after the first one should be a letter, number, or underscore.\n•\tAn identifier cannot be the same as any of the keywords in Python. See Figure \n6.6 for a list of keywords in Python.\n•\tIdentifiers are case-sensitive. (For instance, x and X are considered as different identifiers in Python)"
        },
        {
            "page_number": 147,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 141UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nand       del       from      not       while    \nas        elif      global    or        with     assert    else      if        pass      yield    break     except    import    print              class     exec      in        raise              continue  finally    is        return             def       for       lambda    try\nFigure 6.6 Keywords in Python\nNotes\nKeywords are reserved words that have predefined meanings in a \nprogramming language.\nAccording to the above rule, the following are valid identifiers:\nX\nareaarea_5x5\nThe identifiers given below, on the other hand, are not valid identifiers as they \nviolate the rules stated above. \n1x\n*_5whileX_&\nNotes\nThe first two identifiers begin with a character that is not allowed. The \nthird identifier used the name that is considered a keyword in Python. The last identifier is invalid because its last character is not allowed to be used in identifiers."
        },
        {
            "page_number": 148,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 142UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nAlthough meeting the above requirements suffices to define a valid identifier, it is \nalways recommended to use identifiers that are self-descriptive. Self-descriptive identifiers are names that express what they are intended to be used for. Using such types of identifiers makes programs more understandable and clearer. \nActivity 6.4\n•Identify the valid identifiers and explain why they are so.\na. x\nb. 1xc. _xd. x*y\n6.3.3  Data Types\nA data type is a classification that specifies the type of values a variable can have, \nand the type of operations defined on the values. Integer (int), floating-point number (float), string (str), and Boolean (bool) are some of the major built-in data types in Python. \nNotes\nFloating point numbers are numbers with decimal points that represent real numbers. See Table 6.1 for more on Python operators. \nBuilt-in data types are data types that are built into the Python language.\nThe data type of variables in Python is set when values are assigned to the variables. If an integer number is assigned to a variable, the variable will be of type int. If a string is assigned to a variable, the variable then will be of type str. The following example in the interactive interpreter shows how data types are set to variables based on the value assigned to the variables."
        },
        {
            "page_number": 149,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 143UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nNotes\nAs you can see in the above example, string values should be placed \nin quotation marks. \nTo learn the data type of a particular variable, the type() function can be used. Simply write type(variable_name) and press enter. The interactive interpreter displays the data type of the variable as shown above. In the above example, the data type of the variable x is intwhile the data type of the variable y is str. \nThe four major built-in data types in Python and their descriptions are given in Table 6.1. The table also contains the various types of operators that apply to the respective data types with examples of how the operators are used."
        },
        {
            "page_number": 150,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 144UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nTable 6.1 Data types\nData \nTypeMeanings and sample valuesAssociated operators Sample expressions\nInt Integer numbers\nExample:\n3445610Arithmetic operators \n•\tAddition (+)\n•\tSubtraction (-)\n•\tDivision (/)\n•\tFloor Division (//)\n•\tMultiplication (*)\n•\tModulus (%)\n•\tExponentiation (**)\nfloat Floating-point \nnumbers. \nExample:4.510.6100.0Arithmetic operators \n•\tAddition (+)\n•\tSubtraction (-)\n•\tDivision (/)\n•\tMultiplication (*)\n•\tExponentiation (**)\nStr A sequence of \ncharacters en-closed in a dou-ble quotation.\nExample:”Hello world”Concatenation (+)\nBool True or False \nvalues.\nExample:TrueFalseBoolean operators \n•\tand \n•\tor \n•\tnot"
        },
        {
            "page_number": 151,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 145UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nNotes\nNote the following points on some of the operators listed in Table 6.1:\nThe + operator behaves differently depending on the type of the operand. \nWhen the operands are integer or floating-point numbers, the operator serves as a normal addition operator known in mathematics. But when the operands are strings, the operator serves as a concatenation operator, which combines the strings given to it into one. \nThe modulus (%) operator returns the remainder of the division of the left operand by the right one.\nThe floor division also known as integer division (//) operator divides and returns only the integer value of the quotient. The division (/) operator, however, generates the exact division result including the fraction part if any.   \nThe exponentiation (**) operator raises the left operand to the power of the right operand.\nVariables can be assigned to values of a different data type than the one they were previously assigned to. Therefore, the value of a variable, as well as its type, can be changed to something different from what it was first set to in Python. As you can see in the following example, the variable “x” is first assigned to a floating-point number. Then it is assigned to a string value “Hello”. The second assignment results in a change not only in the value but also in the data type of the variable."
        },
        {
            "page_number": 152,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 146UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nActivity 6.5\n• Write the results of the following expressions.\na. 10%2 ________________\nb. 2.5**3 ________________c. 11//3 ________________\n6.3.4 Data Type Conversion\nType conversion is the process of converting the value of one data type to another. \nType conversion is of two types in Python: implicit conversion and explicit conversion. \nImplicit conversion is a type of conversion in which Python does the conversion \nwithout the involvement of the programmer. This is usually done to avoid loss of data. See the following example.\nNotes\nNote the following points from the above example:\nThe data types of x and y are int and float respectively as shown in the example. \nThe variable z is assigned to the value of x+y, and its data type is automatically set to float. This is because Python always converts smaller data types (int in this case) to larger data types (float in this case) to avoid data loss. If the data type of z is set as int, the value that will be stored in it will not be the correct value ."
        },
        {
            "page_number": 153,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 147UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nExplicit conversion  is a type of conversion of one data type to another that is done \nby the programmer. The predefined functions associated with the different kinds of \ndata types such as int(), float(), and str() are used for explicit conversion.   \nThe syntax for conversion is given as follows:\n<required_dataType>([value])\nThe following example demonstrates how Python responds to an attempt to add \nstring and integer variables. \nNotes\nAs shown in the above example, Python does not allow adding an integer number with a string. If the numbers stored in the integer and the string variables are to be added up, an explicit type conversion has to be used. See the following example to learn how the above error is avoided using explicit type conversion."
        },
        {
            "page_number": 154,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 148UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nNotes\nAs shown in the above example, the code did not generate any error \nthis time. This is because explicit type conversion is used to convert the value of y to int type before it is added with the value of x.  \nActivity 6.6\n•\tWrite the expressions used to convert the value 1.5 into integer as well as \nstring values?\n6.4. Statements and Expressions\nA statement is an instruction that the Python interpreter executes. As discussed in \nthe introduction section, instructions are the orders or commands that the computer follows to do something. Assignment and print() statements are the two types of statements that are in some ways mentioned in the previous sections. An assignment statement, for instance, assigns value to a variable while a print() statement displays the value that is given to it. There are several other types of statements in Python including the “if” statement, “while” statement, and “for” statement, which are covered in the 12\nth Grade IT textbook. \nThe example in Figure 6.7 demonstrates the use of assignment and print() statements in Python. \nPython Script Output on the \nIDLE Shell\nx=5\ny=10print(x+y)\nFigure 6.7 Assignment and print() statements\nNotes\nAs you can see in the output in Figure 6.7, it is only the print statement \nthat produces an output. The two assignment statements simply assign values to the variables and do not produce any output."
        },
        {
            "page_number": 155,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 149UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nExpressions are what the Python interpreter evaluates to produce some value. An \nexpression could be a simple literal value, a variable, or something more complex which is a combination of literals, variables, and operators.\nTable 6.2 shows the three types of expressions, and how they are used in assignment \nand print() statements.\nTable 6.2 Types of expressions\nLiteral value  expressions Variable expressions Complex expressions\nx=7\ny=“Hello”z=5.5print(“Python”)x=yprint(x)x=4*(y-5)print(x+5)\nNotes\nNote that the expressions in the above table are those encircled with \nred. \nUsing the print() and assignment statements, Figure 6.8 further shows the differences and relationships between statements and expressions in Python. \nFigure 6.8 Statements and Expressions\nLiteral value  expressions\nx=7\ny=\n“\nHello\n”\nz=5.5\n“\nPython\n”\nx=y\nprint(x)\nx=4*(y-5)\nprint(x+5)"
        },
        {
            "page_number": 156,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 150UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nIf an expression is typed into the interactive interpreter, the Python interpreter \nevaluates and displays the value as shown in the following example. \nNotes\nHowever, if any expression is written in the text editor, it will not be displayed unless it is put inside the parenthesis of a print() statement. Therefore, to see the value of expressions on the screen while using the text editor, the print() function has to be used.  \nActivity 6.7\n1.What is the difference between statements and expressions in Python?\n2. Identify the statements from the following list that produce outputs.\nx=4*3\ny=”Programming in Python is fun ”\nprint(y)z=x/2print(z)y=10print(type(x))\n3. When the code given in activity #2 is executed, what would be the out-\nput on the screen?"
        },
        {
            "page_number": 157,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 151UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\n6.5. Writing a Simple Program\nPrograms normally accept input and process the input to produce an output. As \nshown in the preceding sections, the print() function is used to produce output on the IDLE shell. As shown in multiple examples in the preceding sections, the print() function has the following syntax:\nprint([value])\nA function is a piece of code that performs some task and is called by its name. It \ncan be passed data as input to operate on, and can optionally return data as output. print(), input() and type() are examples of functions.\nIn the above syntax, the name of the function is print. The value that is given to the \nprint() function as input can be any type of expression that evaluates to some value. \nSee the example in Figure 6.9 for the different types of values that the print() \nfunction can take as input. \nNotes\nA function is a piece of code that performs some task and is called \nby its name. It can be passed data as input to operate on, and can optionally return data as output. print(), input() and type() are examples of functions.\nIn the above syntax, the name of the function is print. The value that is \ngiven to the print() function as input can be any type of expression that evaluates to some value. \nSee the example in Figure 6.9 for the different types of values that the \nprint() function can take as input."
        },
        {
            "page_number": 158,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 152UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nPython script Output on the \nIDLE Shell\nx=6.5\nprint(5)print(x)print(x*5)print( ”This is a string”)\nFigure 6.9 Inputs of the print() function\nTo accept input from the keyboard, the input() function is used. The input() function \nhas the following syntax. \nvariable_name=input([prompt])\nNotes\nThe following points are important to understand how the input() function works:\nThe prompt that is given as input to the input() function is a string that tells the user what kind of value the user is expected to enter. Example “Enter an integer number”\nAfter the user enters a value and presses the enter key, the input() function returns the value the user entered as str type. This means that irrespective of the type of value that the user enters, the value that the input() function returns is of str type. Therefore, if the value that is required is of another type, the str type should be converted to the required type. \nExample:\nx=input(”Enter an integer number ”)\nx=int(x)\nThe value the input() function returns should be assigned to a variable. \nThis indicates that when the input() function is used, it is used as an expression in an assignment statement."
        },
        {
            "page_number": 159,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 153UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nActivity 6.8\n• Write a program in the text editor that has the following elements:\n°Accept the name, age, and Body Mass Index (BMI) of a person \nfrom the keyboard using the input() function,\n°Convert the values to their appropriate data type , and\n°Display the values using the print() function.\nThe following example demonstrates how the input() and the print() functions are \nused in a program. It shows how the input() function is used to accept data from the keyboard, and how the print() function is used to display the result on the screen. The program simply accepts the radius of a circle from the user and displays the area and circumference of the circle. \nPython Script\nPI=3.14\nx=input( ”Enter the radius: ”)\nradius=float(x)area=PI*radius**2circumference=2*PI*radiusprint( ”The area of the circle is: ”)\nprint(area)print( ”The circumference of the circle is: ”)\nprint(circumference)\nOutput on the IDLE Shell\nFigure 6.10 Using input() and print() functions"
        },
        {
            "page_number": 160,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 154UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nNotes\nThe following points are important to note regarding the program shown in \nFigure 6.10:\nThe prompt given to the input() function should be written in a manner that helps the user clearly understand what to do.\nThe data type of the value that is returned by the input() function is changed to float, which is the right data type for values like the radius of a circle.\nprint() function displays its outputs in separate lines. Therefore, the strings and the values are displayed each on a separate line. \nIn the example shown in Figure 6.10, a print() function is used to display each output separately. However, if multiple values are required to be displayed in one line, the values should be given to the print() function with comma separation. See Figure 6.11 for the modified version of the program in Figure 6.10. \nPython Script\nPI=3.14\nx=input( ”Enter the radius: ”)\nradius=float(x)area=PI*radius**2circumference=2*PI*radiusprint( ”The area of the circle is: ”, area)\nprint( ”The circumference of the circle is: ”, circumference)\nOutput on the IDLE Shell\nFigure 6.11 Displaying multiple values in one line"
        },
        {
            "page_number": 161,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 155UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nNotes\nAs shown in Figure 6.11, the string literal values and the variables are \ngiven to the print() function with comma separation. As a result, the results are displayed in one line. \nActivity 6.9\n1. Write a program that accepts two numbers from the user and displays \nthe product on the screen. \n2. Write a program that displays the BMI of a person by accepting the \nweight and height from the keyboard."
        },
        {
            "page_number": 162,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 156UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nUnit Summary\nIn this unit, you have learnt about:\n•what is meant by a computer program\n•the three types of programming languages, namely, machine language, \nassembly language, and high-level language\n•translation software, such as Assembler, Compiler, and Interpreter\n•the difference between compilers and interpreters\n•the concept of syntax and semantics in programming languages, and the associated error types\n•what the high-level programming language called Python is\n•how to write Python scripts using the interactive interpreter and the text editor\n•how to save Python script files and how to run the scripts \n•the concept of variables and data types in Python\n•valid and invalid identifiers\n•the basic built-in data types\n•assigning values to variables using an assignment operator\n•operators, such as arithmetic operators (+,  -, /, //, %, *, **), Boolean operators (and, or, not) and assignment operator (=)\n•conversion of values from one data type to another using explicit and implicit type conversion methods\n•the concept of statements and expressions in Python \n•the differences and relationships between statements and expressions\n•how to write a simple program by reading data from the keyboard using the input() function and displaying results using the print() function"
        },
        {
            "page_number": 163,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 157UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nKey Terms\nAssembler is a software used to translate programs written in assembly \nlanguage into machine language.\nAssembly Language is a low-level programming language that uses symbols/\nmnemonics.\nAssignment Operator (=) is an operator used to assign values to variables.Binary System is a system in which everything is represented in terms of 1s \nand 0s.\nbool is a data type that represents True or False values.Data type specifies the type of values a variable can have and the operations \ndefined on the values.\nExplicit type conversion is a data type conversion done by the programmer \nusing built-in functions.Expression is what the Python interpreter evaluates to a certain value.float is a data type for floating-point numbers.\nFloating Point Number is a number with a decimal point.Function is a piece of code that performs some tasks.High-level Language is a programming language closer to human language.Identifier is the name of variables.\nIDLE shell is the same as the interactive interpreter.IDLE stands for Integrated Development and Learning Environment.Implicit type conversion is a data type conversion done by Python without \nthe involvement of the programmer.int is a data type for integer values.Keywords are reserved words that have predefined meanings in Python.Machine Language is a low-level programming language that the computer \nunderstands directly.\nAssembler"
        },
        {
            "page_number": 164,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 158UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nProgram is a set of instructions that commands the computer what to do.\nProgrammer is a professional who writes computer programs.Programming Languages are computer languages used to write computer \nprograms.\nPython is a popular high-level programming language.Python’s Interactive Interpreter  contains Python shell to write and execute \nPython codes one line at a time.Python’s Text Editor is a text editor to write unlimited lines of Python codes \nthat can be saved.Script file is a file with Python scripts.Script is codes found in a file saved with .py extension.Semantics is related to the meaning of elements of a program and what they \ndo.Statement is an instruction executed by the Python interpreter.str is a data type for strings enclosed with a double/single quotation.Syntax is the grammatical rules of a programming language.Type conversion is the process of converting values from one data type to \nanother.\nVariable is a computer memory location used to store data."
        },
        {
            "page_number": 165,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 159UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nReview Questions\nPart I: Write True if the statment is correct and  False if  it is incorrect.\n1.A program written in assembly language can be directly understood by \nthe computer.\n2.It is only high-level programming languages that have syntax and semantics. \n3.Syntax errors are easier to fix than logic errors. \n4.Python’s interactive interpreter can be used to execute multiple lines of codes at a time. \n5.When Python’s text editor is opened, the prompt (>>>) immediately appears. \n6.Once a variable is set to a specific data type, its type cannot be changed.\n7.The results of the two expressions 5/2 and 5//2 are not the same.\n8.In implicit type conversion, the programmer has to use built-in functions to convert values from one type to another. \n9.The data type “bool” has only two possible values.\n10.Expressions and statements are the same things in Python."
        },
        {
            "page_number": 166,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 160UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nPart II: Match the items given under column B with associated items in \ncolumn A\nA B\n1.Rules of a language \n2.A keyword such as str \n3.Name of variables \n4.That which is evaluated to some value \n5.Meanings of elements of a language \n6.1s and 0s \n7.Interface to work with Python language \n8.Mnemonics \n9.Translating the whole program \n10.Translating one line at a timea. Interpreter \nb. Compiler c. Machine Language d. Assembly Languagee. Statementf. Syntax g.Operator\nh. Semantics i. IDLE shell j.Identifier \nk. Type conversionl. Data type m. Expression \nPart III: Choose the correct answer from the given alternatives.\n1.Which of the following programming languages is the one that is directly \nunderstood by the computer?\nA. Assembly Language B. High-level language\nC. Machine language D. Python \n2.Which of the following is not an example of high-level programming languages?\nA. C++ B. Java\nC. Python  D. None of the above \n3.The operand on the left side of the assignment operator (=) is always:\nA. A variable B. String value\nC. Integer value D. An expression"
        },
        {
            "page_number": 167,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 161UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\n4.Which of the following is a valid identifier?\nA. &_x  B. _xs. \nC. 123  D. print  \n5.Identify the function that is not used for type conversion purposes.\nA. int() B. type()\nC. str() D.float()\nPart IV: Fill in the blank spaces\n1.A programming language that is an example of those that use compilers is \n____________.\n2.A special type of software used to translate assembly language programs into machine language is known as _____________.\n3.A type of error related to violating the rules of a programming language is known as ______________.\n4.A type of error related to the semantics of a programming language is known as _____________.\n5.The extension with which Python script files are saved by is _________."
        },
        {
            "page_number": 168,
            "text": "PBINFORMATION TECHNOLOGY GRADE 11~STUDENT TEXTBOOK 162UNIT-6Fundamentals of Programming  <Unit>-<No><Running Header>\nPart V: Code Writing\n1.Using the print() function, write a program in the text editor that displays \nall of the subjects you are taking in the current semester each on a new line. \n2.Write a program in the text editor that does the following:\na. Creates three variables with integer, floating-point number, and \nstring values. \nb. Displays their values and data types. (hint: use the type() function to know the data types)\n3.Write a program in the text editor that does the following:\na. Creates a variable with one type of value.\nb. Reassigns the variable to a different type of value.\nc. Displays the data type of the variable before and after the \nreassignment.\n4.Write a program in the text editor that converts the following two string \nvalues into floating-point numbers and displays their product on the screen. \n”4.5” ”30.2”\n5.Write a program that accepts two numbers from the user and displays the following:\na. The sum\nb. The productc. The average value"
        },
        {
            "page_number": 169,
            "text": ""
        },
        {
            "page_number": 170,
            "text": ""
        }
    ]
}